{
  "business name": "CareMinds",
  "website url": "https://careminds.io/",
  "location": "Diego, CA 92108",
  "industry": "Human Resources",
  "first name": "Pavel",
  "middle name": "",
  "last name": "Tantsuira",
  "title": "Associate",
  "email": "deresistance402@gmail.com",
  "web copy": "106913",
  "email 1": "Hey Pavel,\n\nNo matter how skilled your team is, unclear messaging always costs you.\n\nEvery vague question or request triggers more emails, calls, and meetings.\n\nThat’s client time you won’t get paid for and profit leaking out unnoticed.\n\nWe create whiteboard videos that turn complicated offers into simple stories your clients actually get.\n\nIf you’d like, I can put together a quick video script to get started.\n\nIf this isn’t a fit, reply NO and I’ll back off.\n\nAll the best,\n– Trent,\nToon Theory\ntoontheory.com",
  "email 2": "Hi there Pavel,\n\nNot sure if my earlier note reached you, so I’m trying again.\n\nAs I said, every unanswered question or fuzzy brief means more emails, calls, and meetings.\n\nThat’s unpaid time and profit quietly slipping away from your business.\n\nThat’s why we turn your offer into a short whiteboard video that does the explaining for you, every time.\n\nNo follow-up needed — I’ll still write something quick if it’s even remotely useful.\n\nIf you’d prefer I didn’t, reply 'NO' and I’ll cross you off.\n\nHave a good one,\n– Trent,\nToon Theory\nhttps://toontheory.com",
  "email 3": "Hello Pavel,\n\nLast call to see if this might be helpful before I step back.\n\nAs I said earlier, when your message isn’t clear, deals drag out or stall — costing you billable hours and money you won’t recover.\n\nOur whiteboard explainers make your value crystal clear, so prospects get it fast and your business runs smarter.\n\nI enjoy making these — happy to sketch a quick sample script for you.\n\nUse it however you like.\n\nAll the best,\n– Trent,\nToon Theory\nhttp://www.toontheory.com/",
  "initial date": "",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "no reply",
  "subject": "",
  "initial time": "",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
