{
  "business name": "Leinburd Corporation",
  "website url": "https://leinburd.com/",
  "location": "",
  "industry": "Legal Services",
  "first name": "Sorèl",
  "middle name": "",
  "last name": "Leinburd",
  "title": "Senior Partner",
  "email": "deresistance403@gmail.com",
  "web copy": "30880",
  "email 1": "Hi Sorèl,\n\nUnclear messaging turns good work into lost opportunities.\n\nWhen communication falls short, your business spends more time fixing problems than creating value.\n\nThat lost productivity hits your profits hard.\n\nWe can help you lock in your proposition with a whiteboard video that does most of the talking.\n\nJust for reading, I can send over a rough 10-second teaser if you like.\n\nIf it’s not a fit, reply NO and I’ll bow out.\n\nUntil next time,\n– Trent,\nToon Theory\nhttp://www.toontheory.com",
  "email 2": "Hi there Sorèl,\n\nResending this in case it got lost\n\nHere's the thing, most teams never track how much they lose repeating the same idea in different ways.\n\nBut those unbilled hours go somewhere — extra calls, another email there and one more useless meeting.\n\nThat’s why we condense the whole pitch into a whiteboard video you and your prospects can watch once and actually remember.\n\nIf you want, I’ll put together a short teaser just so you have it.\n\nIf it’s not for you, reply 'NO' and I’ll head out.\n\nBest regards,\n– Trent, Founder\nToon Theory\ntoontheory.com/",
  "email 3": "Hello there Sorèl,\n\nBefore I close the loop, I wanted to send this one more time.\n\nAs I said before, unclear or vague requests create extra work, follow-ups, and revisions — none of which you can bill for, yet all cost real money and wasted effort.\n\nOur whiteboard videos give you a clear, consistent narrative from the first hello all the way to the final close.\n\nI can put together a small teaser if you’re curious — no need to reply.\n\nJust something to keep if it’s helpful down the road.\n\nCatch you later,\n– Trent, Founder\nToon Theory\nhttps://ToonTheory.com",
  "initial date": "2025-08-10",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "no reply",
  "subject": "You’ve probably never gotten an email like this",
  "initial time": "11:12",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
