{
  "scraped_at": "2025-06-29T16:37:00.633875",
  "total": 2,
  "records": [
    {
      "business name": "Accountant Analytics",
      "website url": "https://accountantanalytics.com/",
      "location": "Austin, TX 78717",
      "industry": "Accounting, Tax Return Preparation, Accountant, Bookkeeping Services, Taxes",
      "first name": "Barton",
      "Middle Name": "",
      "last name": "Bumpus",
      "Decision Maker Title": "Owner",
      "web copy": "Accountant Analytics.com - Accounting Services, Consulting Services Home Tax Preparation Tax Planning QuickBooks SAP BPC Tableau Training Services Privacy Policy Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Let us keep your business in order! Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Let us keep your business in order! About Us Your Taxes, Simplified We re dedicated to our clients. And we've represented them in audits with the IRS, FTB, and EDD. This keeps us current on tax law so we re always ready for the toughest situations. Quickbooks ProAdvisor We help clients looking to implement Quickbooks, convert to Quickbooks, enhance your Quickbooks implementation, create a budget, cash flow forecast and manage a number of planning items and KPIs. Accounting & Bookkeeping We can replace your back office with accounting, payroll, consulting services, bookkeeping and tax preparation support. When it comes to complex issues, rely on us. Your Business is Our Business We have experience in a number of software platforms - from QuickBooks, SAP, Hyperion, Oracle, Anaplan, Informatica - and we are happy to help you learn to orchestrate your results instead of just reacting. My Blog Contact Us We know that the accounting needs for each business or family are unique. Use our form to tell us more about your needs, and concerns, and we will give you a free quote on regular or one-time accounting services. Message us on WhatsApp Accountant Analytics.com 614-832-4700 ; info@accountantanalytics.com ; Hours Monday - Friday: 9am - 5pm Saturday: By appointment Sunday: Closed Subscribe Copyright 2023 Accountant Analytics.com - All Rights Reserved. Powered by GoDaddy This website uses cookies. We do use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept Accountant Analytics.com - Accounting Services, Consulting Services Home Tax Preparation Tax Planning QuickBooks SAP BPC Tableau Training Services Privacy Policy Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Let us keep your business in order! Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Let us keep your business in order! About Us Your Taxes, Simplified We re dedicated to our clients. And we've represented them in audits with the IRS, FTB, and EDD. This keeps us current on tax law so we re always ready for the toughest situations. Quickbooks ProAdvisor We help clients looking to implement Quickbooks, convert to Quickbooks, enhance your Quickbooks implementation, create a budget, cash flow forecast and manage a number of planning items and KPIs. Accounting & Bookkeeping We can replace your back office with accounting, payroll, consulting services, bookkeeping and tax preparation support. When it comes to complex issues, rely on us. Your Business is Our Business We have experience in a number of software platforms - from QuickBooks, SAP, Hyperion, Oracle, Anaplan, Informatica - and we are happy to help you learn to orchestrate your results instead of just reacting. My Blog Contact Us We know that the accounting needs for each business or family are unique. Use our form to tell us more about your needs, and concerns, and we will give you a free quote on regular or one-time accounting services. Message us on WhatsApp Accountant Analytics.com 614-832-4700 ; info@accountantanalytics.com ; Hours Monday - Friday: 9am - 5pm Saturday: By appointment Sunday: Closed Subscribe Copyright 2023 Accountant Analytics.com - All Rights Reserved. Powered by GoDaddy This website uses cookies. We do use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept Shop Home Tax Preparation Tax Planning QuickBooks SAP BPC Tableau Training Services Privacy Policy Copyright 2023 Accountant Analytics.com - All Rights Reserved. Powered by GoDaddy This website uses cookies. We do use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept Tax Preparation Home Tax Preparation Tax Planning QuickBooks SAP BPC Tableau Training Services Privacy Policy Tax Preparation Tax Avoidance is Legal. Tax Evasion is not! We can help you keep compliant with State and Federal Income Taxes. We can help you get caught up and stay ahead with Tax Planning. Schedule a Session to Discuss Tax Preparation Copyright 2023 Accountant Analytics.com - All Rights Reserved. Powered by GoDaddy This website uses cookies. We do use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept Tax Planning Home Tax Preparation Tax Planning QuickBooks SAP BPC Tableau Training Services Privacy Policy \"A penny saved is a penny earned.\" Benjamin Franklin Tax Planning We help you with Tax Planning. We analyze your current and prior year taxes and identify strategies that you can implement to save money on taxes. Typical savings for individuals is $3,000-$5,000 annually. Small Businesses typically save between $10 and 30k annually. Let us help you keep more of your money! Schedule a Session More Info Tax Planning Session Tax Planning Session Tax Planning Session We gather some specifics regarding your taxes, your anticipated financials for the year, and identify strategies that save money. Our goal is to identify the key saving strategies and help you put together a plan to implement them. We can even help you implement them or provide quarterly reviews to ensure that you tracking towards your goal! Additional Savings Tax Planning Session Tax Planning Session Customers who sign-up for tax planning will save 25% on tax preparation fees. We want to make sure that we help you see the savings through! FAQs Tax Planning Session FAQs Want to know what the process is like? See our FAQ! FAQs FAQs Frequently Asked Questions What should I expect in a Tax Planning Session? Clients should expect two meetings and some homework during the tax planning phase. The first meeting will be an overview of the process, the outline of the tasks, and an agreement to move forward. This is followed by a working session where we review last year's taxes, current year financial results, current year financial forecasts (or provide some guestimates). Often we can provide a questionnaire that the client can fill out in advance that will make the working session go faster. Then finally, we will prepare and present expected savinigs along with an implementatiion plan for making those savings happen. How much time should I plan on this? That's a good question. However, the real question is how much time is $10,000 or more in saviings worth to you? We typically say that clients should expect between 5 and 10 hours to complete the process as inputs to the preparation of the plan. If we save you $10,000 (often a lot more) and you spent 10 hours working on it - that would be $1,000 an hour! What if there are no significant savings? Every client worries that there will be no savings. It is rare and it does happen. If we can't find any savings, then there is no charge for the review. Its that simple. Are the savings a one-time saving? Sometimes yes, but often they are recurring annually - which means they re-occur every. Clients love finding annual savings - its like giving them a pay raise! Is this confidential? Absolutely. We are fearce about protecting our clients and their condifentiality. We treat you the way we expect to be treated. Our Privacy Policy details our approach, but rest assure, we have the latest encryption products to ensure your identity and data are safe! Copyright 2023 Accountant Analytics.com - All Rights Reserved. Powered by GoDaddy This website uses cookies. We do use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept QuickBooks Home Tax Preparation Tax Planning QuickBooks SAP BPC Tableau Training Services Privacy Policy Shift Your Focus QuickBooks Our team of professionals can help you implement QuickBooks, clean up, or completely run your bookkeeping. We are fluent in charts of accounts, bookkeeping, reconciling, reporting, and compliance. We help you move to the digital age and transform the finance function to help you get more from your investment. Move to QuickBooks Site Content Bookkeeping Bookkeeping Bookkeeping We can keep your books, prepare financials, book transactions, and assist with many types of office functions so that owners can focus on the business. Planning Bookkeeping Bookkeeping We can help you prepare a budget, forecast, and organize your books to help you track your performance. Clean Up App Integration App Integration Got a books mess? Not sure what income, expense, asset, or liability values are? Give us a call. We can help get your books in alignment and make sure you have the controls you need to make sure you know. App Integration App Integration App Integration See an Application (app) from the QuickBooks app store that you have a question on? We can help.",
      "use cases": "Walking through the tax preparation process step-by-step | Explaining the benefits of proactive tax planning | Demonstrating how to navigate QuickBooks for small business owners | Showing how to create a budget that actually works | Clarifying the importance of cash flow forecasting for business growth | Illustrating how to set up and track key performance indicators (KPIs)",
      "services": "Tax Preparation | Tax Planning | QuickBooks | SAP BPC | Tableau Training Services | Accounting | Bookkeeping | Payroll | Consulting services | Budget creation | Cash flow forecasting | KPI management | Software implementation | Software conversion | Software training | App integration | Clean up services",
      "email 1": "Hi Barton,\n\nI came across Accountant Analytics recently and wanted to reach out directly.\n\nI'm Trent, I lead a creative studio called Toon Theory. We work with businesses like yours to turn abstract ideas into short, powerful videos that actually stick, especially for B2B services, thought leadership, and data-driven education.\n\nFor Accountant Analytics, I think there’s real potential to add a layer of visual storytelling that helps even more people 'get it' faster.\n\nOur animations are fully done-for-you: illustrations, scripting, voiceover, storyboard; and are often used for:\n\n• Walking through the tax preparation process step-by-step\n• Explaining the benefits of proactive tax planning\n• Demonstrating how to navigate QuickBooks for small business owners\n• Showing how to create a budget that actually works\n• Clarifying the importance of cash flow forecasting for business growth\n• Illustrating how to set up and track key performance indicators (KPIs)\n\nWhether it’s more signups, better retention, or faster understanding, these animations tend to move the needle where it counts.\n\nOpen to a quick preview? I could whip up a ten-second mock or short script tailored to something core at Accountant Analytics; purely exploratory.\n\nIf you're open to chatting more, just hit reply. And if you're curious, there’s a site link in the signature with a few past examples.\n\nThanks for putting something refreshing out there.\n\nWarm regards,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
      "email 2": "",
      "email 3": "",
      "message id": "",
      "message id 2": "",
      "message id 3": "",
      "initial date": "",
      "follow-up 1 date": "",
      "follow-up 2 date": "",
      "reply": ""
    },
    {
      "business name": "Sharagon Bookkeeping Services",
      "website url": "https://sharagon.com/",
      "location": "Austin, TX 78701",
      "industry": "Bookkeeping Services, Payroll Services",
      "first name": "Sharis",
      "Middle Name": "",
      "last name": "Tanue",
      "Decision Maker Title": "Owner/Director",
      "web copy": "Virtual Bookkeeping, Payroll, Sales Tax Services Skip to content Menu (737) 232-6858 E-mail Now The best move you can make for the future of your Business. Our services Book Free Consultation Now Sharagon Bookkeeping Services Virtual Bookkeeping, Payroll & Sales Tax Services At Sharagon Bookkeeping Services, we simplify your financial operations so you can focus on running and growing your business. From bookkeeping and payroll to sales tax and invoicing, we offer a seamless, all-in-one solution tailored to your needs. Our expert team delivers accurate, deadline-driven service, helping reduce your overall bookkeeping costs while maintaining the highest standards of accuracy and compliance. When you partner with Sharagon, we begin with a thorough review of your current financial position and long-term business goals. From there, we craft a personalized strategy and oversee your day-to-day needs by tracking payables, receivables and ensuring all of your business s financial transactions are recorded. Whether you re a small business or a growing firm, our experienced bookkeepers implement efficient, scalable systems that ensure your financial records are always in order. With real-time access to reports and dashboards, you ll gain clear, actionable insights that empower you to make confident business decisions. Let Sharagon Bookkeeping Services take the weight off your shoulders so you can stay focused on what matters most. Contact Sharagon Bookkeeping Services Virtual bookkeeper Free Consultation Spend Less Time on Bookkeeping, More Time on Growth Schedule Your Free Call. Contact Us Our Services Bookkeeping At Sharagon Bookkeeping Services, we understand that larger firms are equipped with many resources to handle their bookkeeping... Learn More Payroll Payroll is the most daunting task of the Human Resource department, which needs accuracy and must meet deadlines. Employee... Learn More Sales Tax Services Filing a correct Sales tax requires accuracy. It's also vital that you file and pay on time to avoid penalties and interest... Learn More Miscellaneous Services Without proper bookkeeping services, you run the risk of hitting cash flow crunches, spending... Learn More All Services Don't just take our word for it. They made the best move. Jeff Bausch verified Business Bookkeeping Services I signed into Bark looking for a professional bookkeeper and found one. I was called back at my request and advised on the spot as to what to do with my current situation. This is a company that looks out for your best interest. Omatie Gbenebitse verified Business Bookkeeping Services It was a true pleasure working with Sheris. She was honest, hardworking and saved our financial document at the last minute. Excellent and we will be using this service again. Bennett Krishock verified Bookkeeping Sharis was fantastic. I m terrible at bookkeeping and worse at taxes. Not only did Sharis make me feel comfortable that my return would be filed properly and on time, but she also helped me learn how to better prepare and understand future filings. I cannot recommend her enough. Sarah verified Bookkeeping Services I have only had my first meeting with Sharis, but she is very knowledgeable, professional, and approachable. She has calmed my nerves in regards to this very important aspect of my small business. Ngoc verified Sales Tax Filing Sharis was kind, and considerate. Her knowledges and skills are impeccable. She was responsive to my needs and concerns and explained things in ways that are easily digestible. I thoroughly enjoyed and appreciated my experiences with Sharis. Selena Dunham verified Bookkeeping Services Hiring Sharis was the best company decision that we have ever made. Sharis was extremely responsive, professional and a pleasure to work with. Her assessment and quote of work that needed to be accomplished was spot on and she completed the work on time. She took the time to learn our company products and services and made recommendations that was easy to understand. Sharis quick response helped us to meet a deadline to apply for a grant and we received it!! We hired Sharis to perform our bookkeeping services permanently and are very happy. I highly recommend her to any company. Thank You Sharis , Selena Dunham, Principal Classique, LLC Teffany verified Bookkeeping Services My bookkeeping for my business was in shambles and I was embarrassed. I explained to Sharis my needs and without hesitation, without judgement she reviewed my documents and help get my financials in order. I will definitely utilize Sharis s services again. Allison verified Bookkeeping Services Sharis is prompt, informative, and reliable. She charges a reasonable rate for the work completed. I respect and recommend her services. Michael verified Bookkeeping Services Sharis really knows her stuff! Very competent, a QuickBooks Pro expert, and uber efficient. Highly recommend. Helen Peng verified Bookkeeping Great service! Very patient with my questions and very responsive. Timothy Ryan verified Bookkeeping Services Sharis is terrific! She quickly jumped on a problem I had and took over. She was responsive and kept me informed. Great result. I recommend her for any bookkeeping problem a business has! Christopher Mendes verified Bookkeeping Services Great rates and extremely friendly! Carlton Boddie Positive: Professionalism, Quality, Responsiveness, Value Since Sharis has been working with us our bookkeeping has been headache free! Joone Nijjar Sharagon Bookkeeping has been keeping my books in order for little over a year and I have to say, Sharis is AMAZING! She completely cleaned up my books and tracked all of my expenses, transactions, and kept my business in order. I recommend her to anyone that wants to focus on building and growing their business, instead of trying to learn bookkeeping. Fabrice Sapolsky Positive: Professionalism, Quality, Responsiveness, Value Sharis really helped me with my business. 5-star bookkeeper! Highly recommended. Get In Touch Sharagon Bookkeeping Services (Virtual Bookkeeper) We have over a decade of experience working for Bookkeeping firms and independently with companies in every major industry assisting business owners with all Bookkeeping aspects of their business. Book Free Consultation (737) 232-6858 info@sharagon.com 1401 Lavaca St. Austin, TX 78701 Mon to Fri - 09:00 AM - 05:00 PM Sun - Closed Quick Links Home About Services Pricing Privacy Policy Blog Contact What We Offer Bookkeeping Services Pay Roll Services Sales Tax Services Other Miscellaneous Services Join Our Mailing List Copyright 2025 Virtual Bookkeeping, Payroll, Sales Tax Services Virtual Bookkeeping, Payroll, Sales Tax Services Skip to content Menu (737) 232-6858 E-mail Now The best move you can make for the future of your Business. Our services Book Free Consultation Now Sharagon Bookkeeping Services Virtual Bookkeeping, Payroll & Sales Tax Services At Sharagon Bookkeeping Services, we simplify your financial operations so you can focus on running and growing your business. From bookkeeping and payroll to sales tax and invoicing, we offer a seamless, all-in-one solution tailored to your needs. Our expert team delivers accurate, deadline-driven service, helping reduce your overall bookkeeping costs while maintaining the highest standards of accuracy and compliance. When you partner with Sharagon, we begin with a thorough review of your current financial position and long-term business goals. From there, we craft a personalized strategy and oversee your day-to-day needs by tracking payables, receivables and ensuring all of your business s financial transactions are recorded. Whether you re a small business or a growing firm, our experienced bookkeepers implement efficient, scalable systems that ensure your financial records are always in order. With real-time access to reports and dashboards, you ll gain clear, actionable insights that empower you to make confident business decisions. Let Sharagon Bookkeeping Services take the weight off your shoulders so you can stay focused on what matters most. Contact Sharagon Bookkeeping Services Virtual bookkeeper Free Consultation Spend Less Time on Bookkeeping, More Time on Growth Schedule Your Free Call. Contact Us Our Services Bookkeeping At Sharagon Bookkeeping Services, we understand that larger firms are equipped with many resources to handle their bookkeeping... Learn More Payroll Payroll is the most daunting task of the Human Resource department, which needs accuracy and must meet deadlines. Employee... Learn More Sales Tax Services Filing a correct Sales tax requires accuracy. It's also vital that you file and pay on time to avoid penalties and interest... Learn More Miscellaneous Services Without proper bookkeeping services, you run the risk of hitting cash flow crunches, spending... Learn More All Services Don't just take our word for it. They made the best move. Jeff Bausch verified Business Bookkeeping Services I signed into Bark looking for a professional bookkeeper and found one. I was called back at my request and advised on the spot as to what to do with my current situation. This is a company that looks out for your best interest. Omatie Gbenebitse verified Business Bookkeeping Services It was a true pleasure working with Sheris. She was honest, hardworking and saved our financial document at the last minute. Excellent and we will be using this service again. Bennett Krishock verified Bookkeeping Sharis was fantastic. I m terrible at bookkeeping and worse at taxes. Not only did Sharis make me feel comfortable that my return would be filed properly and on time, but she also helped me learn how to better prepare and understand future filings. I cannot recommend her enough. Sarah verified Bookkeeping Services I have only had my first meeting with Sharis, but she is very knowledgeable, professional, and approachable. She has calmed my nerves in regards to this very important aspect of my small busin",
      "use cases": "Showing how to set up a small business bookkeeping system | Explaining the benefits of outsourcing payroll processing | Clarifying sales tax filing requirements for e-commerce businesses | Walking through the process of reconciling bank statements | Highlighting the importance of timely financial reporting for business growth",
      "services": "Bookkeeping | Payroll | Sales Tax Services | Miscellaneous Services",
      "email 1": "Hello Sharis,\n\nI just saw Sharagon Bookkeeping Services and thought you might be the right person to speak with.\n\nI'm Trent, I run Toon Theory, an animation studio based in the UK. We focus on helping businesses cut through the noise using clean, hand-drawn storytelling, especially for B2B services, thought leadership, and data-driven education.\n\nVisual storytelling could be a strong lever for Sharagon Bookkeeping Services, especially when clarity and connection are vital.\n\nWe take care of the entire process; from script to storyboard to final voiceover; and they’re typically applied in:\n\n• Showing how to set up a small business bookkeeping system\n• Explaining the benefits of outsourcing payroll processing\n• Clarifying sales tax filing requirements for e-commerce businesses\n• Walking through the process of reconciling bank statements\n• Highlighting the importance of timely financial reporting for business growth\n\nThese videos often help businesses increase engagement by up to 60%, double conversion rates, and boost message retention by up to 80%.\n\nIf you'd be open to it, I’d love to share a brief demo tailored to one of your core offerings. This could be a sample script or a ten second sketch. No strings attached; just curious to explore how it might sound with Sharagon Bookkeeping Services's voice.\n\nFeel free to reply if you’d like to explore what this could look like. There’s also a link to our site in my signature if you’d like to take a peek at some of our previous work.\n\nThanks for leading with both heart and strategy.\n\nAll the best,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
      "email 2": "",
      "email 3": "",
      "message id": "",
      "message id 2": "",
      "message id 3": "",
      "initial date": "",
      "follow-up 1 date": "",
      "follow-up 2 date": "",
      "reply": ""
    }
  ]
}