{
  "business name": "On The Go HR",
  "website url": "https://www.onthegohr.com/",
  "location": "Brooklyn, NY 11249",
  "industry": "Human Resources, Recruitment Services, Outplacement Consultant",
  "first name": "Vanessa",
  "middle name": "C.",
  "last name": "Portes",
  "title": "Owner",
  "email": "vanessa@onthegohr.com",
  "web copy": "On The go HR, INC. Recruitment | Onboarding | Human Resources | Job Seeker Support On the Go HR, where talent meets opportunity. Recruitment | Onboarding | Human Resources | Job Seeker Support For businesses We work to ensure you have a successful recruitment process and amazing candidate experiences. For job seekers We help you navigate your doubt and uncertainty in the job search, rediscover who you are, and build your confidence for success. OUR MISSION Bringing back human to human interaction in recruiting Discover our services Let s work together services for businesses Small teams, big dreams We work with small businesses in their recruiting needs, particularly those facing limitations or operating on tight budgets. Explore how our solutions can meet your business needs in finding and connecting with the ideal candidate for your team. services for job seekers Find where you belong As a job seeker, your judgment is often clouded, leading to questions like, Why did I choose this job? or How come I keep getting rejected or ghosted? But your job search shouldn t have to be that way. With our personalized guidance, resources, and unwavering support, we ll help you uncover your unique strengths and optimize your job search efforts to find the right job for you. Testimonials You re the one doing all the up front work! We are the thankful ones. ~ Starr G., Fulcrum I haven t seen eye to eye with HR Personnel until I connected with Vanessa. She has that HUMAN TOUCH, that I felt every HR lacked. ~ Lisa T., Desk on the Run Communication with Vanessa was amazing. I didn t have to guess where she was in the process. I trusted her. She kept me informed throughout the entire process and I got exactly what I needed. ~ Sasha F., Business Owner Open Jobs Explore our latest job openings and find the perfect opportunity to elevate your career. Click below to browse available positions now! Some of our Clients On The go HR, INC. Recruitment | Onboarding | Human Resources | Job Seeker Support On the Go HR, where talent meets opportunity. Recruitment | Onboarding | Human Resources | Job Seeker Support For businesses We work to ensure you have a successful recruitment process and amazing candidate experiences. For job seekers We help you navigate your doubt and uncertainty in the job search, rediscover who you are, and build your confidence for success. OUR MISSION Bringing back human to human interaction in recruiting Discover our services Let s work together services for businesses Small teams, big dreams We work with small businesses in their recruiting needs, particularly those facing limitations or operating on tight budgets. Explore how our solutions can meet your business needs in finding and connecting with the ideal candidate for your team. services for job seekers Find where you belong As a job seeker, your judgment is often clouded, leading to questions like, Why did I choose this job? or How come I keep getting rejected or ghosted? But your job search shouldn t have to be that way. With our personalized guidance, resources, and unwavering support, we ll help you uncover your unique strengths and optimize your job search efforts to find the right job for you. Testimonials You re the one doing all the up front work! We are the thankful ones. ~ Starr G., Fulcrum I haven t seen eye to eye with HR Personnel until I connected with Vanessa. She has that HUMAN TOUCH, that I felt every HR lacked. ~ Lisa T., Desk on the Run Communication with Vanessa was amazing. I didn t have to guess where she was in the process. I trusted her. She kept me informed throughout the entire process and I got exactly what I needed. ~ Sasha F., Business Owner Open Jobs Explore our latest job openings and find the perfect opportunity to elevate your career. Click below to browse available positions now! Some of our Clients About On the Go HR, Inc. On The go HR, INC. About Us Discover Our Story We offer a friendly and personal approach to recruitment, prioritizing communication in a challenging job market. Thanks for dropping by to check out my story! Our Values Empathy Communication Personability Organization Dependability about me I m Vanessa, your personal recruiter . As an HR professional of 22 years and a proud mom, I m on a mission to bring back the human touch that s been missing in recruitment for far too long. My approach is simple: I communicate. I chat with clients, provide empathy to candidates, and always follow up to keep the conversation flowing. Similar to many of us, I was a job seeker once. I know what it s like to have limited information given to you, waiting for a response, and the gut-wrenching feeling of not getting the job. And that s where On the Go HR comes in. Great vision without great people is irrelevant. more about On the Go HR, what it means to me. I created this business to redefine the role of recruiters and help businesses level up their hiring game. Beyond my professional endeavors, my priority is being a mom. Creating On the Go HR was about prioritizing flexibility to be present for my family a lesson learned through the loss of my good friend and colleague, as well as my dad. It s a realization that in the workplace, we are replaceable. Over the past 3 years, I ve built meaningful relationships with clients, made dreams come true for candidates, and challenged the stereotypes surrounding recruiters. And you know what, I m just getting started! My ongoing mission focuses on advocating for flexibility, communication, and empathy in every workplace interaction. Ready to explore Our Services? Our Recruiting Process On The go HR, INC. our recruiting process How We Work We understand the hesitation you get about allowing an outsource agency to help with your recruitment needs, especially if you ve had unsuccessful outcomes. But with on the go HR, Inc., we take the lead so that the process is as seamless and stress free as possible. We are not a recruiting agency. We do not have a team. on the go HR, Inc has one Hiring Specialist supporting your business with their hiring needs and adding that personable approach, allowing you to have a personal recruiter to hire quickly and effectively without steps or unnecessary contracts. Discover your hiring needs Kickstart the process with a personalized onboarding call where we dive deep into understanding your unique hiring needs, preferences, and company culture. We ll work closely with you to identify the key requirements for the role(s) you re looking to fill, ensuring a tailored approach that aligns with your business objectives. Stay connected Stay informed every step of the way with our proactive communication and regular updates. Receive weekly reports that include the latest insights and progress updates on your hiring process. We ll keep you in the loop by sending you the best-matched candidates for your role(s), allowing you to make informed decisions efficiently and effectively. Contact us today to discuss your legal needs and learn how we can help. Finding the best fit for your team Our dedicated Hiring Specialist goes the extra mile to ensure that every candidate we present is a perfect fit for your team. From screening and qualifying candidates to conducting in-depth interviews, we meticulously assess each candidate s skills, experience, and cultural fit. Rest assured that we ll only introduce you to candidates who meet your criteria and have the potential to thrive in your organization. Our commitment to excellence, robust network, and innovative digital platform ensures an unparalleled leasing experience. Recruiting Services for Businesses On the Go HR, Inc. On The go HR, INC. Recruiting for companies Empowering Your Hiring Journey: Our Tailored Services for Success From targeted recruitment strategies to comprehensive candidate support, On the Go HR is your trusted partner in navigating the complexities of hiring with confidence and ease. Personal Recruiter Our full-cycle recruitment service is offered to businesses who do not have this process set up. A fully customized recruitment strategy designed to meeting your hiring needs with precision and efficiency. Service Timeline: 6 26 weeks Onboarding call with hiring manager 2 day process to complete job description and posting Ongoing job posting and resume reviews Candidate interviews Hire within 1 to 2 weeks depending on your company s recruitment process Package Inclusions: Job description formation Unlimited online job boards (with paid sponsorship on Indeed and ZipRecruiter) ATS + Candidate Portal Review and short listing of resumes 30-min Get to Know Your Candidate video meeting Ongoing communication with candidates Contingency Recruitment Service We also offer businesses a full-cycle recruitment solution for positions with a salary rate starting at $50,000 and higher. Full recruitment service for 30 days (ideal timeline) Only open for positions with a salary rate starting at $50,000 and higher Fee: 20% of the annualized base salary Guarantee: If the hired employee resigns or is terminated for any reason other than reduction in force (RIF) within 90 calendar days of starting work, we will replace the employee for the same position and credit the fee paid. Rush Service 1 Looking to fill a position quickly and efficiently? Our Rush Service 1 package is designed to get you top-notch candidates in no time. Your job will be posted on our website for 2 weeks, instantly connecting you with potential hires. Package Inclusions: Service timeline: 2 weeks ATS + Pre-screen questions setup Unlimited online job boards (with paid sponsorship on Indeed and ZipRecruiter) Review and short listing of resumes INVESTMENT: $99 usd Rush Service 2 An expedited timeline of 2 weeks to find the right fit for your team. One week for job posting and one week for interviewing with our hiring specialist to identify the perfect candidate. Package Inclusions: Service timeline: 2 weeks ATS + Pre-screen questions setup Unlimited online job",
  "use cases": "Showing how contingency recruitment services work for time-sensitive hiring needs | Explaining the benefits of personalized job seeker support | Walking through the onboarding process for new hires",
  "services": "Recruitment | Onboarding | Human Resources | Job Seeker Support | Personal Recruiter | Contingency Recruitment Service | Rush Service 1 | Rush Service 2",
  "email 1": "Hey Vanessa,\n\nI came across On The Go HR recently and thought I’d drop you a quick note.\n\nI'm Trent, and I run Toon Theory; an animation studio based in the UK. We use hand-drawn animations to help businesses get their message across. It's a simple way to cut through noise, especially in B2B, thought leadership, and data-driven education.\n\nI think On The Go HR could really benefit from using visual storytelling to explain things faster and make them stick. We take care of everything: scripting, illustration, voiceover and storyboarding; so you can use the final video for:\n\n• Showing how contingency recruitment services work for time-sensitive hiring needs\n• Walking through the onboarding process for new hires\n• Explaining the benefits of personalized job seeker support\n\nThese videos often help businesses increase engagement by up to 60%, double conversion rates, and boost message retention by up to 80%.\n\nIf you’re open to it, I’d love to share a quick demo built around something On The Go HR offers. Just a sketch or script; no pressure, no pitch; just curious to see what it might sound like in your voice.\n\nAlways open to a quick chat if this feels worth exploring. In the meantime, you can view a few past projects via the link in my signature.\n\nThanks for putting something refreshing out there.\n\nAll the best,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Good day Vanessa,\n\nI wanted to briefly follow up to see if the idea of a quick, low-lift sketch might interest you.\n\nThese kinds of animations are used to clarify big-picture strategies, improve training content, or explain services in a more human way.\n\nIf On The Go HR has something complex or critical to explain, I’d love to put together a sample to show what it might look like.\n\nReply when ready, and check out some past examples linked below.\n\nRespectfully,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Howdy Vanessa,\n\nJust one last follow-up in case you missed my previous notes. I would still be happy to sketch a teaser for On The Go HR if you are curious to see what whiteboard animation can do.\n\nIt could help simplify one of your key offerings or assist with your latest project launch. If you are a little curious, just hit reply or check out some of our past work, which is already linked in my signature.\n\nWarm regards,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175189616928.2087.15554652621323082132@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "no reply",
  "initial time": "14:46",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
{
  "business name": "Primus Business Management",
  "website url": "https://primusco.com/",
  "location": "Brooklyn, NY 11201",
  "industry": "Accounting, Business Consultants, Administrative Services, Human Resources",
  "first name": "Janneh",
  "middle name": "K.",
  "last name": "Wright",
  "title": "CEO",
  "email": "janneh@primusco.com",
  "web copy": "Business Management Service - PRIMUS Business Management Skip to content Transforming Challenges Into Wins Offering Tailored Financial, HR, and Operational Support to Streamline Your Organization s Growth See What We Offer Empowering Your Business Potential 72% of businesses claim that outsourcing accounting improves their ability to scale HR outsourcing reduces administrative costs by up to 30% 60% of CEOs say outsourcing operational tasks allows them to focus more on strategic goals Businesses outsourcing tasks report a 50% increase in innovation and strategic focus. Trusted Partners for Non-Profits and Small Businesses Maximize Your Impact and Profitability with Resource-Based Capacity Building. For over 20 years, PRIMUS Business Management has empowered organizations to drive growth and achieve their goals. We specialize in providing customized capacity-building solutions to help non-profits and small businesses enhance their efficiency and financial success. Complete Company Overview Our Services Strategic Consulting Strategic consulting helps organizations achieve long-term goals by providing expert insights and tailored solutions to drive growth, efficiency, and competitive advantage. PRIMUS Executive Reporting & Consulting (PERC) Gain insights and stay ahead with PERC a dedicated platform offering online business KPI tracking, high-level analytics, and personalized consulting. With a dedicated business analyst by your side, you ll have the data-driven support needed to boost development and profitability. Comprehensive Operations Support Our operations support service covers all your daily administrative needs, including program management, development, and communication. Let our skilled team streamline your systems so you can concentrate on your core objectives. Full-Service Accounting Our accounting solutions provide robust support for your financial operations, including bookkeeping, accounts payable/receivable, and controller services. From routine tasks to strategic oversight with virtual CFOs, we help optimize your financial health. Human Resources Solutions Empower your team with our HR management services, offering tactical support across recruiting, HR generalist duties, management, and virtual HR director services. We handle your HR needs so you can build and maintain a strong, efficient workforce. Who We Serve For companies aiming to optimize their operations, we help establish efficient systems, ensure compliance, manage risks, and drive sustainable growth. Small Businesses Supporting established businesses by evaluating and enhancing current systems. We provide the external expertise needed to strengthen existing operations and achieve higher efficiency. Medium-Sized Businesses Partnering with 501(c)(3) organizations to maximize their impact. We handle essential business functions, allowing them to focus on their mission while leveraging outsourced expertise to optimize their resources. Nonprofit Organizations What Sets Us Apart Our Services: Comprehensive solutions tailored to fit your unique business needs, from accounting and HR to strategic consulting and operations management. Our People: A team of seasoned professionals with deep industry expertise, committed to delivering exceptional results and personalized support. Our Partners: Strong collaborations with trusted partners, providing access to a vast network of resources and insights to enhance your organization's growth and success. Explore More About Us Stay Updated With Us Follow us on social media to get the latest updates, insights, and tips on optimizing your business operations and maximizing your growth. What Clients Have to Say About Us PRIMUS Business Management has been instrumental in getting my business off the ground and focused on the key contributors to its success. They have let me focus on what I'm good at, and there's nothing more valuable than that. Highly Recommend. - Gregory F | Founder and CEO Expert Support for Operational Excellence Our team is here to streamline your daily operations, improve efficiency, and drive profitability. Reach out today for a complimentary consultation and start the conversation on how we can support your business growth. We re excited to help you achieve your goals. Schedule Your Consultation Scroll To Top Business Management Service - PRIMUS Business Management Skip to content Transforming Challenges Into Wins Offering Tailored Financial, HR, and Operational Support to Streamline Your Organization s Growth See What We Offer Empowering Your Business Potential 72% of businesses claim that outsourcing accounting improves their ability to scale HR outsourcing reduces administrative costs by up to 30% 60% of CEOs say outsourcing operational tasks allows them to focus more on strategic goals Businesses outsourcing tasks report a 50% increase in innovation and strategic focus. Trusted Partners for Non-Profits and Small Businesses Maximize Your Impact and Profitability with Resource-Based Capacity Building. For over 20 years, PRIMUS Business Management has empowered organizations to drive growth and achieve their goals. We specialize in providing customized capacity-building solutions to help non-profits and small businesses enhance their efficiency and financial success. Complete Company Overview Our Services Strategic Consulting Strategic consulting helps organizations achieve long-term goals by providing expert insights and tailored solutions to drive growth, efficiency, and competitive advantage. PRIMUS Executive Reporting & Consulting (PERC) Gain insights and stay ahead with PERC a dedicated platform offering online business KPI tracking, high-level analytics, and personalized consulting. With a dedicated business analyst by your side, you ll have the data-driven support needed to boost development and profitability. Comprehensive Operations Support Our operations support service covers all your daily administrative needs, including program management, development, and communication. Let our skilled team streamline your systems so you can concentrate on your core objectives. Full-Service Accounting Our accounting solutions provide robust support for your financial operations, including bookkeeping, accounts payable/receivable, and controller services. From routine tasks to strategic oversight with virtual CFOs, we help optimize your financial health. Human Resources Solutions Empower your team with our HR management services, offering tactical support across recruiting, HR generalist duties, management, and virtual HR director services. We handle your HR needs so you can build and maintain a strong, efficient workforce. Who We Serve For companies aiming to optimize their operations, we help establish efficient systems, ensure compliance, manage risks, and drive sustainable growth. Small Businesses Supporting established businesses by evaluating and enhancing current systems. We provide the external expertise needed to strengthen existing operations and achieve higher efficiency. Medium-Sized Businesses Partnering with 501(c)(3) organizations to maximize their impact. We handle essential business functions, allowing them to focus on their mission while leveraging outsourced expertise to optimize their resources. Nonprofit Organizations What Sets Us Apart Our Services: Comprehensive solutions tailored to fit your unique business needs, from accounting and HR to strategic consulting and operations management. Our People: A team of seasoned professionals with deep industry expertise, committed to delivering exceptional results and personalized support. Our Partners: Strong collaborations with trusted partners, providing access to a vast network of resources and insights to enhance your organization's growth and success. Explore More About Us Stay Updated With Us Follow us on social media to get the latest updates, insights, and tips on optimizing your business operations and maximizing your growth. What Clients Have to Say About Us PRIMUS Business Management has been instrumental in getting my business off the ground and focused on the key contributors to its success. They have let me focus on what I'm good at, and there's nothing more valuable than that. Highly Recommend. - Gregory F | Founder and CEO Expert Support for Operational Excellence Our team is here to streamline your daily operations, improve efficiency, and drive profitability. Reach out today for a complimentary consultation and start the conversation on how we can support your business growth. We re excited to help you achieve your goals. Schedule Your Consultation Scroll To Top Business Management Service - PRIMUS Business Management Skip to content Transforming Challenges Into Wins Offering Tailored Financial, HR, and Operational Support to Streamline Your Organization s Growth See What We Offer Empowering Your Business Potential 72% of businesses claim that outsourcing accounting improves their ability to scale HR outsourcing reduces administrative costs by up to 30% 60% of CEOs say outsourcing operational tasks allows them to focus more on strategic goals Businesses outsourcing tasks report a 50% increase in innovation and strategic focus. Trusted Partners for Non-Profits and Small Businesses Maximize Your Impact and Profitability with Resource-Based Capacity Building. For over 20 years, PRIMUS Business Management has empowered organizations to drive growth and achieve their goals. We specialize in providing customized capacity-building solutions to help non-profits and small businesses enhance their efficiency and financial success. Complete Company Overview Our Services Strategic Consulting Strategic consulting helps organizations achieve long-term goals by providing expert insights and tailored solutions to drive growth, efficiency, and competitive advantage. PRIMUS Executive Reporting & Consulting (PERC) Gain insights and stay ahead with PERC a dedicated platform offering online business KPI tracking, high-level ",
  "use cases": "Streamlining financial processes | Illustrating the benefits of outsourced accounting | Breaking down complex HR compliance regulations",
  "services": "Strategic Consulting | PRIMUS Executive Reporting & Consulting (PERC) | Comprehensive Operations Support | Full-Service Accounting | Human Resources Solutions",
  "email 1": "Hi Janneh,\n\nI came across Primus Business Management recently and thought there could be an opportunity to collaborate.\n\nI'm Trent, and I run Toon Theory; an animation studio based in the UK. We make whiteboard videos that break down complex ideas with simple, hand-drawn visuals. It’s perfect for B2B, thought leadership, and data-driven education.\n\nPrimus Business Management has a strong foundation, and a short animated video could be a powerful way to bring your message to life. We’ll take care of the full creative lift: script, voice, and illustrations, so you can use it for:\n\n• Illustrating the benefits of outsourced accounting\n• Breaking down complex HR compliance regulations\n• Streamlining financial processes\n\nThese animations don’t just explain, they convert; Many of our past clients see a big lift in engagement, trust, and sales.\n\nCould I sketch something out for you? A short demo or script idea based on what Primus Business Management offers. No pitch; just something for you to react to.\n\nJust reach out if you’d like to continue the conversation. You’ll find a few previous projects linked in the signature below.\n\nKeep doing what you do, it's making an impact.\n\nWith appreciation,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Howdy Janneh,\n\nJust checking in one more time.\n\nI understand if now’s not ideal, but I still think there’s value in exploring how a short whiteboard video could help Primus Business Management communicate more clearly.\n\nIt could be a great fit for onboarding, product overviews, or thought leadership; and I’d be happy to show you a no-cost sample.\n\nYou can reply any time, or check out some of our past work linked in my signature.\n\nSincerely,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Hey Janneh,\n\nA quick follow-up before I close out my list. If now is not the right time, no worries at all.\n\nBut if you are a little curious about how whiteboard animation might help Primus Business Management, I am still open to sharing a quick demo. No pressure. You can reply anytime or skim through some of our previous projects to see what we have done for other businesses. The link is in my signature.\n\nBest wishes,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175189666713.2081.7533378982919901538@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "no reply",
  "initial time": "14:56",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
{
  "business name": "Radancy",
  "website url": "https://www.radancy.com/",
  "location": "York, NY 10004",
  "industry": "Human Resources",
  "first name": "Michelle",
  "middle name": "",
  "last name": "Abbey",
  "title": "President & CEO",
  "email": "michelle.abbey@radancy.com",
  "web copy": "Global Digital Talent Acquisition Cloud SaaS Technology | Radancy Global Digital Talent Acquisition Cloud SaaS Technology | Radancy Announcing the next evolution of the Radancy Talent Acquisition Cloud. Radancy sets a new standard in intelligent hiring, fueled by Agentic AI and the world s largest dataset. Find out what s new From hi to apply and everything in between. Optimize your talent acquisition outcomes and improve your ROI with our leading global SaaS platform, data and expertise. Request a demo End-to-End Engagement Make every connection count with one platform. The Radancy Talent Acquisition Cloud helps you hire the right candidates and simplify talent acquisition with a single, AI-powered platform designed to maximize your ROI. Attract & Source Drive job visibility to qualified talent through a multi-faceted, automation-driven approach. Engage & Inform Educate candidates on open roles and fit with data-driven personalized experiences. Capture & Convert Build a qualified talent pipeline with data collection across the entire candidate journey. Evaluate & Advance Elevate the best candidates by streamlining and automating your processes. View platform Overview Data-Driven Intelligence Go from data to decision with the connected intelligence of our platform. Discover the power of our enriched data and gain insights into your talent like no other. Engagement Insights Inform actionable strategies, supported by data and automation. Network Benchmarks Leverage extensive data from the largest global talent acquisition platform. Performance Data Harness the strength of data enriched with employer reputation, firm size and more. Quantifiable Metrics Support decision-making by measuring ROI, cost per apply and cost per hire. Learn MorE Expertise and Innovation Delivering results by understanding your business, brand and goals. Get innovative tools, solutions and perspective every step of the way. Global Leadership Gain insights and best practices through our data analysis, case studies and events. Radancy Labs Access next-gen solutions to stay on the pulse of what s new and ahead of what s next. Brand Experience Experts Tap into innovative thought, design and messaging to define and differentiate your candidate journey. Strategic Planning Unlock industry insight and talent-building expertise from customer success teams and SMEs. Learn More Bringing our technology to life through dynamic branded candidate experiences. Learn More 675+ PLATFORM CUSTOMERS Global Impact Leadership Blog Connect with us to accelerate hiring results and maximize ROI with one AI platform. Book A Demo Global Digital Talent Acquisition Cloud SaaS Technology | Radancy Global Digital Talent Acquisition Cloud SaaS Technology | Radancy Announcing the next evolution of the Radancy Talent Acquisition Cloud. Radancy sets a new standard in intelligent hiring, fueled by Agentic AI and the world s largest dataset. Find out what s new From hi to apply and everything in between. Optimize your talent acquisition outcomes and improve your ROI with our leading global SaaS platform, data and expertise. Request a demo End-to-End Engagement Make every connection count with one platform. The Radancy Talent Acquisition Cloud helps you hire the right candidates and simplify talent acquisition with a single, AI-powered platform designed to maximize your ROI. Attract & Source Drive job visibility to qualified talent through a multi-faceted, automation-driven approach. Engage & Inform Educate candidates on open roles and fit with data-driven personalized experiences. Capture & Convert Build a qualified talent pipeline with data collection across the entire candidate journey. Evaluate & Advance Elevate the best candidates by streamlining and automating your processes. View platform Overview Data-Driven Intelligence Go from data to decision with the connected intelligence of our platform. Discover the power of our enriched data and gain insights into your talent like no other. Engagement Insights Inform actionable strategies, supported by data and automation. Network Benchmarks Leverage extensive data from the largest global talent acquisition platform. Performance Data Harness the strength of data enriched with employer reputation, firm size and more. Quantifiable Metrics Support decision-making by measuring ROI, cost per apply and cost per hire. Learn MorE Expertise and Innovation Delivering results by understanding your business, brand and goals. Get innovative tools, solutions and perspective every step of the way. Global Leadership Gain insights and best practices through our data analysis, case studies and events. Radancy Labs Access next-gen solutions to stay on the pulse of what s new and ahead of what s next. Brand Experience Experts Tap into innovative thought, design and messaging to define and differentiate your candidate journey. Strategic Planning Unlock industry insight and talent-building expertise from customer success teams and SMEs. Learn More Bringing our technology to life through dynamic branded candidate experiences. Learn More 675+ PLATFORM CUSTOMERS Global Impact Leadership Blog Connect with us to accelerate hiring results and maximize ROI with one AI platform. Book A Demo Global Digital Talent Acquisition Cloud SaaS Technology | Radancy Global Digital Talent Acquisition Cloud SaaS Technology | Radancy Announcing the next evolution of the Radancy Talent Acquisition Cloud. Radancy sets a new standard in intelligent hiring, fueled by Agentic AI and the world s largest dataset. Find out what s new From hi to apply and everything in between. Optimize your talent acquisition outcomes and improve your ROI with our leading global SaaS platform, data and expertise. Request a demo End-to-End Engagement Make every connection count with one platform. The Radancy Talent Acquisition Cloud helps you hire the right candidates and simplify talent acquisition with a single, AI-powered platform designed to maximize your ROI. Attract & Source Drive job visibility to qualified talent through a multi-faceted, automation-driven approach. Engage & Inform Educate candidates on open roles and fit with data-driven personalized experiences. Capture & Convert Build a qualified talent pipeline with data collection across the entire candidate journey. Evaluate & Advance Elevate the best candidates by streamlining and automating your processes. View platform Overview Data-Driven Intelligence Go from data to decision with the connected intelligence of our platform. Discover the power of our enriched data and gain insights into your talent like no other. Engagement Insights Inform actionable strategies, supported by data and automation. Network Benchmarks Leverage extensive data from the largest global talent acquisition platform. Performance Data Harness the strength of data enriched with employer reputation, firm size and more. Quantifiable Metrics Support decision-making by measuring ROI, cost per apply and cost per hire. Learn MorE Expertise and Innovation Delivering results by understanding your business, brand and goals. Get innovative tools, solutions and perspective every step of the way. Global Leadership Gain insights and best practices through our data analysis, case studies and events. Radancy Labs Access next-gen solutions to stay on the pulse of what s new and ahead of what s next. Brand Experience Experts Tap into innovative thought, design and messaging to define and differentiate your candidate journey. Strategic Planning Unlock industry insight and talent-building expertise from customer success teams and SMEs. Learn More Bringing our technology to life through dynamic branded candidate experiences. Learn More 675+ PLATFORM CUSTOMERS Global Impact Leadership Blog Connect with us to accelerate hiring results and maximize ROI with one AI platform. Book A Demo Global Digital Talent Acquisition Cloud SaaS Technology | Radancy Global Digital Talent Acquisition Cloud SaaS Technology | Radancy Announcing the next evolution of the Radancy Talent Acquisition Cloud. Radancy sets a new standard in intelligent hiring, fueled by Agentic AI and the world s largest dataset. Find out what s new From hi to apply and everything in between. Optimize your talent acquisition outcomes and improve your ROI with our leading global SaaS platform, data and expertise. Request a demo End-to-End Engagement Make every connection count with one platform. The Radancy Talent Acquisition Cloud helps you hire the right candidates and simplify talent acquisition with a single, AI-powered platform designed to maximize your ROI. Attract & Source Drive job visibility to qualified talent through a multi-faceted, automation-driven approach. Engage & Inform Educate candidates on open roles and fit with data-driven personalized experiences. Capture & Convert Build a qualified talent pipeline with data collection across the entire candidate journey. Evaluate & Advance Elevate the best candidates by streamlining and automating your processes. View platform Overview Data-Driven Intelligence Go from data to decision with the connected intelligence of our platform. Discover the power of our enriched data and gain insights into your talent like no other. Engagement Insights Inform actionable strategies, supported by data and automation. Network Benchmarks Leverage extensive data from the largest global talent acquisition platform. Performance Data Harness the strength of data enriched with employer reputation, firm size and more. Quantifiable Metrics Support decision-making by measuring ROI, cost per apply and cost per hire. Learn MorE Expertise and Innovation Delivering results by understanding your business, brand and goals. Get innovative tools, solutions and perspective every step of the way. Global Leadership Gain insights and best practices through our data analysis, case studies and events. Radancy Labs Access next-gen solutions to stay on the pulse of what s new and ahead of what s next. Brand",
  "use cases": "Showing how to optimize job postings for better candidate attraction | Explaining the importance of employer branding in talent acquisition | Demonstrating how to use data-driven insights to improve hiring decisions",
  "services": "Attract & Source | Engage & Inform | Capture & Convert | Evaluate & Advance | Data-Driven Intelligence | Engagement Insights | Network Benchmarks | Performance Data | Quantifiable Metrics | Global Leadership | Radancy Labs | Brand Experience Experts | Strategic Planning",
  "email 1": "Hi Michelle,\n\nI stumbled across Radancy and thought I’d reach out.\n\nI'm Trent. I run Toon Theory, a whiteboard animation studio in the UK. We make simple, animated explainer videos that help people understand dense ideas. They're great for B2B services, thought leadership, and data-driven education.\n\nFor Radancy, I think there could be a great opportunity to use visual storytelling to help more people “get it” faster. Our animations are fully done-for-you: script, illustrations, voice, and storyboard; so you can use them for:\n\n• Showing how to optimize job postings for better candidate attraction\n• Explaining the importance of employer branding in talent acquisition\n• Demonstrating how to use data-driven insights to improve hiring decisions\n\nWhether it’s more signups, better retention, or faster understanding, these animations know how to hit hard. And they move the needle where it counts.\n\nHow about a quick sample built around Radancy's strengths? Ten seconds or so, no strings, no commitments. Just a feeler to see what resonates.\n\nYou’ll find a link to our site in my signature if you’d like to see a few examples. And if anything clicks, I’d love to hear your thoughts.\n\nThanks for leading with both heart and strategy.\n\nCheers,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Hello there Michelle,\n\nJust looping back in case this got lost in your inbox. I mentioned how whiteboard animation could support Radancy’s messaging ; and I still believe there’s a great fit here.\n\nThese videos are especially helpful when you’re trying to explain something technical, strategic, or new in a way that sticks.\n\nIf it helps, I’d be happy to put together a short script or quick teaser to show what this could look like.\n\nFeel free to reply if you’d like to explore it. You’ll find examples of our work in my signature.\n\nTake care,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Hello there Michelle,\n\nJust reaching out again before I close this thread. If you think animated storytelling could be of value to Radancy, I would love to put something together.\n\nEven a 10-second sketch can be a useful way to explore what is possible.\n\nFeel free to reply at your convenience.\n\nKind regards,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175189775007.2150.4497427065473118180@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "no reply",
  "initial time": "15:14",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
{
  "business name": "Donia",
  "website url": "https://doniaa.com/",
  "location": "Brooklyn, NY 11222",
  "industry": "Business Consultants, Information Technology Services, Training Programs, Management Consultant, Human Resources, Strategic Planning Consultants, Healthcare Staffing, Employment Contractors, Project Management, Technical Staffing",
  "first name": "Donia",
  "middle name": "",
  "last name": "Piersaint",
  "title": "President",
  "email": "donia@doniaa.com",
  "web copy": "Home | Donia Our Mission Our mission is to deliver quality solutions to our clients. We assemble specialized project teams and plans to provide competitive solutions for clients specific needs on time and within budget. Our diverse, expertly trained team is dedicated to making your success our business. Learn More Get Started Welcome! Welcome to Donia LLC, where you will find expert-level consulting and workforce solutions for a broad range of needs across varied industries. Our record of meeting and exceeding customer requirements is anchored in our ability to understand our clients specific needs and our steadfast commitment to delivering quality solutions on time and within budget. Our ability to provide individualized solutions for our clients ensures that critical objectives are addressed, and our clients receive the most effective results. We measure the success of those solutions in our clients and their customers overall satisfaction. At Donia LLC, we believe that there is always room to grow, and we offer the solutions to help you and your organization thrive. We welcome the opportunity to work with new and returning partners and challenges. Help Us Help You Grow! SUBMIT A REQUEST FOR PROPOSAL TODAY! GET STARTED Click Here to Contact Us! How We Work Our People: We hire and retain the best employees. Experience: We have worked with clients all over the country as both a prime and sub-contractor. Leadership: Our team leaders have an excellent combination of analytical, planning, facilitation, and management skills. We find creative solutions to even the most challenging of issues. Eagerness: We approach each opportunity with enthusiasm and the knowledge that we deliver exceptional services and solutions. Solution-Oriented: Our clients bring their needs and questions, we bring the solutions and answers. Flexibility: We implement flexible plans to adhere to your company s specific needs and requirements, even as they change. Quality Assurance: We integrate the best possible practices in quality assurance into everything we do. Returning Clientele: Some of our clients have been with us for years, coming back time and again to utilize our skills and services. Satisfaction-Focused: Our practices are geared toward your overall satisfaction. Our Specialties We Can Do It! Get In Touch or submit a request today Business Consulting IT Support Technical Assistance back office support Projects Delivery training services workforce solutions about us terms/policies our clients careers contact us Home | Donia Our Mission Our mission is to deliver quality solutions to our clients. We assemble specialized project teams and plans to provide competitive solutions for clients specific needs on time and within budget. Our diverse, expertly trained team is dedicated to making your success our business. Learn More Get Started Welcome! Welcome to Donia LLC, where you will find expert-level consulting and workforce solutions for a broad range of needs across varied industries. Our record of meeting and exceeding customer requirements is anchored in our ability to understand our clients specific needs and our steadfast commitment to delivering quality solutions on time and within budget. Our ability to provide individualized solutions for our clients ensures that critical objectives are addressed, and our clients receive the most effective results. We measure the success of those solutions in our clients and their customers overall satisfaction. At Donia LLC, we believe that there is always room to grow, and we offer the solutions to help you and your organization thrive. We welcome the opportunity to work with new and returning partners and challenges. Help Us Help You Grow! SUBMIT A REQUEST FOR PROPOSAL TODAY! GET STARTED Click Here to Contact Us! How We Work Our People: We hire and retain the best employees. Experience: We have worked with clients all over the country as both a prime and sub-contractor. Leadership: Our team leaders have an excellent combination of analytical, planning, facilitation, and management skills. We find creative solutions to even the most challenging of issues. Eagerness: We approach each opportunity with enthusiasm and the knowledge that we deliver exceptional services and solutions. Solution-Oriented: Our clients bring their needs and questions, we bring the solutions and answers. Flexibility: We implement flexible plans to adhere to your company s specific needs and requirements, even as they change. Quality Assurance: We integrate the best possible practices in quality assurance into everything we do. Returning Clientele: Some of our clients have been with us for years, coming back time and again to utilize our skills and services. Satisfaction-Focused: Our practices are geared toward your overall satisfaction. Our Specialties We Can Do It! Get In Touch or submit a request today Business Consulting IT Support Technical Assistance back office support Projects Delivery training services workforce solutions about us terms/policies our clients careers contact us Services | Donia Our Services Let's Grow Together At Donia, we strive to meet all your business management needs, aiming to exceed your growth expectations and expand as we go! Expert Services and Solutions We have a proven record of accomplishments and success in providing expert advisory services, technical assistance, back-office support, training services, and workforce solutions to government agencies, businesses, and non-profit organizations nationwide. Our committed team of experts works together to deliver customized solutions to meet our clients unique needs that improve outcomes, performance, quality, flow, and overcome challenges to achieve their objectives. We operate at the highest level of service and support to ensure success. Get Started Consulting Services We provide consulting services to help document, assess, improve, manage, and design processes, programs, tools, and systems. We use a multi-disciplinary approach and expert-level skills to help our clients improve and grow. Click Here Back Office Support We provide administrative and clerical services, human resource services, program administration, project coordination and documentation, and staff augmentation services to support your operations. Click Here Projects Delivery Our flexible projects delivery services offer to drive transformation and growth. Use us as your fully managed services provider, an extension of your team, or your expert to implement transormational changes. Click Here IT Services We develop, implement, and manage programs aimed at improving your businesses operations and processes, providing technical support within a multitude of areas. Click Here Technical Assistance We provide technical assistance and capacity-building services to help communities and organizations address various needs, access tools, methodologies, coaching, subject matter experts, etc., and administer, manage, and maintain operations, programs, and systems. Click Here Training Services We provide a range of quality training programs and services. We work closely with clients to develop customized, high-quality training programs and services to meet their needs and provide a positive learning experience. Click Here Workforce Solutions Our workforce solutions include organizational assessment, organizational design, change management, strategic planning, retention studies, compensation studies, employee satisfaction surveys, staffing models, and staff augmentation. Click Here General Services Capabilities Statement Capabilities Statement Donia LLC General Services Consulting Capabilities Statement Capabilities Statement Donia LLC Consulting and Support Services IT Services Capabilities Statement Capabilities Statement Donia LLC- IT Services Training Services Capabilities Statement Capabilities Statement Donia LLC- Training Services Workforce Solutions Capabilities Statement Capabilities Statement Donia LLC Workforce Solutions Our Proven Project Approach Research & Analysis We equip a team of highly experienced specialists to research and analyze each of the projects we take on, forming a comprehensive Workplan that coincides with the scope of requirements provided. Flexible project plans We create flexible project plans that are able to be molded based on each individual project, to ensure that we are always meeting and exceeding your project needs! Quality Assurance We input industry-leading quality assurance plans to monitor performance throughout the project s lifespan, assuring your satisfaction not just now but in the future! Consulting Services | Donia Services Consulting Services Take your operation to new heights! We can help your organization develop and implement effective strategies and sound practices to achieve long-term success in a highly competitive and dynamic space. What We Offer Strategy, planning, management, quality assurance, and support services for successful outcomes. Business process analysis and reengineering for transformational improvements. Process documentation and training for compliance, consistency, and quality control. Functional analysis, workflow analysis, organizational assessment, and staffing models for effective operations. Training and coaching services for skills improvement. Our Capabilities Economic development strategy design, implementation, and evaluation Economic research and analysis Focus group facilitation Market research Operations improvement Organizational design and change management Policy development, implementation, and evaluation Process documentation, analysis, and improvement Process improvements Program management Program evaluation, development, and implementation Project management Quality improvement Quality management Stakeholder engagement services Strategic planning Workforce analyses Workgroup facilitation Capabilities Statement Capabilities Statement Donia LLC Construction and Support Services Our Results ",
  "use cases": "| Walking through project delivery timelines to set client expectations | | | Demonstrating technical solutions to common IT issues | | | Explaining back office support services to new clients |",
  "services": "Business Consulting | IT Support | Technical Assistance | back office support | Projects Delivery | training services | workforce solutions",
  "email 1": "Hello Donia,\n\nI just saw Donia and thought you might be the right person to speak with.\n\nI'm Trent, and I run Toon Theory; an animation studio based in the UK. We use hand-drawn animations to help businesses get their message across. It's a simple way to cut through noise, especially in B2B, thought leadership, and data-driven education.\n\nI think Donia could really benefit from using visual storytelling to explain things faster and make them stick. We take care of everything: scripting, illustration, voiceover and storyboarding; so you can use the final video for:\n\n• Explaining back office support services to new clients\n• Demonstrating technical solutions to common IT issues\n• Walking through project delivery timelines to set client expectations\n\nClients often tell us these pieces help reduce bloat, increase clarity, and lead to more meaningful conversions.\n\nIf you're open to a quick preview, I could whip up a ten-second mock or short script tailored to something core at Donia; No pressure, no cost, purely exploratory.\n\nIf you’re curious about what this might look like, just reach out. There’s a link in my signature with a few examples you can check out, too.\n\nThanks for putting something refreshing out there.\n\nTake care,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Hey there Donia,\n\nWanted to follow up in case this timing works better for you. Whiteboard animation can be a surprisingly simple way to make your message clearer and more memorable; especially in B2B settings.\n\nFor Donia, this could mean increased understanding and stronger engagement, both internally and externally.\n\nIf you're still open to that quick sketch or demo, I’d be happy to create one based on something you’re working on.\n\nThere’s a link to our past projects in my signature if you’d like to browse.\n\nKind regards,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Greetings Donia,\n\nJust following up again because I think animation could add real value to Donia’s messaging.\n\nIt’s an engaging way to capture attention and explain what makes your business stand out.\n\nIf it sounds useful, I’d be glad to prepare a quick teaser or script to show you what’s possible.\n\nYou can reply anytime, and a link to our portfolio is in my signature.\n\nBest wishes,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175189907377.2119.17635036150444641910@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "no reply",
  "initial time": "15:36",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
{
  "business name": "Bravely",
  "website url": "https://workbravely.com/",
  "location": "York, NY 10003",
  "industry": "Human Resources, Business Coach",
  "first name": "Toby",
  "middle name": "",
  "last name": "Hervey",
  "title": "CEO/Co-Founder",
  "email": "toby@workbravely.com",
  "web copy": "Coaching and Training Platform for All Employees | Bravely Grow your people , supercharge your company Bravely is a coaching and training platform that provides employees with personalized, professional development fueling higher levels of engagement and performance. Book a Demo Learn More Our platform is trusted by leading organizations Solutions A custom development plan for each employee Bravely's platform provides personalized development to meet the unique needs of each employee from the skills they need to develop to the frequency of their coaching sessions. Growth & Development Empower your people to grow Create a path for employees to identify growth opportunities and provide the coaching and training necessary to develop and retain new skills and boost performance. Learn More Engagement & Retention Support employees, improve retention Bravely encourages individuals to take ownership of their development and provides the ongoing tools and frameworks to keep them engaged and confident about their future. Learn More Organizational Insights Discover critical employee needs Our reports provide a window into employees current needs and engagement levels providing you with actionable data to impact your go-forward people strategy. Learn More What We Offer For top leaders and managers Bravely Advance Fully Personalized Leadership Coaching Provide high-frequency 1:1 coaching to your top leaders for maximum impact on your organization. Unlimited coaching sessions Long-term partnership with expert leadership coaches Skill assessments and a personalized development plan Availability during work days, nights, and weekends Exclusive monthly webinars Content library Dedicated CSM and monthly reporting Learn More For executives Bravely Exec White-glove executive coaching Develop your leaders ability to inspire, communicate, and innovate through collaboration with seasoned coaches. Scalable offering with individualized matching Unlimited 1:1 coaching 12 month engagement Flexible cadence and session length to meet executive s needs Monthly usage and satisfaction reports Designated coaching relationship manager Learn More For a large cohort of ICs and managers Bravely Boost On-Demand Coaching Give employees at all levels access to on-demand, 1:1 coaching sessions for development and support in the flow of work. On-demand 1:1 coaching sessions Availability during work days, nights, and weekends Exclusive monthly webinars Content library Dedicated CSM and monthly reporting Learn More How our coaching approach is different On-demand Employees can schedule a coaching session or access learning resources for just-in-time learning in their flow of work. Confidential Our coaches provide a confidential, third-party perspective outside of work to ensure that employees have a neutral sounding board to chart a path forward. Equitable Bravely provides every employee at all levels with 1:1 support based on their unique needs to accelerate their individual potential. Real companies, real results A culture transformation at Autodesk brought them to Bravely seeking more individualized support. Learn More How Bravely helped BrainPOP extend HR capacity and support employee wellbeing. Learn More How PTC used coaching to empower their organization to navigate change. Watch Video With our customers, we're shaping the future of work We're proud to work with people leaders who are building workplaces that work for everyone. Giving our employees access to professional coaches that can hear and help them from a neutral place is an empowering way to move their careers forward. Bravely is a personal extension to the best of People teams for employees. Michelle Wagner CEO | Mindstrong As Pinterest grows and adapts to new challenges, our team s appetite for individualized support and development has never been stronger. Bravely has helped scale the support provided by our People team, and our colleagues are already telling us that access to their own coach when they need it most is unleashing new skills, confidence, and drive. Jo Dennis Former CHRO | Pinterest Peak performance starts with Bravely Bravely s learning and development platform has been integral to the growth of our clients employees 92% of employees learn a new skill after just one coaching session. Schedule a demo to learn how Bravely can impact your organization. Book a Demo Coaching and Training Platform for All Employees | Bravely Grow your people , supercharge your company Bravely is a coaching and training platform that provides employees with personalized, professional development fueling higher levels of engagement and performance. Book a Demo Learn More Our platform is trusted by leading organizations Solutions A custom development plan for each employee Bravely's platform provides personalized development to meet the unique needs of each employee from the skills they need to develop to the frequency of their coaching sessions. Growth & Development Empower your people to grow Create a path for employees to identify growth opportunities and provide the coaching and training necessary to develop and retain new skills and boost performance. Learn More Engagement & Retention Support employees, improve retention Bravely encourages individuals to take ownership of their development and provides the ongoing tools and frameworks to keep them engaged and confident about their future. Learn More Organizational Insights Discover critical employee needs Our reports provide a window into employees current needs and engagement levels providing you with actionable data to impact your go-forward people strategy. Learn More What We Offer For top leaders and managers Bravely Advance Fully Personalized Leadership Coaching Provide high-frequency 1:1 coaching to your top leaders for maximum impact on your organization. Unlimited coaching sessions Long-term partnership with expert leadership coaches Skill assessments and a personalized development plan Availability during work days, nights, and weekends Exclusive monthly webinars Content library Dedicated CSM and monthly reporting Learn More For executives Bravely Exec White-glove executive coaching Develop your leaders ability to inspire, communicate, and innovate through collaboration with seasoned coaches. Scalable offering with individualized matching Unlimited 1:1 coaching 12 month engagement Flexible cadence and session length to meet executive s needs Monthly usage and satisfaction reports Designated coaching relationship manager Learn More For a large cohort of ICs and managers Bravely Boost On-Demand Coaching Give employees at all levels access to on-demand, 1:1 coaching sessions for development and support in the flow of work. On-demand 1:1 coaching sessions Availability during work days, nights, and weekends Exclusive monthly webinars Content library Dedicated CSM and monthly reporting Learn More How our coaching approach is different On-demand Employees can schedule a coaching session or access learning resources for just-in-time learning in their flow of work. Confidential Our coaches provide a confidential, third-party perspective outside of work to ensure that employees have a neutral sounding board to chart a path forward. Equitable Bravely provides every employee at all levels with 1:1 support based on their unique needs to accelerate their individual potential. Real companies, real results A culture transformation at Autodesk brought them to Bravely seeking more individualized support. Learn More How Bravely helped BrainPOP extend HR capacity and support employee wellbeing. Learn More How PTC used coaching to empower their organization to navigate change. Watch Video With our customers, we're shaping the future of work We're proud to work with people leaders who are building workplaces that work for everyone. Giving our employees access to professional coaches that can hear and help them from a neutral place is an empowering way to move their careers forward. Bravely is a personal extension to the best of People teams for employees. Michelle Wagner CEO | Mindstrong As Pinterest grows and adapts to new challenges, our team s appetite for individualized support and development has never been stronger. Bravely has helped scale the support provided by our People team, and our colleagues are already telling us that access to their own coach when they need it most is unleashing new skills, confidence, and drive. Jo Dennis Former CHRO | Pinterest Peak performance starts with Bravely Bravely s learning and development platform has been integral to the growth of our clients employees 92% of employees learn a new skill after just one coaching session. Schedule a demo to learn how Bravely can impact your organization. Book a Demo Bravely Customer Success: Employee Coaching & Training Bravely customers: real results from our clients Bravely s coaching solutions have helped organizations in a variety of industries achieve measurable improvements in employee performance, engagement, and retention. Our clients in healthcare, technology, and consulting consistently report success in leadership development, team collaboration, and employee satisfaction. Below are just a few examples of how Bravely has partnered with businesses to drive growth and success. Giving our employees access to professional coaches that can hear and help them from a neutral place is an empowering way to move their careers forward. Bravely is a personal extension to the best of People teams for employees. Michelle Wagner Chief People Officer | Mindstrong We wanted to provide a tool that could actually help employees learn how to adapt to change and see it as an opportunity. Bravely does exactly that. Sam Tyers HR Director | Autodesk Bravely coaches have given my employees the professional development they need to unlock their hidden potential Kristin Langdon SVP of People and Culture | Botify Bravely delivers positive outcomes throughout our clients' organizations. 93% of ",
  "use cases": "| Demonstrating how personalized development plans drive employee growth | Explaining the benefits of ongoing tools for employee engagement | Walking through the process of creating actionable organizational insights reports",
  "services": "Custom development plan for each employee | Personalized development to meet unique employee needs | Growth & Development | Coaching and training necessary to develop and retain new skills | Engagement & Retention | Ongoing tools and frameworks to keep employees engaged | Organizational Insights | Reports providing actionable data to impact people strategy | Fully Personalized Leadership Coaching | Unlimited coaching sessions | Long-term partnership with expert leadership coaches | Skill assessments and a personalized development plan | On-Demand Coaching | On-demand 1:1 coaching sessions | Exclusive monthly webinars | Content library | Dedicated CSM and monthly reporting | White-glove executive coaching | Unlimited 1:1 coaching | 12 month engagement | Flexible cadence and session length | Monthly usage and satisfaction reports | Designated coaching relationship manager",
  "email 1": "Hi Toby,\n\nI stumbled on Bravely the other day and wanted to get in touch.\n\nI'm Trent. I run Toon Theory, a whiteboard animation studio in the UK. We make simple, animated explainer videos that help people understand dense ideas. They're great for B2B services, thought leadership, and data-driven education.\n\nBravely has a strong foundation, and a short animated video could be a powerful way to bring your message to life. We’ll take care of the full creative lift: script, voice, and illustrations, so you can use it for:\n\n• Explaining the benefits of ongoing tools for employee engagement\n• Demonstrating how personalized development plans drive employee growth\n• Walking through the process of creating actionable organizational insights reports\n\nClients often tell us these pieces help reduce bloat, increase clarity, and lead to more meaningful conversions.\n\nI'd be more than happy to whip up a quick snippet; a short script or sketch; that speaks to what Bravely does best. No commitments at all, just a chance to show you what's possible.\n\nIf you're open to chatting more, just hit reply. And if you're curious, there’s a site link in my signature with a few past examples.\n\nThanks for leading with both heart and strategy.\n\nCheers,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Howdy Toby,\n\nJust wanted to touch base after my last email about how Bravely could benefit from whiteboard animation.\n\nThis type of video storytelling often boosts engagement and helps simplify complicated topics; making your message more human and easier to remember.\n\nIf you’re curious, I’d be glad to draft a short teaser or script for you to review.\n\nPlease reply anytime, and there’s a link to our work in my signature if you want to take a look.\n\nWith appreciation,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Hey Toby,\n\nI hope this note finds you well. I’m reaching out again to offer a creative way for Bravely to stand out using animated whiteboard videos.\n\nEven a short, simple animation can make complex ideas easier to understand and more engaging for your audience.\n\nIf that sounds interesting, I’d be glad to prepare a brief sketch or a script to share with you.\n\nPlease reply anytime. Past examples are linked in my signature.\n\nSincerely,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175190020877.2117.11181011156607315363@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "no reply",
  "initial time": "15:55",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
{
  "business name": "DESIRE & COMPANY CPAs",
  "website url": "https://www.desireandcompanycpas.com/",
  "location": "York, NY 10017",
  "industry": "Accounting, Financial Services, Human Resources",
  "first name": "Zache",
  "middle name": "",
  "last name": "Desire",
  "title": "Managing Partner",
  "email": "zache@desireandcompanycpas.com",
  "web copy": "Home top of page WE ARE YOUR MOST TRUSTED BUSINESS ADVISERS 1/6 Desire & Company CPAs is a full service CPA firm that provides consulting, auditing, and tax services to nonprofit organizations and other corporate clients. Our firm can work with many different industries; however, we are especially knowledgeable in the following industries: Nonprofit, Governmental Entities, Financial Service, and Health Care. We would welcome the opportunity to earn your trust and offer you the best service in the industry. bottom of page ABOUT US top of page ABOUT US Desire & Company CPAs provides personalized services that can be tailored to fit your particular situation. We believe in helping you, reach your goals by providing the timely services that you need to seize the opportunities and conquer your challenges. As your professional service provider, we will help you translate complex information into knowledge, and knowledge into decision. As a firm, we place great value on building long-term relationships, and providing outstanding service is one way we can accomplish this goal. We provide a high level of quality services through the use of innovative approaches to client problems, hands on involvement from our Partners, the outstanding capabilities and background of personnel assigned to each client, and our commitment to identifying a cost effective solution to your issues. Over the past two decades, our Partners have served many prestigious organizations and we will put the benefit of our combined experiences to work for your Organization. Please see our list of services which reflects how we can help. We look forward to partnering with you to help you reach your organizational goals. bottom of page OUR TEAM top of page OUR ENGAGEMENT TEAM We place an extremely heavy emphasis on focused interactions between your management and our engagement team. The individuals assigned to your engagement will be qualified to provide you with an assessment of your overall management needs. In addition, our partners are available to assist you in presenting information to other interested third parties. The client service team will call upon expertise elsewhere, within the firm or its affiliated network of professionals, to meet the various needs of your Organization. PARTNERS BIOS Zache Desire, CPA, SPHR - Managing Partner Zache is a Certified Public Accountant in the State of New York and a Certified Senior Professional in Human Resources. He earned a Bachelor Degree in Accounting from Baruch College and has over twenty-years of experience in the public and private sector. Zache s past experiences include being a Partner in a CPA firm, served as the Chief Financial Officer of several nonprofits, and worked as an auditor for Price Waterhouse Coopers (\"Big Six\"). In addition, Zache: Provided Partner level consulting, audit, and tax services to many prestigious Corporations in the nonprofit, real estate, and financial service industries. Served as the outsourced Chief Financial Officer for several organizations. Co-authored a book called - \"Common Cents\" a model fiscal policies and procedures manual. Served as an instructor at various trainings on Accounting, Human Resources, and organizational related issues. Member of the American Institute of Certified Public Accountants. Member of the Society for Human Resource Management. Member of the New York State Society of Certified Public Accountants elected to serve on the Accounting for Nonprofit Organization Committee. Daniel Desire, CPA - Partner Dan is a Certified Public Accountant in the State of New York with over twenty-five years of experience. Dan earned a Bachelor Degree in Accounting from Baruch College. Over the past twenty-five years, he has serviced the nonprofit sector including State agencies, public authorities, municipal entities, higher education, health care, religious, and other types of organizations. In addition, Dan: Provided Partner level audit, consulting, and tax services to the nonprofit, manufacturing, construction, and other industries. Has extensive experience in limited partnerships relating to nonprofit housing special purpose entities. Well versed in helping clients meet reporting requirements related to Title IV student financial assistance programs for proprietary schools in New York, New Jersey, Ohio, Pennsylvania and Minnesota. Member of the American Institute of Certified Public Accountants Member of the New York State Society of Certified Public Accountants. Other Service Professionals: As a supplement to our workforce, we have affiliations with our network of professionals that we call upon to utilize staffing and other resources to serve our valuable clients. All engagements are staffed with one of our Partners who will be responsible for the overall client service team. bottom of page SERVICES top of page HOW WE CAN HELP As your trusted advisers, we know your business and understand your needs. We will help you reach your goals by providing you with clear and practical guidance. We provide you with timely and accurate financial reporting information needed to make key business decisions and meet today's demanding requirements by regulators and financial institutions. Our small to medium sized business services are focused on helping you grow your company and are designed to help you succeed. We provide comprehensive, flexible strategies that address the issues affecting your business. We provide a full range of hands on support to help you develop strong people, processes, and environments. bottom of page ADVISORY top of page BUSINESS ADVISORY SERVICES As your trusted advisors, we know your business and understand your needs. We will help you reach your goals by providing you with clear and practical guidance through our services listed below. Outsourced Chief Financial Officer Services CFO one-on-one training, coaching, and mentoring Preparation of pre-audit reports Accounting software review, setup, and conversions Internal control review and risk assessments Internal audit services Organization review Budget and cash management Management talent assessment Strategic and tactical planning Standard Operating Procedures Manual Expense reduction services bottom of page AUDIT & TAX top of page AUDIT AND TAX SERVICES Timely and accurate financial reporting provides you with the critical information needed to make key business decisions and meet today's demanding requirements by regulators and financial institutions. To assist you in meeting these requirements, we provide the following services: Financial Statement audits Federal (A-133) audits Employee benefit plan audits 990 and CHAR500 tax returns for Exempt Organization Corporate tax and tax planning Individual tax return and tax planning bottom of page SMALL BUSINESS top of page SMALL TO MEDIUM SIZED BUSINESSES Our small to medium sized business services are focused on helping you grow your company and are designed to help you succeed. We provide comprehensive, flexible strategies that address the issues affecting your business. We can assist you with the following: BOOKKEEPING SERVICES Accounting services scaled to your business needs. Set up computerized accounting system Train staff in the preparation of acccounting records TAX SERVICES Preparation of corporate and partnership tax returns Tax planning and advice BUSINESS ADVICE AND OTHER SERVICES Financial statement review and compilation Securing bank financing Cash management advice Review of employee benefits Business planning Accounting manuals HR Manuals Operational and profitability improvement consulting bottom of page HUMAN RESOURCES top of page HUMAN RESOURCE SERVICES We provide a full range of hands on support to help you develop strong people, processes, and environments. We can assist you with: Recruitment and selection Performance management Employee relations Compensation and benefits Succession planning Policies and procedures Human resource risk assessment Human resource compliance audit. bottom of page CONTACT US top of page Contact Us ZACHE DESIRE , CPA, SPHR - Zache@Desirecpas.com DANIEL DESIRE, CPA - Daniel@Desirecpas.com NYC OFFICE: 100 Park Avenue Suite 1600 New York, NY 10017 Phone: (212) 351 - 5092 Fax: (516) 726 - 8230 LONG ISLAND OFFICE: 405 RXR Plaza Suite 405 Uniondale, NY 11556 Phone: (516) 478-9341 Fax: (516) 726-8230 bottom of page",
  "use cases": "| Demonstrating how to set up a computerized accounting system | Explaining the benefits of internal control reviews and risk assessments | Walking through the process of preparing a pre-audit report",
  "services": "Outsourced Chief Financial Officer Services | CFO one-on-one training, coaching, and mentoring | Preparation of pre-audit reports | Accounting software review, setup, and conversions | Internal control review and risk assessments | Internal audit services | Organization review | Budget and cash management | Management talent assessment | Strategic and tactical planning | Standard Operating Procedures Manual | Expense reduction services | Financial Statement audits | Federal (A-133) audits | Employee benefit plan audits | 990 and CHAR500 tax returns for Exempt Organization | Corporate tax and tax planning | Individual tax return and tax planning | BOOKKEEPING SERVICES | Accounting services scaled to your business needs | Set up computerized accounting system | Train staff in the preparation of accounting records | TAX SERVICES | Preparation of corporate and partnership tax returns | Tax planning and advice | BUSINESS ADVICE AND OTHER SERVICES | Financial statement review and compilation | Securing bank financing | Cash management advice | Review of employee benefits | Business planning | Accounting manuals | HR Manuals | Operational and profitability improvement consulting | Recruitment and selection | Performance management | Employee relations | Compensation and benefits | Succession planning | Policies and procedures | Human resource risk assessment | Human resource compliance audit",
  "email 1": "Hi Zache,\n\nI came across DESIRE & COMPANY CPAs recently and wanted to reach out directly.\n\nI'm Trent, and I run Toon Theory; an animation studio based in the UK. We make whiteboard videos that break down complex ideas with simple, hand-drawn visuals. It’s perfect for B2B, thought leadership, and data-driven education.\n\nFor DESIRE & COMPANY CPAs, I think there could be a great opportunity to use visual storytelling to help more people “get it” faster. Our animations are fully done-for-you: script, illustrations, voice, and storyboard; so you can use them for:\n\n• Demonstrating how to set up a computerized accounting system\n• Explaining the benefits of internal control reviews and risk assessments\n• Walking through the process of preparing a pre-audit report\n\nThese videos often help businesses increase engagement by up to 60%, double conversion rates, and boost message retention by up to 80%.\n\nIf you're curious, I could draft a ten-second teaser or sketch based on what DESIRE & COMPANY CPAs offers. Nothing formal. Just something you can react to, no strings or expectations.\n\nLet me know if you'd like to take this further. You can check out some of our work through the link in my signature as well.\n\nKeep doing what you do, it's making an impact.\n\nAll the best,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Hi there Zache,\n\nI wanted to circle back following my last email about using whiteboard animation at DESIRE & COMPANY CPAs. These videos can really simplify complex ideas and help you connect with your audience in a memorable way.\n\nIf you’re open to it, I’d love to put together that quick sketch or script I mentioned earlier; something tailored specifically to one of your key offerings or a new product launch, perhaps.\n\nFeel free to reply anytime. And just in case you missed it, some of our past projects are linked in my signature.\n\nWarm regards,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Greetings Zache,\n\nChecking in again to share how whiteboard animation could help DESIRE & COMPANY CPAs communicate clearly and creatively with your audience.\n\nAnimation can make even the most complicated topics accessible and engaging, which often leads to better engagement.\n\nIf you’re open to it, I’d love to draft a short visual concept for you to review.\n\nFeel free to reply anytime, and you can see examples of our work linked below.\n\nRespectfully,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175190402862.1964.267635855878551839@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "after initial",
  "initial time": "16:59",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
{
  "business name": "The Knowledge Academy",
  "website url": "https://www.theknowledgeacademy.com/us/",
  "location": "York, NY 10174",
  "industry": "Training Programs, Online Education, Human Resources, Computer Training, Management Training",
  "first name": "Barinder",
  "middle name": "",
  "last name": "Hothi",
  "title": "Managing Director",
  "email": "barinder.hothi@theknowledgeacademy.com",
  "web copy": "PRINCE2 Training, PRINCE2 Courses, ITIL Training and PMP Training - United States Training the world s professionals Transforming organisations and individuals across the world. Sorry! Looks like we are having trouble finding the course you re looking for. We may not have the course you re looking for. If you Inquire or give us a call on +1 7204454674 and speak to our training experts, we may still be able to help with your training requirements. Inquire now See full course catalogue Or select from our popular topics PMP ITIL Certification PRINCE2 Scrum Certification Lean Six Sigma Certification Agile TOGAF CISSP IIBA Business Analysis Microsoft Azure Certification Explore more courses Professional training, the way it should be done. Largest global course portfolio You won t find better value in the marketplace. If you do find a lower price, we will beat it. Best choice of dates for classroom courses A variety of delivery methods are available depending on your learning preference. Most venues globally We have locations stretching the entire globe, allowing flexible training wherever you need it. Multichannel delivery We re the only provider to have classroom, online instructor-led, online self-paced and in-house training methods globally. Our new normal Over the course of the current health crisis we ve adapted the way we work to allow our clients to continue getting the same great quality training, whilst in a safe environment. All of our courses are available as online instructor-led, you get the feel of a classroom course but from the comfort of your own home. We re currently offering up to 25% off all Online Instructor-led courses. Don t miss out! Inquire now Expert training in a classroom, online or from home! POPULAR Online Instructor-led Live classes Join a scheduled class with a live instructor and other delegates Fully interactive Ask questions, share documents, interact with whiteboards, ask live questions and communicate with your trainer and peers. No travel or accommodation costs An affordable way to boost your career. Access the best pool of trainers, wherever you are We use the same pool of expert trainers for our Online Instructor-led courses, so no need to leave where you live or work. POPULAR Online Self-paced Tutor support 24/7 Our expert trainers are on hand to help you with any questions which may arise. Immediate access for 90 days All of our courses come with a standard 90 days access which can be upgraded if need be. Personal performance reports Keep track of your own progression throughout your course and ensure continuous improvement. Compatible on all devices Whether you re on the move or at home, our courses are available to you. Classroom Highly experienced trainers All of our trainers are highly qualified, having 10+ years of real-world experience. State of the art training venues We use the highest quality learning facilities to make sure your experience is as comfortable as possible. Small class sizes We limit our class sizes to promote better discussion and ensure everyone has a personalized experience in a safe environment. Great value for money Get more bang for your buck! If you find your chosen course cheaper elsewhere, we ll match it! Onsite Tailored learning experience Our courses can be adapted to meet your individual project or business requirements regardless of scope. Maximise your training budget Cut unnecessary costs and focus your entire budget on what really matters, the training. Team building opportunity This gives your team a great opportunity to come together, bond, and discuss, which may be limited in a standard classroom setting. Learn more about Onsite training We ve trained 300,000+ companies & over 2,000,000 delegates Bespoke training services to help your business reach the level it deserves to be. Maximum budget efficiency Our training pass services allow you to take full control of your budget and get the most for your money. Save time & avoid hassle Once we have your training requirements, we do all the hard work from start to finish. Dedicated account manager Your on hand account manager is committed to delivering the best possible service. Highest calibre of trainers We only source the best quality trainers from around the globe to ensure your training runs like clockwork Inquire now Our courses are accredited by the leading learning institutions across the globe Leading bodies including APMG, BCS, PeopleCert, CompTIA and Microsoft have accredited our courses, materials and trainers, certifying that they reach the high standards that they require from their training partners. The Knowledge Centre What is ACAS (Advisory, Conciliation and Arbitration Service)?... ACAS (Advisory, Conciliation and Arbitration Service) is a UK body offering free, impartial advice to enhance workplace relationships and resolve challenges. It supports both employers and employees through clear guidance and practical services. This involves dispute solution methods advised to effe... 02 Jul 2025 Sustainability in Project Management: Principles & How to Achieve 02 Jul 2025 What is Web Application Testing and Why is it Important? 02 Jul 2025 What is Web Hosting, and How Does It Work? 02 Jul 2025 View older posts Transforming people and organisations around the globe DELEGATES TRAINED 2,000,000+ TEAMS developed 90,000+ organisations transformed 15,000+ WORLDWIDE locations 490+ See full course catalogue Inquire now What are you looking for? close Sorry! Looks like we are having trouble finding the course you re looking for. We may not have the course you re looking for. If you enquire or give us a call on +1 7204454674 and speak to our training experts, we may still be able to help with your training requirements. Enquire now See full course catalogue Or select from our popular topics PMP ITIL Certification PRINCE2 Scrum Certification Lean Six Sigma Certification Agile TOGAF CISSP IIBA Business Analysis Microsoft Azure Certification GDPR Microsoft Excel Courses Business Analysis Courses Microsoft Project Software Testing Courses Explore more courses Press esc to close close Talk to a learning expert Fill out your contact details below and our training experts will be in touch. If you wish to make any changes to your course, please log a ticket and choose the category booking change close Thank you for your enquiry! One of our training experts will be in touch shortly to go over your training requirements. Close close Press esc to close Back to Course Information Back to course information Back to course information Thank you for your enquiry! One of our training experts will be in touch shortly to go overy your training requirements. Close Thank you for your enquiry! One of our training experts will be in touch shortly to go over your training requirements. Close PRINCE2 Training, PRINCE2 Courses, ITIL Training and PMP Training - United States Training the world s professionals Transforming organisations and individuals across the world. Sorry! Looks like we are having trouble finding the course you re looking for. We may not have the course you re looking for. If you Inquire or give us a call on +1 7204454674 and speak to our training experts, we may still be able to help with your training requirements. Inquire now See full course catalogue Or select from our popular topics PMP ITIL Certification PRINCE2 Scrum Certification Lean Six Sigma Certification Agile TOGAF CISSP IIBA Business Analysis Microsoft Azure Certification Explore more courses Professional training, the way it should be done. Largest global course portfolio You won t find better value in the marketplace. If you do find a lower price, we will beat it. Best choice of dates for classroom courses A variety of delivery methods are available depending on your learning preference. Most venues globally We have locations stretching the entire globe, allowing flexible training wherever you need it. Multichannel delivery We re the only provider to have classroom, online instructor-led, online self-paced and in-house training methods globally. Our new normal Over the course of the current health crisis we ve adapted the way we work to allow our clients to continue getting the same great quality training, whilst in a safe environment. All of our courses are available as online instructor-led, you get the feel of a classroom course but from the comfort of your own home. We re currently offering up to 25% off all Online Instructor-led courses. Don t miss out! Inquire now Expert training in a classroom, online or from home! POPULAR Online Instructor-led Live classes Join a scheduled class with a live instructor and other delegates Fully interactive Ask questions, share documents, interact with whiteboards, ask live questions and communicate with your trainer and peers. No travel or accommodation costs An affordable way to boost your career. Access the best pool of trainers, wherever you are We use the same pool of expert trainers for our Online Instructor-led courses, so no need to leave where you live or work. POPULAR Online Self-paced Tutor support 24/7 Our expert trainers are on hand to help you with any questions which may arise. Immediate access for 90 days All of our courses come with a standard 90 days access which can be upgraded if need be. Personal performance reports Keep track of your own progression throughout your course and ensure continuous improvement. Compatible on all devices Whether you re on the move or at home, our courses are available to you. Classroom Highly experienced trainers All of our trainers are highly qualified, having 10+ years of real-world experience. State of the art training venues We use the highest quality learning facilities to make sure your experience is as comfortable as possible. Small class sizes We limit our class sizes to promote better discussion and ensure everyone has a personalized experience in a safe environment. Great value for money Get more bang for your buck! If you",
  "use cases": "Showing how PRINCE2 methodology improves project management efficiency | Explaining the benefits of ITIL certification for IT professionals | Demonstrating how to apply Agile principles in real-world scenarios",
  "services": "PRINCE2 Training | PRINCE2 Courses | ITIL Training | PMP Training | ITIL Certification | PRINCE2 Scrum Certification | Lean Six Sigma Certification | Agile Certification | TOGAF Certification | CISSP Certification | IIBA Business Analysis | Microsoft Azure Certification | Microsoft Excel Courses | Business Analysis Courses | Microsoft Project Courses | Software Testing Courses | Online Instructor-led Training | Online Self-paced Training | Classroom Training | Onsite Training | Bespoke Training Services | Training Pass Services",
  "email 1": "Hi Barinder,\n\nI stumbled on The Knowledge Academy the other day and wanted to get in touch.\n\nI'm Trent, and I run Toon Theory; an animation studio based in the UK. We use hand-drawn animations to help businesses get their message across. It's a simple way to cut through noise, especially in B2B, thought leadership, and data-driven education.\n\nThe Knowledge Academy has a strong foundation, and a short animated video could be a powerful way to bring your message to life. We’ll take care of the full creative lift: script, voice, and illustrations, so you can use it for:\n\n• Explaining the benefits of ITIL certification for IT professionals\n• Showing how PRINCE2 methodology improves project management efficiency\n• Demonstrating how to apply Agile principles in real-world scenarios\n\nThese animations don’t just explain, they convert; Many of our past clients see a big lift in engagement, trust, and sales.\n\nI’d love to put together a quick concept; maybe a script or a short teaser; around one of your key offerings. No strings, just a preview of what's possible with The Knowledge Academy's voice behind it.\n\nI’d be happy to chat if you’re interested. Just reply anytime, and feel free to check out some of our work through the link in my signature.\n\nThanks for putting something refreshing out there.\n\nRespectfully,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Howdy Barinder,\n\nJust reaching out again about the possibility of using whiteboard animation to enhance The Knowledge Academy’s messaging.\n\nThis approach often helps businesses increase engagement, simplify communication, and improve conversion rates.\n\nIf you’re curious, I’d be happy to draft a quick demo or script for you to review at your convenience.\n\nYou can reply any time, and there’s a link to our previous work in my signature.\n\nWith appreciation,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Hi Barinder,\n\nI just wanted to check in again and see if the idea of using whiteboard animation for The Knowledge Academy has sparked any interest. Animation can be a great way to highlight key messages and bring stories to life in a memorable way.\n\nIf you'd like, I can put together a simple draft or a short sample video to show how this could work for you.\n\nYou can also find examples of our previous work linked in my signature. Please don’t hesitate to reply if you want to explore this.\n\nCheers,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175190451767.1934.15799436533829945387@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "after initial",
  "initial time": "17:07",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
{
  "business name": "JER HR Group",
  "website url": "https://www.jerhrgroup.com/",
  "location": "York, NY 10036",
  "industry": "Human Resources",
  "first name": "Bruce",
  "middle name": "E.",
  "last name": "Johanson",
  "title": "Consultant",
  "email": "bruce@jerhrgroup.com",
  "web copy": "HR Consulting Company - JER HR Group Skip to content Human Resource Consultants JER HR Group JER HR Group 2025-06-27T13:29:16-04:00 HR Consulting Services HR IS ALWAYS MOVING. From insights to tools, we go further. jer hr group HR IS ALWAYS MOVING. From insights to tools, we go further. Human Resource Consultants Compensation Consulting Bridge the gap between people, work, and pay with compensation solutions that attract and retain talented individuals, improve pay equity, strengthen sales teams, and minimize regulatory risks. Access 40+ expert compensation consultants for nonprofit and for-profit sectors. Learn More > HR Consulting Solve your toughest people challenges, rethink HR processes, and minimize compliance risks with JER HR Group s expert HR consultants. Whether you have 50 or 500 employees, our HR experts work closely with you to deliver high-value HR support, platforms, and a workplace that fosters innovation. Learn More > Organizational Development Do your managers need to develop their skills? Could your teams function more efficiently? Does executive leadership impact long-lasting organizational results? Work with experienced, top-rated organizational consultants and trainers who ignite leadership and drive growth in your company. Learn More > Contact Us Trusted by Companies of All Sizes Compensation Consulting Services JER HR Group provides competitive compensation strategies for public and private companies, including job evaluation, executive and staff compensation , pay equity analysis, and total rewards pay structures. We help you implement incentive, sales , and compensation plans that attract and retain talent, motivate teams to be highly engaged in your company s success, and reduce compliance risks. We help you get your pay right . Schedule a Comp Conversation Download Brochure HR Consulting Services JER HR Group helps you solve your toughest people challenges, rethink HR processes, and find new pathways to growth. Our team works collaboratively to deliver effective, high-value solutions for critical and day-to-day HR needs, including HR support , HR Consulting, employee handbooks , policy management, HR audits , regulatory compliance , and investigations . Change meets now . Schedule a Consultation Download Brochure Organizational Development With over 25 years providing leadership development to top companies in the United States and abroad, JER HR Group has a proven track record of equipping leaders and their teams with the skills they need to achieve success in the workplace. LEARN MORE ABOUT Leadership Development Executive Coaching Diversity, Equity, Inclusion Performance Management For change that delivers. Contact Us Download Brochure About JER HR Group JER HR Group is a human resource consulting firm helping companies create a healthy, high-performing, people focused environment that can do extraordinary things. Build a fair and equitable rewards plan that attracts and retains talented individuals. Drive innovative HR practices and processes and realize exceptional business value from technology. Accelerate the path to value, hire the right talent, and develop every individual to their full potential. Create workplace cultures that drive organizational growth. People drive your organization forward. We empower the people. JER HR Group helps great organizations to be their best. Our team works collaboratively with clients across the country to solve big challenges, meeting clients wherever they are on the path to understand culture, issues and change. Are you ready to drive change forward ? Access 35 years+ of experience: Compensation consulting for executive and staff compensation, sales, position classification and compensation plan design. Benefit from the strength of 40+ HR consultants, with an average of 20 years of experience each: HR compliance, HR Consulting, Human Resource transformation, HR audits, investigations, policy development/employee handbooks, fractional HR and recruiting. Equip your leaders and teams with the skills they need to achieve success in the workplace: Leadership development, coaching, team building and employee development from top workforce training consultants, many with worldwide recognition. Latest HR News and Insights JER HR Group 2025-07-04T12:07:45-04:00 How to Right-size Compensation for Non-profit Organizations Non-profit organizations realize they must balance mission-driven values with the need to attract, retain, and fairly compensate talent all while staying within tight financial constraints. Custom compensation surveys offer a strategic and cost-effective solution to [...] JER HR Group 2025-07-04T12:07:07-04:00 Criteria for Market Survey Pay Data Today, any motivated employee can gain access to salary data from the internet which suggests, nay prove, that he or she is underpaid by many thousands of dollars. So how do you deal with [...] JER HR Group 2025-03-31T13:55:31-04:00 Unlocking Leadership Potential: How to Measure the Effectiveness of Executive Coaching Programs Executive coaching has become a cornerstone of leadership development, helping senior leaders sharpen their skills, enhance decision-making, and drive business performance. According to the International Coaching Federation (ICF), the global executive coaching industry is [...] Resources Bridging the Pay Equity Gap DOWNLOAD How Technology is Redefining Performance Management DOWNLOAD A New Approach to Leadership Development DOWNLOAD NexaLearning to Merge with JER HR Group JER HR Group and NexaLearning jointly announce their plans for NexaLearning to join JER HR Group effective immediately. READ JER HR Group Announces Acquisition of Human Resources Plus JER HR Group and Human Resources Plus jointly announced JER HR Group s acquisition of Human Resources Plus, Inc. today. Human Resources Plus (HRP) is a HR consulting firm and online HR document provider READ JER HR Group Announces Acquisition of Willis HR JER HR Group LLC acquires Willis HR LLC, a HR Consulting firm. JER HR Group and Willis HR jointly announce JER HR Group s acquisition of Willis HR in a private transaction. Willis HR is a leading HR consulting READ LET S TALK ABOUT PEOPLE, IDEAS, AND SOLUTIONS. If you want to recruit, engage, develop, and retain the best team in the business, get in touch with us. Toll Free: +1 (866)-475-7687 If you want to recruit, engage, develop, and retain the best team in the business, get in touch with us. Toll Free: +1 (866)-475-7687 NEW YORK OFFICE 112 W. 34th Street 18th Floor New York, NY 10120 PHILADELPHIA OFFICE 1515 Market Street, Suite 1200 Philadelphia, PA 19102 NORTH CAROLINA OFFICE 6801 Pleasant Pines Drive, Suite 103 Raleigh, NC 27613 ARKANSAS OFFICE 2928 McKee Circle, Suite 123 Fayetteville, AR 72703 IOWA OFFICE 3020 Jordan Grove West Des Moines, IA 50265 SOUTH CAROLINA OFFICE 1122 Lady Street 3rd Floor Columbia, SC 29201 TRAINERY ONE 6801 Pleasant Pines Drive, Suite 103 Raleigh, NC 27613 800.397.5215 SIGN UP FOR HRNEWS + VIEWS SUBSCRIBE NOW NexaLearning to Merge with JER HR Group JER HR Group and NexaLearning jointly announce their plans for NexaLearning to join JER HR Group effective immediately. READ JER HR Group Announces Acquisition of Human Resources Plus JER HR Group and Human Resources Plus jointly announced JER HR Group s acquisition of Human Resources Plus, Inc. today. Human Resources Plus (HRP) is a HR consulting firm and online HR document provider READ JER HR Group Announces Acquisition of Willis HR JER HR Group LLC acquires Willis HR LLC, a HR Consulting firm. JER HR Group and Willis HR jointly announce JER HR Group s acquisition of Willis HR in a private transaction. Willis HR is a leading HR consulting READ Page load link Introducing Go to Top HR Consulting Company - JER HR Group Skip to content Human Resource Consultants JER HR Group JER HR Group 2025-06-27T13:29:16-04:00 HR Consulting Services HR IS ALWAYS MOVING. From insights to tools, we go further. jer hr group HR IS ALWAYS MOVING. From insights to tools, we go further. Human Resource Consultants Compensation Consulting Bridge the gap between people, work, and pay with compensation solutions that attract and retain talented individuals, improve pay equity, strengthen sales teams, and minimize regulatory risks. Access 40+ expert compensation consultants for nonprofit and for-profit sectors. Learn More > HR Consulting Solve your toughest people challenges, rethink HR processes, and minimize compliance risks with JER HR Group s expert HR consultants. Whether you have 50 or 500 employees, our HR experts work closely with you to deliver high-value HR support, platforms, and a workplace that fosters innovation. Learn More > Organizational Development Do your managers need to develop their skills? Could your teams function more efficiently? Does executive leadership impact long-lasting organizational results? Work with experienced, top-rated organizational consultants and trainers who ignite leadership and drive growth in your company. Learn More > Contact Us Trusted by Companies of All Sizes Compensation Consulting Services JER HR Group provides competitive compensation strategies for public and private companies, including job evaluation, executive and staff compensation , pay equity analysis, and total rewards pay structures. We help you implement incentive, sales , and compensation plans that attract and retain talent, motivate teams to be highly engaged in your company s success, and reduce compliance risks. We help you get your pay right . Schedule a Comp Conversation Download Brochure HR Consulting Services JER HR Group helps you solve your toughest people challenges, rethink HR processes, and find new pathways to growth. Our team works collaboratively to deliver effective, high-value solutions for critical and day-to-day HR needs, including HR support , HR Consulting, employee handbooks , policy management, HR audits , regulatory compliance , and investigations . Change meets now . Schedule a C",
  "use cases": "| Explaining how to conduct a fair job evaluation | Demonstrating the benefits of total rewards pay structures | Walking through the process of implementing an incentive plan |",
  "services": "Compensation consulting | Job evaluation | Executive and staff compensation | Pay equity analysis | Total rewards pay structures | Incentive plan implementation | Sales plan implementation | Compensation plan implementation | HR consulting | HR support | HR audits | Regulatory compliance | Investigations | Policy management | Employee handbooks | Organizational development | Leadership development | Executive coaching | Diversity, equity, and inclusion | Performance management | Leadership development | Coaching | Team building | Employee development | Fractional HR | Recruiting",
  "email 1": "Hello Bruce,\n\nI just saw JER HR Group and thought you might be the right person to speak with.\n\nI'm Trent. I run Toon Theory, a whiteboard animation studio in the UK. We make simple, animated explainer videos that help people understand dense ideas. They're great for B2B services, thought leadership, and data-driven education.\n\nFor JER HR Group, I think there could be a great opportunity to use visual storytelling to help more people “get it” faster. Our animations are fully done-for-you: script, illustrations, voice, and storyboard; so you can use them for:\n\n• Demonstrating the benefits of total rewards pay structures\n• Explaining how to conduct a fair job evaluation\n• Walking through the process of implementing an incentive plan\n\nWhether it’s more signups, better retention, or faster understanding, these animations know how to hit hard. And they move the needle where it counts.\n\nI’d be glad to pull together a short demo; maybe a script or quick sketch; based on what JER HR Group does best. No pressure, just a chance to preview what it might look and sound like.\n\nReply anytime if you'd like to talk more about this. There’s also a link below with some samples of what we’ve done before.\n\nThanks for leading with both heart and strategy.\n\nSincerely,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Hello there Bruce,\n\nFollowing up briefly in case you’re still open to exploring how animated storytelling could help simplify JER HR Group’s messaging.\n\nIt’s something that’s worked well for businesses trying to explain detailed services, product workflows, or industry insights in a more digestible way.\n\nHappy to create a short, customized sample if you’d like a clearer sense of how this could look.\n\nReply anytime;  there’s also a link to our previous work below.\n\nKind regards,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Hello Bruce,\n\nJust circling back in case the timing makes more sense now. I still believe whiteboard animation could support something JER HR Group is working on, whether that is a pitch, process, or product.\n\nIf you would like to test the waters, I am happy to sketch something out to show what it might look like.\n\nYou will find past examples linked in my signature. Feel free to reply if you would like to explore this.\n\nWarm regards,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175190494497.1922.6477682551519430769@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "no reply",
  "initial time": "17:14",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
{
  "business name": "Peoplease",
  "website url": "https://www.peoplease.com/",
  "location": "Center, MN 55430",
  "industry": "Human Resources",
  "first name": "Tony",
  "middle name": "",
  "last name": "Wincowski",
  "title": "Director of Sales",
  "email": "twinckowski@peoplease.com",
  "web copy": "Home - Peoplease SIMPLIFY SUCCESS LET S UNCOMPLICATE YOUR BUSINESS. Hey, you ve got a business to grow, and we re here to make that a whole lot easier. Welcome to Peoplease your employment management solution. We re here to take the headache out of payroll, make compliance a breeze, and manage risks so you can sleep at night. So, let s start helping you do things the easy way. See What Ease Looks Like Gain Peace of Mind Workers' Compensation and Risk & Safety Solutions You re all about making sure the job gets done right, but let s face it managing compensation and risk is a lot to tackle on your own. With Peoplease support, you can ensure your business is protected. See What Ease Looks Like See What Ease Looks Like Let's Build On Your Success. From payroll management to healthcare benefits to workers compensation, we re here to help. Peoplease lets you focus on what you do best running your business. See What Ease Looks Like How Can We Help You Today? PEO Advantages Discover how partnering with Peoplease can reduce the time and money you spend managing HR. Why Peoplease Learn how partnering with Peoplease can help grow your business. Portal Login Find your W-2, Paystubs, and More on your portal. Join Our Team Are you a self-starter who is passionate about excellent customer service and solutions? We d love to have you on our team. I m a Broker Partnering with Peoplease. Free Consultation Discover how Peoplease can support your business. Are you ready for a PEO? Find out with three simple questions. How Peoplease Makes Things Easier. At Peoplease, we specialize in providing top-notch HR solutions, compliance, payroll, workers compensation, and benefits administration in a single package. Risk & Safety Safeguard your business while you focus on growth and success. Workers' Compensation Manage claims, payments, safety programs, and more. Payroll Robust payroll at your fingertips. No matter how complex, you can easily manage all of your payroll needs on a single platform. HR administration We focus on HR so you can focus on your business. Rely on our experts to help you create a healthy workplace and navigate employment issues. Benefits/Retirement Choose from flexible and affordable benefit programs suited to your business. Technology Solutions Manage the employee lifecycle, through our technology platform. Learn More Let s Get Started. View our currently open positions. Job listings brought to you by PrismHR Hiring . Home - Peoplease SIMPLIFY SUCCESS LET S UNCOMPLICATE YOUR BUSINESS. Hey, you ve got a business to grow, and we re here to make that a whole lot easier. Welcome to Peoplease your employment management solution. We re here to take the headache out of payroll, make compliance a breeze, and manage risks so you can sleep at night. So, let s start helping you do things the easy way. See What Ease Looks Like Gain Peace of Mind Workers' Compensation and Risk & Safety Solutions You re all about making sure the job gets done right, but let s face it managing compensation and risk is a lot to tackle on your own. With Peoplease support, you can ensure your business is protected. See What Ease Looks Like See What Ease Looks Like Let's Build On Your Success. From payroll management to healthcare benefits to workers compensation, we re here to help. Peoplease lets you focus on what you do best running your business. See What Ease Looks Like How Can We Help You Today? PEO Advantages Discover how partnering with Peoplease can reduce the time and money you spend managing HR. Why Peoplease Learn how partnering with Peoplease can help grow your business. Portal Login Find your W-2, Paystubs, and More on your portal. Join Our Team Are you a self-starter who is passionate about excellent customer service and solutions? We d love to have you on our team. I m a Broker Partnering with Peoplease. Free Consultation Discover how Peoplease can support your business. Are you ready for a PEO? Find out with three simple questions. How Peoplease Makes Things Easier. At Peoplease, we specialize in providing top-notch HR solutions, compliance, payroll, workers compensation, and benefits administration in a single package. Risk & Safety Safeguard your business while you focus on growth and success. Workers' Compensation Manage claims, payments, safety programs, and more. Payroll Robust payroll at your fingertips. No matter how complex, you can easily manage all of your payroll needs on a single platform. HR administration We focus on HR so you can focus on your business. Rely on our experts to help you create a healthy workplace and navigate employment issues. Benefits/Retirement Choose from flexible and affordable benefit programs suited to your business. Technology Solutions Manage the employee lifecycle, through our technology platform. Learn More Let s Get Started. View our currently open positions. Job listings brought to you by PrismHR Hiring . Privacy Policy - Peoplease Privacy Policy Last updated: September 04, 2024 This Privacy Policy describes Our policies and procedures on the collection, use and disclosure of Your information when You use the Service and tells You about Your privacy rights and how the law protects You. We use Your Personal data to provide and improve the Service. By using the Service, You agree to the collection and use of information in accordance with this Privacy Policy. This Privacy Policy has been created with the help of the Free Privacy Policy Generator . Interpretation and Definitions Interpretation The words of which the initial letter is capitalized have meanings defined under the following conditions. The following definitions shall have the same meaning regardless of whether they appear in singular or in plural. Definitions For the purposes of this Privacy Policy: Account means a unique account created for You to access our Service or parts of our Service. Affiliate means an entity that controls, is controlled by or is under common control with a party, where control means ownership of 50% or more of the shares, equity interest or other securities entitled to vote for election of directors or other managing authority. Company (referred to as either the Company , We , Us or Our in this Agreement) refers to Peoplease, LLC., 1 W Church Street Ste 200, Orlando FL 32801. Cookies are small files that are placed on Your computer, mobile device or any other device by a website, containing the details of Your browsing history on that website among its many uses. Country refers to: Florida, United States Device means any device that can access the Service such as a computer, a cellphone or a digital tablet. Personal Data is any information that relates to an identified or identifiable individual. Service refers to the Website. Service Provider means any natural or legal person who processes the data on behalf of the Company. It refers to third-party companies or individuals employed by the Company to facilitate the Service, to provide the Service on behalf of the Company, to perform services related to the Service or to assist the Company in analyzing how the Service is used. Usage Data refers to data collected automatically, either generated by the use of the Service or from the Service infrastructure itself (for example, the duration of a page visit). Website refers to Peoplease, accessible from www.peoplease.com You means the individual accessing or using the Service, or the company, or other legal entity on behalf of which such individual is accessing or using the Service, as applicable. Collecting and Using Your Personal Data Types of Data Collected Personal Data While using Our Service, We may ask You to provide Us with certain personally identifiable information that can be used to contact or identify You. Personally identifiable information may include, but is not limited to: Email address First name and last name Phone number Usage Data Usage Data Usage Data is collected automatically when using the Service. Usage Data may include information such as Your Device s Internet Protocol address (e.g. IP address), browser type, browser version, the pages of our Service that You visit, the time and date of Your visit, the time spent on those pages, unique device identifiers and other diagnostic data. When You access the Service by or through a mobile device, We may collect certain information automatically, including, but not limited to, the type of mobile device You use, Your mobile device unique ID, the IP address of Your mobile device, Your mobile operating system, the type of mobile Internet browser You use, unique device identifiers and other diagnostic data. We may also collect information that Your browser sends whenever You visit our Service or when You access the Service by or through a mobile device. Tracking Technologies and Cookies What Are Cookies As is common practice with almost all professional websites this site uses cookies, which are tiny files that are downloaded to your computer, to improve your experience. This page describes what information they gather, how we use it, and why we sometimes need to store these cookies. We will also share how you can prevent these cookies from being stored; however, this may downgrade or break certain elements of the sites functionality. For more general information on cookies see the Wikipedia article on HTTP Cookies. How We Use Cookies We use cookies for a variety of reasons detailed below. Unfortunately, in most cases, there are no industry standard options for disabling cookies without completely disabling the functionality and features they add to this site. It is recommended that you leave on all cookies if you are not sure whether you need them or not in case they are used to provide a service that you use. Disabling Cookies You can prevent the setting of cookies by adjusting the settings on your browser (see your browser Help for how to do this). Be aware that disabling cookies will affect the functionality of this and many other websites ",
  "use cases": "Explaining how to file a workers' compensation claim step-by-step | Demonstrating how to implement safety protocols in the workplace | Walking through the benefits of outsourcing payroll and HR administration",
  "services": "Workers' Compensation | Risk & Safety | Payroll | HR administration | Benefits/Retirement | Technology Solutions",
  "email 1": "Hi Tony,\n\nI stumbled across Peoplease and thought I’d reach out.\n\nI'm Trent, and I run Toon Theory; an animation studio based in the UK. We make whiteboard videos that break down complex ideas with simple, hand-drawn visuals. It’s perfect for B2B, thought leadership, and data-driven education.\n\nI think Peoplease could really benefit from using visual storytelling to explain things faster and make them stick. We take care of everything: scripting, illustration, voiceover and storyboarding; so you can use the final video for:\n\n• Explaining how to file a workers' compensation claim step-by-step\n• Demonstrating how to implement safety protocols in the workplace\n• Walking through the benefits of outsourcing payroll and HR administration\n\nThese videos often help businesses increase engagement by up to 60%, double conversion rates, and boost message retention by up to 80%.\n\nI could pull together a quick sketch or sample script based on one of Peoplease’s core offerings. Just a lightweight preview, no expectations; just to show what’s possible.\n\nIf it feels like a fit, you can reply any time. There’s also a link in my signature in case you want to browse a few previous projects.\n\nKeep doing what you do, it's making an impact.\n\nBest wishes,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Hello Tony,\n\nReaching out again about the opportunity for Peoplease to stand out using whiteboard animation.\n\nWhether it’s for pitching, explaining products, or internal training, these videos really hit the nail on the head.\n\nIf you’re open to it, I can prepare a quick sketch or script sample tailored to your brand; no pressure at all.\n\nYou’ll find examples of our previous work linked below. Let me know if you’d like to explore the fit.\n\nTake care,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Hi Tony,\n\nThought I would check in one last time.\n\nIf you are still curious what an animated whiteboard explainer might look like for Peoplease, I would be glad to share something rough, a short teaser, or a script to get the ball rolling.\n\nYou can find our work in the link below. Reply anytime if you are interested.\n\nAll the best,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175190542258.1932.6686195643406994262@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "no reply",
  "initial time": "17:22",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
{
  "business name": "Abdo",
  "website url": "https://abdosolutions.com/",
  "location": "Edina, MN 55436",
  "industry": "CPA, Tax Return Preparation, Financial Services, Tax Consultant, Accountant, Bookkeeping Services, Payroll Services, Accounting, Estate Planning and Management, Human Resources, Taxes, Business Development",
  "first name": "Steven",
  "middle name": "",
  "last name": "McDonald",
  "title": "Managing Partner",
  "email": "steven.mcdonald@abdosolutions.com",
  "web copy": "CPAs, Accounting and Consulting Services | Abdo Skip to content Lighting the path forward We are Abdo: a team of highly responsive advisory partners who bring a deep level of expertise and an even deeper commitment to understanding your specific needs. For 60 years our mission has been to serve as proactive problem-solvers, providing partnership and guidance so you can take every step forward with confidence. Learn More Services Abdo puts decades of focused experience to work for your organization, with our professionals offering a deep-and-broad approach to problem-solving. Advisory We work closely with clients to help them navigate the constantly changing landscape of today s world. Audit Our fluency in the language of financial statements means assurance to all stakeholders. HR & Payroll Our focus on complete, customized solutions leads to innovative ways to address today s HR challenges. Tax Our holistic approach to managing taxes ensures an integration of business and personal goals. Technology & Data From user-friendly dashboards to managing software implementations, our experts put the latest advancements in your hands. Wealth Management Our partnership with OneDigital integrates best-in-class accounting/tax consulting with top-notch wealth advisory services. Industries Industry-specific expertise with farsighted vision Our team includes individuals with honed skills within specific industries, who are tapped into the latest developments and the landscape ahead. Construction/Real Estate Government Manufacturing Nonprofit Professional Services Specialized Industries Insights, Resources & Tools Find your path to success Our expertise isn t just best-in-field: it s also made accessible through our tools, resources and insightful updates. Explore our offerings Featured Article Q&A with Joe Wallis: How I found my true passion and power in nonprofit accounting Featured Resource An update on the federal funding freeze Featured Case Study Helping an essential community business keep up with their growth About us Trusted partners through every challenge Our multi-skilled teams specialize in spotlighting and planning around potential pitfalls, whether it s staying ahead of changes in tax laws to testing and adapting the newest technologies on behalf of our clients. The Abdo Difference The History of Abdo Top 25 Accounting Firm in Minnesota We re committed to helping our people grow. And, in turn, we can better assist our clients in their own growth. Steve McDonald, Managing Partner Top 200 Accounting Firm in U.S. Our People Experts. Guides. Catalysts. With knowledge and care, we help clients navigate efficiently and effectively, allowing them to fearlessly forge ahead and get to exactly where they want to be. Meet Our Partners Diversity, Equity & Inclusion Careers Join the team We believe in bringing together a team that leverages different experience levels, skill sets and talents to create a one-of-a-kind organization. We re Hiring Abdo is a member of DFK International / USA, a worldwide association of independent accounting firms and business advisers. Abdo has been recognized by Inside Public Accounting as a top 200 largest Accounting firm in the nation. Abdo has been recognized as a 2025 Regional Leader in the accounting industry by Accounting Today. Abdo has received the 2025 Best of Accounting award by ClearlyRated based on client feedback. Accelerating growth On the path forward In 2024, we were named one of the Fastest Growing Firms by Inside Public Accounting and are honored to be recognized for this accelerated period of development for our firm, our employees, and our clients. We are looking forward to another big year of growth ahead! Scroll To Top CPAs, Accounting and Consulting Services | Abdo Skip to content Lighting the path forward We are Abdo: a team of highly responsive advisory partners who bring a deep level of expertise and an even deeper commitment to understanding your specific needs. For 60 years our mission has been to serve as proactive problem-solvers, providing partnership and guidance so you can take every step forward with confidence. Learn More Services Abdo puts decades of focused experience to work for your organization, with our professionals offering a deep-and-broad approach to problem-solving. Advisory We work closely with clients to help them navigate the constantly changing landscape of today s world. Audit Our fluency in the language of financial statements means assurance to all stakeholders. HR & Payroll Our focus on complete, customized solutions leads to innovative ways to address today s HR challenges. Tax Our holistic approach to managing taxes ensures an integration of business and personal goals. Technology & Data From user-friendly dashboards to managing software implementations, our experts put the latest advancements in your hands. Wealth Management Our partnership with OneDigital integrates best-in-class accounting/tax consulting with top-notch wealth advisory services. Industries Industry-specific expertise with farsighted vision Our team includes individuals with honed skills within specific industries, who are tapped into the latest developments and the landscape ahead. Construction/Real Estate Government Manufacturing Nonprofit Professional Services Specialized Industries Insights, Resources & Tools Find your path to success Our expertise isn t just best-in-field: it s also made accessible through our tools, resources and insightful updates. Explore our offerings Featured Article Q&A with Joe Wallis: How I found my true passion and power in nonprofit accounting Featured Resource An update on the federal funding freeze Featured Case Study Helping an essential community business keep up with their growth About us Trusted partners through every challenge Our multi-skilled teams specialize in spotlighting and planning around potential pitfalls, whether it s staying ahead of changes in tax laws to testing and adapting the newest technologies on behalf of our clients. The Abdo Difference The History of Abdo Top 25 Accounting Firm in Minnesota We re committed to helping our people grow. And, in turn, we can better assist our clients in their own growth. Steve McDonald, Managing Partner Top 200 Accounting Firm in U.S. Our People Experts. Guides. Catalysts. With knowledge and care, we help clients navigate efficiently and effectively, allowing them to fearlessly forge ahead and get to exactly where they want to be. Meet Our Partners Diversity, Equity & Inclusion Careers Join the team We believe in bringing together a team that leverages different experience levels, skill sets and talents to create a one-of-a-kind organization. We re Hiring Abdo is a member of DFK International / USA, a worldwide association of independent accounting firms and business advisers. Abdo has been recognized by Inside Public Accounting as a top 200 largest Accounting firm in the nation. Abdo has been recognized as a 2025 Regional Leader in the accounting industry by Accounting Today. Abdo has received the 2025 Best of Accounting award by ClearlyRated based on client feedback. Accelerating growth On the path forward In 2024, we were named one of the Fastest Growing Firms by Inside Public Accounting and are honored to be recognized for this accelerated period of development for our firm, our employees, and our clients. We are looking forward to another big year of growth ahead! Scroll To Top News - Abdo Skip to content News Abdo s Tyler Petzel to lead manufacturing segment Abdo is pleased to announce the appointment of Tyler Petzel as its new Manufacturing Segment Leader. Abdo appoints first-ever Chief Financial Officer Abdo is pleased to announce the appointment of Abigail (Abby) Smith, CPA, CMA as its first-ever Chief Financial Officer (CFO). Abdo names two new partners in 2025 Abdo is proud to announce the promotion of two outstanding professionals to Partner status: Jodi Bursheim and Geniene Scherer. Abdo announces expansion to Utah Abdo is advancing its growth plans by entering the Utah market, capitalizing on opportunities in the Salt Lake City area. Abdo Announces 2024 Promotions Abdo is pleased to announce the promotions of the following 30 individuals, effective September 1, 2024. Abdo s Jana Cinnamon Named Chair of CPA Firm Management Association Abdo is pleased to announce that its Chief Operating Officer and Partner, Jana Cinnamon, has been named Chair of the CPA Firm Management Association (CPAFMA), effective January 1, 2024. 1 2 3 6 Next View More Scroll To Top Minnesota CPAs | Industry-Specific Expertise | Abdo Skip to content Industries A broad spectrum of knowledge . A deep passion for our clients success. Abdo commits to cultivating industry specialties within our teams, viewing the current and future state of your specific situation through a financial lens. Construction/Real Estate From regulatory expertise to tax prep and audits, we help you take on any project with confidence and clearsighted vision. Government Committed to being industry leaders in governmental accounting and auditing because our communities deserve the best. Manufacturing Every manufacturer faces unique challenges, so we commit to fully understanding your business to provide customized solutions. Nonprofit Not-for-profit organizations navigate a unique landscape. Our experience supports mission-driven orgs with personalized advice. Professional Services We help professionals with the balancing act between serving customers and running a successful business. Specialized Industries Our expert teams use their deep experience to set the stage for success for banking, mutual insurance and other businesses. Committed to partnership It starts with accounting. Then goes far beyond. With almost sixty years of experience, Abdo brings a deep level of expertise and an even deeper commitment to understanding your specific needs. See our services The Abdo Difference Get in touch Insights A behind-the-numbers vie",
  "use cases": "Walking through the benefits of integrated HR and payroll services | Explaining how to optimize tax strategies for small businesses | Demonstrating how to leverage technology for data-driven financial decisions",
  "services": "Advisory | Audit | HR & Payroll | Tax | Technology & Data | Wealth Management",
  "email 1": "Hi Steven,\n\nI came across Abdo recently and wanted to reach out directly.\n\nI'm Trent, and I run Toon Theory; an animation studio based in the UK. We make whiteboard videos that break down complex ideas with simple, hand-drawn visuals. It’s perfect for B2B, thought leadership, and data-driven education.\n\nI think Abdo could really benefit from using visual storytelling to explain things faster and make them stick. We take care of everything: scripting, illustration, voiceover and storyboarding; so you can use the final video for:\n\n• Walking through the benefits of integrated HR and payroll services\n• Demonstrating how to leverage technology for data-driven financial decisions\n• Explaining how to optimize tax strategies for small businesses\n\nWhether it’s more signups, better retention, or faster understanding, these animations know how to hit hard. And they move the needle where it counts.\n\nWould you be open to seeing a quick script or ten-second sketch built with Abdo in mind? No expectations; just interested in showing you what’s possible.\n\nReply anytime if you'd like to talk more about this. There’s also a link below with some samples of what we’ve done before.\n\nThanks for leading with both heart and strategy.\n\nSincerely,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Hello Steven,\n\nJust circling back. I realize it can be tricky to see how something like whiteboard animation fits into a business like Abdo, which is why I’d love to show rather than tell.\n\nIf you’d be open to a 10-second snippet or a short script tailored to one of your core offerings, I’d be glad to share.\n\nIt’s no obligation, just a way to explore what this could look like in your context.\n\nYou’ll find some of our past work linked in my signature.\n\nBest wishes,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Good day Steven,\n\nIf you are still considering creative ways to showcase Abdo's value offerings, animated storytelling could be the missing piece of the puzzle to accelerate those conversions.\n\nI would be happy to send over a short visual teaser to get the ideas flowing.\n\nNo pressure, just a creative option to keep in mind. Reply anytime or take a peek at some of our previous work. The link is in my signature.\n\nWith appreciation,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175190567997.1938.1610280038248208902@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "no reply",
  "initial time": "17:26",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
{
  "business name": "Vitamink12",
  "website url": "https://www.vitamink12.com/",
  "location": "Paul, MN 55102",
  "industry": "Human Resources",
  "first name": "Chris",
  "middle name": "",
  "last name": "Hoehn",
  "title": "CEO/Owner",
  "email": "chris@vitamink12.com",
  "web copy": "VitaminK12 Talent Solutions for Schools School Talent Connections. Helping school HR Professionals Understand software and systems. Supporting Communities of Practitioners Connect, learn, and Grow. Improving the Job Search Experience for Educators. 01 Projects Minnesota Association of School Personnel Administrators MinnesotaSchoolJobs.org High-volume virtual hiring events . Supporting organizations with custom and high-quality experiences to connect and engage with talent. 02 About VitaminK12 as an independent technology systems consultancy based in St. Paul, Minnesota. We build tools, and bring people together to improve the way that schools attract, hire, and retain educators. Our mission is to support public education and organizations that support public school operations. 03 Get in Touch Start your journey with us now get started VitaminK12 Talent Solutions for Schools School Talent Connections. Helping school HR Professionals Understand software and systems. Supporting Communities of Practitioners Connect, learn, and Grow. Improving the Job Search Experience for Educators. 01 Projects Minnesota Association of School Personnel Administrators MinnesotaSchoolJobs.org High-volume virtual hiring events . Supporting organizations with custom and high-quality experiences to connect and engage with talent. 02 About VitaminK12 as an independent technology systems consultancy based in St. Paul, Minnesota. We build tools, and bring people together to improve the way that schools attract, hire, and retain educators. Our mission is to support public education and organizations that support public school operations. 03 Get in Touch Start your journey with us now get started",
  "use cases": "Showing educators how to navigate new software and systems | Explaining the benefits of virtual hiring events to school administrators | Demonstrating how custom talent engagement experiences can improve hiring outcomes",
  "services": "Helping school HR Professionals Understand software and systems | Supporting Communities of Practitioners Connect, learn, and Grow | Improving the Job Search Experience for Educators | High-volume virtual hiring events | Supporting organizations with custom and high-quality experiences to connect and engage with talent | Building tools",
  "email 1": "Hi Chris,\n\nI came across Vitamink12 recently and thought there could be an opportunity to collaborate.\n\nI'm Trent, and I run Toon Theory; an animation studio based in the UK. We use hand-drawn animations to help businesses get their message across. It's a simple way to cut through noise, especially in B2B, thought leadership, and data-driven education.\n\nFor Vitamink12, I think there could be a great opportunity to use visual storytelling to help more people “get it” faster. Our animations are fully done-for-you: script, illustrations, voice, and storyboard; so you can use them for:\n\n• Explaining the benefits of virtual hiring events to school administrators\n• Demonstrating how custom talent engagement experiences can improve hiring outcomes\n• Showing educators how to navigate new software and systems\n\nThese animations don’t just explain, they convert; Many of our past clients see a big lift in engagement, trust, and sales.\n\nI'd be happy to draft a ten-second demo around something core to your brand. Totally low-lift, just keen to explore what this could look like with Vitamink12's voice behind it.\n\nIf you're open to chatting more, just hit reply. And if you're curious, there’s a site link in my signature with a few past examples.\n\nKeep doing what you do, it's making an impact.\n\nAll the best,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Hello there Chris,\n\nI wanted to check back in and remind you about the offer I shared earlier; a 10 second sketch that could spark some ideas.\n\nIt’s a simple, no-strings way to explore how animation can support your Vitamink12's messaging and help your audience understand your value offerings more clearly.\n\nFeel free to reply if you want to see this, or browse some of our previous projects linked in my signature.\n\nCheers,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Hey there Chris,\n\nI wanted to reach out once more to highlight the potential benefits of whiteboard animation for Vitamink12.\n\nWhether it’s for sales, marketing, onboarding, or internal messaging, animation can be a great tool to simplify ideas and keep people interested.\n\nIf you’re curious, I’d be happy to create a short sample or script that fits your goals.\n\nPlease reply whenever you’re ready. Past projects are linked in my signature.\n\nWarm regards,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175190614747.1937.14031829214781918098@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "no reply",
  "initial time": "17:35",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
{
  "business name": "Incentive Services",
  "website url": "https://incentiveservices.com/",
  "location": "Edina, MN 55439",
  "industry": "Human Resources",
  "first name": "Joseph",
  "middle name": "G",
  "last name": "Cronin",
  "title": "Owner",
  "email": "joseph@incentiveservices.com",
  "web copy": "Homepage - Incentive Services WHAT WE DO We motivate behavior change, reinforce performance achievement, and encourage organizational engagement and loyalty. READ MORE We motivate behavior change, reinforce performance achievement, and encourage organizational engagement and loyalty. WHAT WE DO READ MORE WHAT WE DO We motivate behavior change, reinforce performance achievement, and encourage organizational engagement and loyalty. READ MORE Incentive Services exists to help organizations MAXIMIZE THE PERFORMANCE OF PEOPLE through the use of incentives and recognition. OUR GOAL Our number one goal is to help organizations maximize on their investments in people through the proper management of incentives and recognition. We strive to deliver memorable reward experiences to recipients around the world. 84 % 84% of U.S. Businesses use non-cash incentives and recognition, including travel, merchandise, gift cards, and award points. $ 176 Billion U.S. Businesses invest $176 billion per year on non-cash incentives and recognition. 49 % The non-cash incentives market has grown 49% since 2016. Annually, we manage thousands of Incentive & Recognition Programs and fulfill millions of non-cash incentive rewards. We re in a great business because we spend our time working with our client partners, helping them motivate their people to maximize their potential. We are excited about what people can accomplish when properly motivated and recognized. Joe Cronin, President & CEO Joe s Welcome Video This site uses cookies. By continuing to browse the site, you are agreeing to our use of cookies. Accept All Cookie Preferences Cookie and Privacy Settings How we use cookies We may request cookies to be set on your device. We use cookies to let us know when you visit our websites, how you interact with us, to enrich your user experience, and to customize your relationship with our website. Click on the different category headings to find out more. You can also change some of your preferences. Note that blocking some types of cookies may impact your experience on our websites and the services we are able to offer. Essential Website Cookies These cookies are strictly necessary to provide you with services available through our website and to use some of its features. Because these cookies are strictly necessary to deliver the website, refusing them will have impact how our site functions. You always can block or delete cookies by changing your browser settings and force blocking all cookies on this website. But this will always prompt you to accept/refuse cookies when revisiting our site. We fully respect if you want to refuse cookies but to avoid asking you again and again kindly allow us to store a cookie for that. You are free to opt out any time or opt in for other cookies to get a better experience. If you refuse cookies we will remove all set cookies in our domain. We provide you with a list of stored cookies on your computer in our domain so you can check what we stored. Due to security reasons we are not able to show or modify cookies from other domains. You can check these in your browser security settings. Check to enable permanent hiding of message bar and refuse all cookies if you do not opt in. We need 2 cookies to store this setting. Otherwise you will be prompted again when opening a new browser window or new a tab. Click to enable/disable essential site cookies. Google Analytics Cookies These cookies collect information that is used either in aggregate form to help us understand how our website is being used or how effective our marketing campaigns are, or to help us customize our website and application for you in order to enhance your experience. If you do not want that we track your visit to our site you can disable tracking in your browser here: Click to enable/disable Google Analytics tracking. Other external services We also use different external services like Google Webfonts, Google Maps, and external Video providers. Since these providers may collect personal data like your IP address we allow you to block them here. Please be aware that this might heavily reduce the functionality and appearance of our site. Changes will take effect once you reload the page. Google Webfont Settings: Click to enable/disable Google Webfonts. Google Map Settings: Click to enable/disable Google Maps. Google reCaptcha Settings: Click to enable/disable Google reCaptcha. Vimeo and Youtube video embeds: Click to enable/disable video embeds. Other cookies The following cookies are also needed - You can choose if you want to allow them: Click to enable/disable _ga - Google Analytics Cookie. Click to enable/disable _gid - Google Analytics Cookie. Click to enable/disable _gat_* - Google Analytics Cookie. Privacy Policy You can read about our cookies and privacy settings in detail on our Privacy Policy Page. Privacy Policy Accept settings Opt-out Scroll to top Homepage - Incentive Services WHAT WE DO We motivate behavior change, reinforce performance achievement, and encourage organizational engagement and loyalty. READ MORE We motivate behavior change, reinforce performance achievement, and encourage organizational engagement and loyalty. WHAT WE DO READ MORE WHAT WE DO We motivate behavior change, reinforce performance achievement, and encourage organizational engagement and loyalty. READ MORE Incentive Services exists to help organizations MAXIMIZE THE PERFORMANCE OF PEOPLE through the use of incentives and recognition. OUR GOAL Our number one goal is to help organizations maximize on their investments in people through the proper management of incentives and recognition. We strive to deliver memorable reward experiences to recipients around the world. 84 % 84% of U.S. Businesses use non-cash incentives and recognition, including travel, merchandise, gift cards, and award points. $ 176 Billion U.S. Businesses invest $176 billion per year on non-cash incentives and recognition. 49 % The non-cash incentives market has grown 49% since 2016. Annually, we manage thousands of Incentive & Recognition Programs and fulfill millions of non-cash incentive rewards. We re in a great business because we spend our time working with our client partners, helping them motivate their people to maximize their potential. We are excited about what people can accomplish when properly motivated and recognized. Joe Cronin, President & CEO Joe s Welcome Video This site uses cookies. By continuing to browse the site, you are agreeing to our use of cookies. Accept All Cookie Preferences Cookie and Privacy Settings How we use cookies We may request cookies to be set on your device. We use cookies to let us know when you visit our websites, how you interact with us, to enrich your user experience, and to customize your relationship with our website. Click on the different category headings to find out more. You can also change some of your preferences. Note that blocking some types of cookies may impact your experience on our websites and the services we are able to offer. Essential Website Cookies These cookies are strictly necessary to provide you with services available through our website and to use some of its features. Because these cookies are strictly necessary to deliver the website, refusing them will have impact how our site functions. You always can block or delete cookies by changing your browser settings and force blocking all cookies on this website. But this will always prompt you to accept/refuse cookies when revisiting our site. We fully respect if you want to refuse cookies but to avoid asking you again and again kindly allow us to store a cookie for that. You are free to opt out any time or opt in for other cookies to get a better experience. If you refuse cookies we will remove all set cookies in our domain. We provide you with a list of stored cookies on your computer in our domain so you can check what we stored. Due to security reasons we are not able to show or modify cookies from other domains. You can check these in your browser security settings. Check to enable permanent hiding of message bar and refuse all cookies if you do not opt in. We need 2 cookies to store this setting. Otherwise you will be prompted again when opening a new browser window or new a tab. Click to enable/disable essential site cookies. Google Analytics Cookies These cookies collect information that is used either in aggregate form to help us understand how our website is being used or how effective our marketing campaigns are, or to help us customize our website and application for you in order to enhance your experience. If you do not want that we track your visit to our site you can disable tracking in your browser here: Click to enable/disable Google Analytics tracking. Other external services We also use different external services like Google Webfonts, Google Maps, and external Video providers. Since these providers may collect personal data like your IP address we allow you to block them here. Please be aware that this might heavily reduce the functionality and appearance of our site. Changes will take effect once you reload the page. Google Webfont Settings: Click to enable/disable Google Webfonts. Google Map Settings: Click to enable/disable Google Maps. Google reCaptcha Settings: Click to enable/disable Google reCaptcha. Vimeo and Youtube video embeds: Click to enable/disable video embeds. Other cookies The following cookies are also needed - You can choose if you want to allow them: Click to enable/disable _ga - Google Analytics Cookie. Click to enable/disable _gid - Google Analytics Cookie. Click to enable/disable _gat_* - Google Analytics Cookie. Privacy Policy You can read about our cookies and privacy settings in detail on our Privacy Policy Page. Privacy Policy Accept settings Opt-out Scroll to top our-story - Incentive Services OUR STORY In 1981, Joe Cronin had an idea for a performance marketing agency focused on obtaining positive, conclusive resu",
  "use cases": "Showing how to redeem award points for travel incentives | Explaining the benefits of non-cash incentive rewards | Demonstrating how to customize merchandise incentives for employees",
  "services": "Incentive & Recognition Programs | Non-cash incentive rewards | Travel incentives | Merchandise incentives | Gift card incentives | Award points incentives",
  "email 1": "Hey Joseph,\n\nI came across Incentive Services recently and thought I’d drop you a quick note.\n\nI'm Trent. I run Toon Theory, a whiteboard animation studio in the UK. We make simple, animated explainer videos that help people understand dense ideas. They're great for B2B services, thought leadership, and data-driven education.\n\nIncentive Services has a strong foundation, and a short animated video could be a powerful way to bring your message to life. We’ll take care of the full creative lift: script, voice, and illustrations, so you can use it for:\n\n• Showing how to redeem award points for travel incentives\n• Demonstrating how to customize merchandise incentives for employees\n• Explaining the benefits of non-cash incentive rewards\n\nClients often tell us these pieces help reduce bloat, increase clarity, and lead to more meaningful conversions.\n\nI’d be glad to pull together a short demo; maybe a script or quick sketch; based on what Incentive Services does best. No pressure, just a chance to preview what it might look and sound like.\n\nJust reach out if you’d like to continue the conversation. You’ll find a few previous projects linked in the signature below.\n\nThanks for putting something refreshing out there.\n\nKind regards,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Hey Joseph,\n\nI know inboxes get full fast, so here's a quick follow up.\n\nWhiteboard storytelling might be a surprisingly effective way for Incentive Services to simplify something your audience or team needs to grasp quickly.\n\nIf you’re still open to it, I can send a short demo such as a sample script or 10-second sketch, just to give you a feel.\n\nLet me know, or feel free to check out some of our past work in the signature.\n\nRespectfully,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Hey Joseph,\n\nJust wanted to follow up to see if you’ve had a chance to consider using whiteboard animation at Incentive Services.\n\nIt’s a creative way to bring your ideas to life and connect with your audience more effectively.\n\nIf you’re interested, I’d be happy to share a quick demo or script tailored to your needs.\n\nYou’ll find past examples linked in my signature. Reply whenever you’re ready.\n\nTake care,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175190663568.1965.14467694342634802931@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "no reply",
  "initial time": "17:42",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
{
  "business name": "Wilson Learning Corporation",
  "website url": "https://www.wilsonlearning.com/",
  "location": "Edina, MN 55439",
  "industry": "Human Resources",
  "first name": "Ed",
  "middle name": "",
  "last name": "Emde",
  "title": "President",
  "email": "ed.emde@wilsonlearning.com",
  "web copy": "Global Sales Development & Leadership Training Programs | Wilson Learning Drive Tangible Results & Measurable Benefits Achieve Undeniable Results with Award Winning Global Sales Development & Leadership Programs Wilson Learning's Core Capabilities Accelerating Salesforce Effectiveness How s your current win rate? Deal size? Pipeline health? Do you have consistency in your sales process? Do your managers act as coaches? We meet you where you are to provide sales effectiveness solutions that your sales organization can scale and sustain. We bring clarity to complex selling environments and use well-researched methods to foster behavior changes that produce undeniable sales results. Improve Your Sales Effectiveness Developing Vibrant, Vital Leaders at All Levels Do you have a revolving door of leaders exiting the workforce? Are your current and next generation leaders equipped to lead in times of unprecedented challenge and change? Our global leadership development solutions transform the whole leader by mastering the key attitudes, skills, and knowledge needed to grow, develop, and create success individually, within a team, and for your organization. Improve Your Leadership s Effectiveness 14,000+ Lives Touched Each Month 225 Consultants Globally 30 Languages 50 Countries 59 Years in Sales & Leadership Development 14,000+ Lives Touched Each Month 225 Consultants Globally 30 Languages 50 Countries 59 Years in Sales & Leadership Development Transform Challenges into Opportunities with Our Core Capabilities We partner with you to bring about real behavioral change that is sustainable and measurable. Let us help you overcome your biggest challenge with our Core Capabilities. Know More Align your L&D Strategy to Business Outcomes Nobody needs training, but everyone needs the outcomes of training. See how our best-in-class learning services have helped organizations like yours achieve better business results. Through our global capabilities, comprehensive professional services, and game-changing partnership experiences, Wilson Learning can align your learning and development strategy to the business outcomes you are looking to achieve. Are you ready to drive performance improvement and achieve business results? Wilson Learning is here to help. Contact Us Wilson Learning's Flexible, Intentional Approach Your Success Assurance Our success assurance lies in our world-class intellectual property, our top-notch learning services capabilities, and our ironclad approach to global and local implementation. Together, we drive for and achieve undeniable results. World-Class Content Our programs are built on decades of research and industry expertise, ensuring high-impact learning that s practical, relevant, and aligned with real-world business needs. Leverage State-of-the-Art Technology We integrate the latest digital tools and learning platforms to enhance engagement, making development accessible anytime, anywhere, with seamless learning experiences. Award-Winning Implementation Process Our proven approach ensures smooth integration with your organization s strategy and culture, providing support at every step for sustained behavior change and long-term impact. Measurable & Tangible Results We don t stop at learning we track performance metrics to demonstrate clear business outcomes, ensuring your investment delivers measurable growth and value. Sales Development Solutions Building Strategic Sales Performance High, Wide, Deep Harnessing strategic sales capability depends on effective salespeople, skilled coaches, proven processes, and responsive tools. Wilson Learning combines our proven sales methodologies and learning expertise with a world-class sales development portfolio to enable us to respond quickly with a solution that fits your specific needs. Our award-winning industry success and demonstrated ability to produce business impact can give you confidence that the service we provide will drive long-term, sustainable, undeniable sales results. Reaching Sales Goals + Creating Business Impact Related Challenges Achieve Revenue Targets Build a Healthy and Accurate Pipeline Increase Customer Retention and Growth Accelerate Customer Business Results Develop and Refine Consultative Selling Skills Develop Effective Sales Coaching Sales Resources Article The ABCs of Sales Coaching Read More Blog Can Your Sales Managers Answer the Critical Questions Burning in the Minds of Salespeople? Read More Blog Are your sales managers adding value? Read More Only 25% of Salespeople Sell to Value: Make Your Sales Team Part of the 25% Read More Sales Methodology as the Force Multiplier Read More Explore More Leadership Training Solutions Developing Successful Leaders at All Levels Leadership has the greatest opportunity to influence the energy and engagement of any organization. Leaders either put energy into or take energy out of the organization. The challenge for L&D professionals is to design and deliver leadership development solutions across all levels of leadership that are consistent and tailored to the unique challenges leaders face at the first-level, mid-level, and even the executive level. We are committed to providing leadership development solutions at all levels that transform the whole leader by mastering the key attitudes, skills, and knowledge needed now to grow, develop, and create success individually, within a team, and for your organization. Increasing Leadership Effectiveness Related Challenges Preparing New Future-Ready Leaders Mastering Effective Communication, Versatility, and Conflict Management Skills Creating Employee Engagement Coaching and Motivating a Diverse Workforce Leading Change and Increasing Organizational Resiliency Leadership Resources Blog Is There a Crisis of Leadership? Read More Article Solving Your Leadership Gap Read More Adapting Leadership Development During Today s Challenging Times Read More Article Leadership as the Catalytic Force Behind Workforce Reengagement Read More White Paper A Leadership Development Approach Read More Explore More Our Success Stories 13% Improvement In Behaviors Helped This Telecom Giant Break Free From Transactional Retail Patterns Read More New Sales Leader s Creative Approach to Sales Training Wins the Day Read More Major Investment and Insurance Company Realizes 120% Sales Increase as a Result of Consultative Sales Methodology Read More Strategic Negotiation Training Drove Over 50% Productivity Gains For This Manufacturer Read More Global Airline Attributes 27% of Revenue to The Counselor Salesperson Read More Game-Changing Selling Skills Result in Record Wins and Increased Sales for Aviation Tracking Solutions Provider Read More View All Success Stories Testimonials This program is a truly special experience reserved and designed for our best. CEO Wilson Learning is often my team s benchmark by which I evaluate other vendors. And I can genuinely say that they remain the top ranked within my team. Director of Leadership Development & Wellness We think this training is so important that all of our adjusters around the world have completed some version of Social Styles. VP of Claims 100% of participants agreed that their teams display more support and respect for each other, now placing a higher value on each member s talents and contributions. A fantastic approach to facilitating a training, unlike anything I ve ever experienced before. VP of Sales An account manager used her new skills to close a local account worth $400K! She gained an understanding of her customer s organizational value and leveraged it. Sales Manager Wilson Learning is one of the best trainings we have ever attended. Director of Sales Enablement Awards View all Awards Talk to an Expert View all Locations Sign Up to Receive Leading Edge Thinking, Trends, Topics & Tips Sign Up Capabilities Leadership Services & Programs Sales Programs & Services Wilson Learning Counselor Wilson Learning Versatile Communications Wilson Learning Negotiation & Influence Wilson Learning Integrated Leadership Results Customer Success Stories Wilson Learning Awards Resources Articles Blogs Books e-Books Press Releases Research Papers White Papers Events Workshops Conferences Webinars About Us Who We Are Our Leadership Team Our Strategic Partners Awards & Recognition Global Presence Careers Resource Center 2025 Wilson Learning Worldwide Inc. Privacy Legal Global Sales Development & Leadership Training Programs | Wilson Learning Drive Tangible Results & Measurable Benefits Achieve Undeniable Results with Award Winning Global Sales Development & Leadership Programs Wilson Learning's Core Capabilities Accelerating Salesforce Effectiveness How s your current win rate? Deal size? Pipeline health? Do you have consistency in your sales process? Do your managers act as coaches? We meet you where you are to provide sales effectiveness solutions that your sales organization can scale and sustain. We bring clarity to complex selling environments and use well-researched methods to foster behavior changes that produce undeniable sales results. Improve Your Sales Effectiveness Developing Vibrant, Vital Leaders at All Levels Do you have a revolving door of leaders exiting the workforce? Are your current and next generation leaders equipped to lead in times of unprecedented challenge and change? Our global leadership development solutions transform the whole leader by mastering the key attitudes, skills, and knowledge needed to grow, develop, and create success individually, within a team, and for your organization. Improve Your Leadership s Effectiveness 14,000+ Lives Touched Each Month 225 Consultants Globally 30 Languages 50 Countries 59 Years in Sales & Leadership Development 14,000+ Lives Touched Each Month 225 Consultants Globally 30 Languages 50 Countries 59 Years in Sales & Leadership Development Transform Challenges into Opportunities with Our Core Capabilities We partner with you to bring about real behavioral change that",
  "use cases": "| Demonstrating how to build strategic sales performance through high, wide, deep sales methodology | | | Explaining the benefits of leadership training solutions for developing successful leaders | | | Walking through the Wilson Learning Negotiation & Influence process to increase sales effectiveness",
  "services": "Sales Development Solutions | Building Strategic Sales Performance | High, Wide, Deep | Sales Methodology | Leadership Training Solutions | Developing Successful Leaders at All Levels | Increasing Leadership Effectiveness | Wilson Learning Counselor | Wilson Learning Versatile Communications | Wilson Learning Negotiation & Influence | Wilson Learning Integrated Leadership Results",
  "email 1": "Hey Ed,\n\nI came across Wilson Learning Corporation recently and thought I’d drop you a quick note.\n\nI'm Trent, and I run Toon Theory; an animation studio based in the UK. We use hand-drawn animations to help businesses get their message across. It's a simple way to cut through noise, especially in B2B, thought leadership, and data-driven education.\n\nI think Wilson Learning Corporation could really benefit from using visual storytelling to explain things faster and make them stick. We take care of everything: scripting, illustration, voiceover and storyboarding; so you can use the final video for:\n\n• Explaining the benefits of leadership training solutions for developing successful leaders\n• Walking through the Wilson Learning Negotiation & Influence process to increase sales effectiveness\n• Demonstrating how to build strategic sales performance through high, wide, deep sales methodology\n\nWhether it’s more signups, better retention, or faster understanding, these animations know how to hit hard. And they move the needle where it counts.\n\nI’d love to put together a quick concept; maybe a script or a short teaser; around one of your key offerings. No strings, just a preview of what's possible with Wilson Learning Corporation's voice behind it.\n\nAlways open to a quick chat if this feels worth exploring. In the meantime, you can view a few past projects via the link in my signature.\n\nKeep doing what you do, it's making an impact.\n\nSincerely,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Howdy Ed,\n\nFollowing up on my previous note about whiteboard animation at Wilson Learning Corporation.\n\nMany of our clients find these videos help explain their offerings faster and more clearly, which often leads to more meaningful conversations and better results.\n\nIf it’s helpful, I’d be happy to draft a quick concept or short sample that fits your brand voice and messaging.\n\nYou can reply anytime, and our portfolio is linked below if you want to get a feel for what we do.\n\nTake care,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Hi there Ed,\n\nJust wanted to reconnect in case my previous notes got buried. If you have any questions or thoughts about using whiteboard animation at Wilson Learning Corporation, I'd be more than happy to answer them..\n\nIt’s a creative way to explain your value offerings, and it can really help with marketing, training, or internal communications.\n\nIf you’d like, I can send over a quick teaser or script sample.\n\nYou’ll find some of our past work in my signature. I’m here if you want to chat.\n\nRespectfully,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175190716465.1931.5584820108960752857@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "no reply",
  "initial time": "17:51",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
{
  "business name": "Encompass Employment",
  "website url": "https://www.encompassemployment.com/",
  "location": "Heights, MN 55127",
  "industry": "Human Resources, Employment Agencies",
  "first name": "Wayne",
  "middle name": "",
  "last name": "Juds",
  "title": "President",
  "email": "wayne@encompassemployment.com",
  "web copy": "Encompass Employment Inc in Vadnais Heights, MN is an employment agency. Welcome to Encompass Employment, Inc. Empowering Your Business Encompass Employment, Inc. works with companies and clients to find permanent employment solutions. We empower businesses with our talented and efficient workforce. Our expert team of recruiters does exhaustive screening on candidates to eliminate fraud profiles. We have been providing professional human resources services to corporations and prospective employees in Minneapolis, St. Paul and surrounding areas for over 15 years. Whether you are a company looking for the right person to maximize productivity or a candidate looking for the right job to maximize your potential , we can help. Need Perfect Workforce? Call Us! When you need competent, smart workers for the growth of your business or any type of human resources assistance, contact Encompass Employment, Inc. Content, including images, displayed on this website is protected by copyright laws. Downloading, republication, retransmission or reproduction of content on this website is strictly prohibited. Terms of Use | Privacy Policy Share by: Encompass Employment Inc in Vadnais Heights, MN is an employment agency. Welcome to Encompass Employment, Inc. Empowering Your Business Encompass Employment, Inc. works with companies and clients to find permanent employment solutions. We empower businesses with our talented and efficient workforce. Our expert team of recruiters does exhaustive screening on candidates to eliminate fraud profiles. We have been providing professional human resources services to corporations and prospective employees in Minneapolis, St. Paul and surrounding areas for over 15 years. Whether you are a company looking for the right person to maximize productivity or a candidate looking for the right job to maximize your potential , we can help. Need Perfect Workforce? Call Us! When you need competent, smart workers for the growth of your business or any type of human resources assistance, contact Encompass Employment, Inc. Content, including images, displayed on this website is protected by copyright laws. Downloading, republication, retransmission or reproduction of content on this website is strictly prohibited. Terms of Use | Privacy Policy Share by: Encompass Employment Inc in Vadnais Heights, MN is as a full service Employment Agency. About Us About Encompass Employment, Inc. An Exciting Career Awaits Encompass Employment, Inc. started in 1997 as a full- service employment agency with the goal of meeting our clients employment and human resource needs in a personal and cost-effective manner. When developing business relationships of any nature, we strive to build a long-lasting and successful partnership with honesty and integrity . We give you avenues to showcase your skills and talent in private and public sectors . With Encompass Employment, Inc. as your partner, you can make your dream career a reality. Our locally owned business is licensed and fully insured for your protection. Looking for a Bright Career? Contact Us! If you are looking for career that complements your interest and expertise, then email us your resume. We will be happy to help you. Content, including images, displayed on this website is protected by copyright laws. Downloading, republication, retransmission or reproduction of content on this website is strictly prohibited. Terms of Use | Privacy Policy Share by: Encompass Employment Inc in Vadnais Heights, MN provides complete employment services. Services Complete Employment Services When you come to Encompass Employment, Inc., you will receive complete employment services . Our knowledgeable staffing experts will find the perfect fit for whatever you need. Whether you re looking for a job or in need of an employee, we are here to help. Our human resource services include: Affirmative Action Contract Employment Employee Assistance Programs Employee Screening Human Resource Consulting / Outsourcing Labor Relations Payrolling Permanent Placement Recruitment Staffing Workforce Management Workers Compensation Management We specialize in the following full-time employment services: Administrative Employment Services Creative Employment Services Executive Employment Services Food Services Employment Services Hospitality Employment Services Industrial Employment Services Sales Employment Services Technology Employment Services Call for the Best in Staffing We are here to meet all your staffing needs. Call us today. Content, including images, displayed on this website is protected by copyright laws. Downloading, republication, retransmission or reproduction of content on this website is strictly prohibited. Terms of Use | Privacy Policy Share by: Call Encompass Employment Inc in Vadnais Heights, MN to hire the best workforce. Contact Contact Encompass Employment, Inc. Talent Meets Opportunity Thank you for visiting the online home of Encompass Employment, Inc. We offer expert employment services to let talented professionals explore the right opportunities . Call us to get hired by the best businesses or hire the best workforce. Encompass Employment, Inc. Vadnais Heights, MN Phone: (651) 482-7599 Fax: (651) 482-7913 Email wayne@encompassemployment.com Hours of Operation Monday to Friday 8:00 AM - 4:30 PM Saturday and Sunday Closed Areas Served Minneapolis, MN (Metro) St Paul, MN (Metro) Content, including images, displayed on this website is protected by copyright laws. Downloading, republication, retransmission or reproduction of content on this website is strictly prohibited. Terms of Use | Privacy Policy Share by:",
  "use cases": "| Explaining the benefits of outsourcing human resource functions | Demonstrating the employee screening process | Walking through the steps of affirmative action compliance |",
  "services": "Affirmative Action | Contract Employment | Employee Assistance Programs | Employee Screening | Human Resource Consulting / Outsourcing | Labor Relations | Payrolling | Permanent Placement | Recruitment | Staffing | Workforce Management | Workers Compensation Management | Administrative Employment Services | Creative Employment Services | Executive Employment Services | Food Services Employment Services | Hospitality Employment Services | Industrial Employment Services | Sales Employment Services | Technology Employment Services",
  "email 1": "Hi Wayne,\n\nI came across Encompass Employment recently and thought there could be an opportunity to collaborate.\n\nI'm Trent. I run Toon Theory, a whiteboard animation studio in the UK. We make simple, animated explainer videos that help people understand dense ideas. They're great for B2B services, thought leadership, and data-driven education.\n\nEncompass Employment has a strong foundation, and a short animated video could be a powerful way to bring your message to life. We’ll take care of the full creative lift: script, voice, and illustrations, so you can use it for:\n\n• Demonstrating the employee screening process\n• Explaining the benefits of outsourcing human resource functions\n• Walking through the steps of affirmative action compliance\n\nThese animations don’t just explain, they convert; Many of our past clients see a big lift in engagement, trust, and sales.\n\nHow about a quick sample built around Encompass Employment's strengths? Ten seconds or so, no strings, no commitments. Just a feeler to see what resonates.\n\nI’d be happy to chat if you’re interested. Just reply anytime, and feel free to check out some of our work through the link in my signature.\n\nThanks for putting something refreshing out there.\n\nKind regards,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Greetings Wayne,\n\nQuick follow-up in case now’s a better time. My last email was about how visual storytelling could support Encompass Employment's messaging for doubled impact.\n\nIf you're curious, I could create a ten-second teaser or a rough script so you can get a sense of what’s possible.\n\nJust reply if you’d like to explore. There’s a link to some of our previous work in the signature below.\n\nWith appreciation,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Howdy Wayne,\n\nI am still happy to share a quick sketch or demo if it is helpful. Many of our clients use animation to break down services, explain strategy, or walk users through dashboards and pages.\n\nIf Encompass Employment has anything you are trying to simplify, I would love to help you explore it. Just reply if you want me to send something over.\n\nYou will also find examples of past work linked in my signature below.\n\nBest wishes,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175190787801.1937.2742049006523305408@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "no reply",
  "initial time": "18:03",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
{
  "business name": "Deep See Consultants",
  "website url": "https://www.deepseeconsulting.com/",
  "location": "Paul, MN 55129",
  "industry": "Human Resources",
  "first name": "Sara",
  "middle name": "",
  "last name": "Taylor",
  "title": "President",
  "email": "sara@deepseeconsulting.com",
  "web copy": "deepSEE Consulting Changing the world through the workplace Cultural Competence | Diversity & Inclusion Our expertise goes deep and wide. We can offer the right mix of diversity training to meet your needs, and build a highly customized solution that is exactly right for your people and organization. Effective Training Let us guide your team towards a more inclusive and diverse workplace through our comprehensive training programs. In nature, systems that don t diversify, die. It s that simple. Understanding diversity, however, can often seem difficult it s hard to tell where the subject begins and ends. Simply put, it begins with you and ends with the world. That s easy to say, maybe even glib, so what does it really mean? deepSEE will show you that getting a handle on the diversity of others means first understanding your own diversity; that seeing yourself helps you to actually see others, to listen to them, to communicate with them a sure recipe for life. Customized Solutions With a focus on cultural competence, our solutions are tailored to your unique requirements and goals. We know that any leadership and diversity initiative must have measurable results. deepSEE s customized solutions are carefully planned with our clients as partners to ensure that any and all work that is engaged will achieve desired outcomes. We design and implement only those solutions that will meet your specific needs. Leadership Leadership demands an entirely different skill-set than even just a generation ago. For modern organizations to be successful, they need to be sure that their leadership can tackle issues and challenges resulting from an ever-increasing global and diverse work environment. We Help You See Real Results When navigating through differences and adapting to change in the workplace, deepSEE Consulting is the right resource at the right time. Improvable Cultural Competence Not only is Cultural Competence measurable, it s improvable. Our proven tools, theories, frameworks and approach have reduced the time needed to see change by 75%--from an industry standard of 40 hours down to just nine. We know what works. (Read more) Strategy Development For Thompson Reuters, deepSEE created a scalable, replicable leadership development process that could be used globally throughout the organization. (Read more) Needs Assessment We know that any leadership and diversity initiative must have measurable results. deepSEE s customized solutions are carefully planned with our clients as partners to ensure that any and all work that is engaged will achieve desired outcomes. We design and implement only those solutions that will meet your specific needs. (Read more) Executive Coaching deepSEE is not about your typical \"blame and shame\" diversity training that has arguably deserved a bad rap over the years. We enable individuals and organizations to see beyond the surface, to see clearly for themselves the rich opportunities and challenges of today s multigenerational, multicultural workplace and the new competencies that today s leaders require. (Read more) 600% Diverse Hiring With diverse hiring stubbornly stuck at just 6%, our client implemented deepSEE's Cultural Competence and Unconscious Bias program for hiring managers, reviewed and modified their hiring process and increased the rate of successful diverse hires to 36%. (Read more) Asynchronous Training and eLearning Outerwall had just begun D&I work yet there wasn t an awareness of that work or of D&I concepts throughout the organization. Yet, with a remote and distributed workforce, achieving a consistent understanding of D&I posed a difficult task. (Read more) deepSEE Consulting Changing the world through the workplace Cultural Competence | Diversity & Inclusion Our expertise goes deep and wide. We can offer the right mix of diversity training to meet your needs, and build a highly customized solution that is exactly right for your people and organization. Effective Training Let us guide your team towards a more inclusive and diverse workplace through our comprehensive training programs. In nature, systems that don t diversify, die. It s that simple. Understanding diversity, however, can often seem difficult it s hard to tell where the subject begins and ends. Simply put, it begins with you and ends with the world. That s easy to say, maybe even glib, so what does it really mean? deepSEE will show you that getting a handle on the diversity of others means first understanding your own diversity; that seeing yourself helps you to actually see others, to listen to them, to communicate with them a sure recipe for life. Customized Solutions With a focus on cultural competence, our solutions are tailored to your unique requirements and goals. We know that any leadership and diversity initiative must have measurable results. deepSEE s customized solutions are carefully planned with our clients as partners to ensure that any and all work that is engaged will achieve desired outcomes. We design and implement only those solutions that will meet your specific needs. Leadership Leadership demands an entirely different skill-set than even just a generation ago. For modern organizations to be successful, they need to be sure that their leadership can tackle issues and challenges resulting from an ever-increasing global and diverse work environment. We Help You See Real Results When navigating through differences and adapting to change in the workplace, deepSEE Consulting is the right resource at the right time. Improvable Cultural Competence Not only is Cultural Competence measurable, it s improvable. Our proven tools, theories, frameworks and approach have reduced the time needed to see change by 75%--from an industry standard of 40 hours down to just nine. We know what works. (Read more) Strategy Development For Thompson Reuters, deepSEE created a scalable, replicable leadership development process that could be used globally throughout the organization. (Read more) Needs Assessment We know that any leadership and diversity initiative must have measurable results. deepSEE s customized solutions are carefully planned with our clients as partners to ensure that any and all work that is engaged will achieve desired outcomes. We design and implement only those solutions that will meet your specific needs. (Read more) Executive Coaching deepSEE is not about your typical \"blame and shame\" diversity training that has arguably deserved a bad rap over the years. We enable individuals and organizations to see beyond the surface, to see clearly for themselves the rich opportunities and challenges of today s multigenerational, multicultural workplace and the new competencies that today s leaders require. (Read more) 600% Diverse Hiring With diverse hiring stubbornly stuck at just 6%, our client implemented deepSEE's Cultural Competence and Unconscious Bias program for hiring managers, reviewed and modified their hiring process and increased the rate of successful diverse hires to 36%. (Read more) Asynchronous Training and eLearning Outerwall had just begun D&I work yet there wasn t an awareness of that work or of D&I concepts throughout the organization. Yet, with a remote and distributed workforce, achieving a consistent understanding of D&I posed a difficult task. (Read more) deepSEE Consulting Changing the world through the workplace Cultural Competence | Diversity & Inclusion Our expertise goes deep and wide. We can offer the right mix of diversity training to meet your needs, and build a highly customized solution that is exactly right for your people and organization. Effective Training Let us guide your team towards a more inclusive and diverse workplace through our comprehensive training programs. In nature, systems that don t diversify, die. It s that simple. Understanding diversity, however, can often seem difficult it s hard to tell where the subject begins and ends. Simply put, it begins with you and ends with the world. That s easy to say, maybe even glib, so what does it really mean? deepSEE will show you that getting a handle on the diversity of others means first understanding your own diversity; that seeing yourself helps you to actually see others, to listen to them, to communicate with them a sure recipe for life. Customized Solutions With a focus on cultural competence, our solutions are tailored to your unique requirements and goals. We know that any leadership and diversity initiative must have measurable results. deepSEE s customized solutions are carefully planned with our clients as partners to ensure that any and all work that is engaged will achieve desired outcomes. We design and implement only those solutions that will meet your specific needs. Leadership Leadership demands an entirely different skill-set than even just a generation ago. For modern organizations to be successful, they need to be sure that their leadership can tackle issues and challenges resulting from an ever-increasing global and diverse work environment. We Help You See Real Results When navigating through differences and adapting to change in the workplace, deepSEE Consulting is the right resource at the right time. Improvable Cultural Competence Not only is Cultural Competence measurable, it s improvable. Our proven tools, theories, frameworks and approach have reduced the time needed to see change by 75%--from an industry standard of 40 hours down to just nine. We know what works. (Read more) Strategy Development For Thompson Reuters, deepSEE created a scalable, replicable leadership development process that could be used globally throughout the organization. (Read more) Needs Assessment We know that any leadership and diversity initiative must have measurable results. deepSEE s customized solutions are carefully planned with our clients as partners to ensure that any and all work that is engaged will achieve desired outcomes. We design and implement only those solutions that will meet your sp",
  "use cases": "Showing how diversity training improves workplace culture | Explaining the benefits of customized leadership development solutions | Demonstrating how asynchronous training increases employee engagement",
  "services": "Diversity training | Effective Training | Customized Solutions | Leadership | Improvable Cultural Competence | Strategy Development | Needs Assessment | Executive Coaching | 600% Diverse Hiring | Asynchronous Training and eLearning",
  "email 1": "Hi Sara,\n\nI stumbled across Deep See Consultants and thought I’d reach out.\n\nI'm Trent, and I run Toon Theory; an animation studio based in the UK. We make whiteboard videos that break down complex ideas with simple, hand-drawn visuals. It’s perfect for B2B, thought leadership, and data-driven education.\n\nFor Deep See Consultants, I think there could be a great opportunity to use visual storytelling to help more people “get it” faster. Our animations are fully done-for-you: script, illustrations, voice, and storyboard; so you can use them for:\n\n• Explaining the benefits of customized leadership development solutions\n• Demonstrating how asynchronous training increases employee engagement\n• Showing how diversity training improves workplace culture\n\nClients often tell us these pieces help reduce bloat, increase clarity, and lead to more meaningful conversions.\n\nI could pull together a quick sketch or sample script based on one of Deep See Consultants’s core offerings. Just a lightweight preview, no expectations; just to show what’s possible.\n\nIf you’re curious about what this might look like, just reach out. There’s a link in my signature with a few examples you can check out, too.\n\nThanks for leading with both heart and strategy.\n\nAll the best,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Hello Sara,\n\nI didn’t want to leave things hanging without checking in. I mentioned how whiteboard animation can be a strong complement to what Deep See Consultants is already doing, especially when you’re communicating ideas that needs a touch of individuality.\n\nIf it’s helpful, I can pull together a short visual sketch or sample script based on one of your key offerings.\n\nNo pressure; just a creative starting point for you to consider.\n\nYou’ll find some of our work linked in my signature.\n\nCheers,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Hey Sara,\n\nI’m checking in one last time about the opportunity to use whiteboard animation at Deep See Consultants.\n\nMany teams find that even short animations help simplify their message and make content more digestible.\n\nIf you’d like, I can put together a brief teaser or script to help you explore this option.\n\nPlease feel free to reply at any time. Examples of our work are linked in my signature.\n\nWarm regards,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175190846348.1933.11210212169206677637@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "no reply",
  "initial time": "18:13",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
{
  "business name": "Aon Risk Solutions",
  "website url": "https://www.aon.com/en/",
  "location": "Charlotte, NC 28204",
  "industry": "Human Resources, Tax Return Preparation, Business Consultants, Retirement Homes, Pension and Profit Sharing Plans",
  "first name": "Scott",
  "middle name": "A.",
  "last name": "Allman",
  "title": "President",
  "email": "scott.allman@aon.com",
  "web copy": "Better Decisions | Aon Home Aon is in the Business of Better Decisions Learn More I want to... Browse Capabilities Explore Insights Discover Aon s Story Scroll Trade Turning Risk into Resilience Turning Risk into Resilience Learn More Technology Finding Security in New Opportunities Finding Security in New Opportunities Learn More Weather Unlock Capital to Protect People and Property Unlock Capital to Protect People and Property Learn More Trade Technology Weather SKIP SECTION What We Do Expertise Across Today's Risk and People Issues At Aon, we ve been on a decade-plus journey to connect our global capabilities so we can address our clients top priorities more effectively. Through our global expertise across two key areas of need Risk Capital and Human Capital our clients are better advised within, and across, their risk and people strategies. What We Do Capability Overview Risk Capital Making Better Risk Decisions Businesses and communities face a rapidly evolving range of interconnected risks. Our Risk Capital advisors bring the breadth of our expertise, relationships and analytics to unlock capital, which we access across markets, geographies and a variety of financial instruments to help organizations grow. Learn More Capability Overview Human Capital Making Better People Decisions People are an organization's most valuable asset, largest cost, and also a major source of risk therefore, getting your people strategy right can often be the difference between success or failure. Our Human Capital products and advisors help clients navigate today's most pressing people challenges to create a healthier, more engaged, and ultimately more productive workforce. Learn More Featured Insights More Insights Report Client Trends 2025 Businesses and society face a complex landscape shaped by the interconnected trends of Trade, Technology, Weather and Workforce. Navigating these trends will be critical as firms look to build resilience and drive growth. Learn More Article 5 Top Trends for Risk Capital in 2025 The risk capital landscape is poised for change, driven by emerging trends reshaping market dynamics. With a buyer-friendly market currently prevailing across most lines, opportunities abound for strategic investment and risk management. Learn More Article 5 Human Resources Trends to Watch in 2025 Human resources is increasingly involved in all areas of a company s strategy. As the workforce changes, HR leaders should identify and leverage these five important and evolving trends. Learn More More Insights Keep Exploring Dive into the trade, technology, weather and workforce trends driving today's biggest business challenges and opportunities. View All Insights Article 8 mins An Insurer Roadmap for Navigating the Energy Transition Article 11 mins Delivering Inclusive Benefits by Removing Barriers to Care Article 11 mins De-Risking M&A in Financial Institutions: Strategies for Smarter Deals in Uncertain Markets Article 9 mins Unlocking Mass Timber: Strategies for Risk and Insurance Article 12 mins Total Rewards Strategies That Drive Business Outcomes Article 6 mins Building Resilience for Another Active Atlantic Hurricane Season Industry Experience Matters Tailored advice for you While we all face many of the same global challenges and opportunities in the age of great volatility, each industry is unique and requires dedicated expertise. Explore our industry research and insights. View All Industries Our Story Aon is in the Business of Better Decisions Aon exists to shape decisions for the better to protect and enrich the lives of people around the world. Through actionable analytic insight, globally integrated Risk Capital and Human Capital expertise, and locally relevant solutions, our colleagues in over 120 countries provide our clients with the clarity and confidence to make better risk and people decisions that protect and grow their businesses. About Aon Our Story Quick Facts Working as a united team, our colleagues help clients make better risk and people decisions every day. 60K Colleagues around the world. 120+ Countries and sovereignties where we operate. Let s Connect Talk to Our Team Contact our team today to learn how we can help your business make better risk and people decisions. Contact Us Subscribe What Comes Next? You will soon receive an email to verify your email address. Please click on the link included in this note to complete the subscription process, which also includes providing consent in applicable locations and an opportunity to manage your email preferences. Featured Insights Article Litigation and Contingent Risks: Unlocking the Value in M&A Article How Data and Analytics Can Optimize HR Programs View All Insights Thank You Let s Connect We ll be in touch soon. Your request is being reviewed so we can align you to the best resources on our team. In the meantime, we invite you to explore some of our latest insights below. Featured Insights Article Litigation and Contingent Risks: Unlocking the Value in M&A Article How Data and Analytics Can Optimize HR Programs View All Insights Thank You Download Now Your file is downloading. If you encounter an issue, use the link below to start a new download. Download Now Download Now Download Now Better Decisions | Aon Home Aon is in the Business of Better Decisions Learn More I want to... Browse Capabilities Explore Insights Discover Aon s Story Scroll Trade Turning Risk into Resilience Turning Risk into Resilience Learn More Technology Finding Security in New Opportunities Finding Security in New Opportunities Learn More Weather Unlock Capital to Protect People and Property Unlock Capital to Protect People and Property Learn More Trade Technology Weather SKIP SECTION What We Do Expertise Across Today's Risk and People Issues At Aon, we ve been on a decade-plus journey to connect our global capabilities so we can address our clients top priorities more effectively. Through our global expertise across two key areas of need Risk Capital and Human Capital our clients are better advised within, and across, their risk and people strategies. What We Do Capability Overview Risk Capital Making Better Risk Decisions Businesses and communities face a rapidly evolving range of interconnected risks. Our Risk Capital advisors bring the breadth of our expertise, relationships and analytics to unlock capital, which we access across markets, geographies and a variety of financial instruments to help organizations grow. Learn More Capability Overview Human Capital Making Better People Decisions People are an organization's most valuable asset, largest cost, and also a major source of risk therefore, getting your people strategy right can often be the difference between success or failure. Our Human Capital products and advisors help clients navigate today's most pressing people challenges to create a healthier, more engaged, and ultimately more productive workforce. Learn More Featured Insights More Insights Report Client Trends 2025 Businesses and society face a complex landscape shaped by the interconnected trends of Trade, Technology, Weather and Workforce. Navigating these trends will be critical as firms look to build resilience and drive growth. Learn More Article 5 Top Trends for Risk Capital in 2025 The risk capital landscape is poised for change, driven by emerging trends reshaping market dynamics. With a buyer-friendly market currently prevailing across most lines, opportunities abound for strategic investment and risk management. Learn More Article 5 Human Resources Trends to Watch in 2025 Human resources is increasingly involved in all areas of a company s strategy. As the workforce changes, HR leaders should identify and leverage these five important and evolving trends. Learn More More Insights Keep Exploring Dive into the trade, technology, weather and workforce trends driving today's biggest business challenges and opportunities. View All Insights Article 8 mins An Insurer Roadmap for Navigating the Energy Transition Article 11 mins Delivering Inclusive Benefits by Removing Barriers to Care Article 11 mins De-Risking M&A in Financial Institutions: Strategies for Smarter Deals in Uncertain Markets Article 9 mins Unlocking Mass Timber: Strategies for Risk and Insurance Article 12 mins Total Rewards Strategies That Drive Business Outcomes Article 6 mins Building Resilience for Another Active Atlantic Hurricane Season Industry Experience Matters Tailored advice for you While we all face many of the same global challenges and opportunities in the age of great volatility, each industry is unique and requires dedicated expertise. Explore our industry research and insights. View All Industries Our Story Aon is in the Business of Better Decisions Aon exists to shape decisions for the better to protect and enrich the lives of people around the world. Through actionable analytic insight, globally integrated Risk Capital and Human Capital expertise, and locally relevant solutions, our colleagues in over 120 countries provide our clients with the clarity and confidence to make better risk and people decisions that protect and grow their businesses. About Aon Our Story Quick Facts Working as a united team, our colleagues help clients make better risk and people decisions every day. 60K Colleagues around the world. 120+ Countries and sovereignties where we operate. Let s Connect Talk to Our Team Contact our team today to learn how we can help your business make better risk and people decisions. Contact Us Subscribe What Comes Next? You will soon receive an email to verify your email address. Please click on the link included in this note to complete the subscription process, which also includes providing consent in applicable locations and an opportunity to manage your email preferences. Featured Insights Article Litigation and Contingent Risks: Unlocking the Value in M&A Article How Data and Analytics Can Optimize HR Programs View All Insights Thank You Let s Co",
  "use cases": "| Demonstrating how data analytics can optimize HR programs | Explaining how to unlock capital for business growth | Walking through strategies for de-risking M&A in financial institutions |",
  "services": "Making Better Risk Decisions | Unlocking capital to help organizations grow | Making Better People Decisions | Navigating people challenges to create a healthier, more engaged, and productive workforce | Delivering Inclusive Benefits by Removing Barriers to Care | De-Risking M&A in Financial Institutions | Unlocking Mass Timber: Strategies for Risk and Insurance | Total Rewards Strategies That Drive Business Outcomes | Building Resilience for Another Active Atlantic Hurricane Season | Litigation and Contingent Risks: Unlocking the Value in M&A | How Data and Analytics Can Optimize HR Programs",
  "email 1": "Hello Scott,\n\nI just saw Aon Risk Solutions and thought you might be the right person to speak with.\n\nI'm Trent. I run Toon Theory, a whiteboard animation studio in the UK. We make simple, animated explainer videos that help people understand dense ideas. They're great for B2B services, thought leadership, and data-driven education.\n\nAon Risk Solutions has a strong foundation, and a short animated video could be a powerful way to bring your message to life. We’ll take care of the full creative lift: script, voice, and illustrations, so you can use it for:\n\n• Demonstrating how data analytics can optimize HR programs\n• Explaining how to unlock capital for business growth\n• Walking through strategies for de-risking M&A in financial institutions\n\nThese videos often help businesses increase engagement by up to 60%, double conversion rates, and boost message retention by up to 80%.\n\nIf you’re open to it, I’d love to share a quick demo built around something Aon Risk Solutions offers. Just a sketch or script; no pressure, no pitch; just curious to see what it might sound like in your voice.\n\nYou’ll find a link to our site in my signature if you’d like to see a few examples. And if anything clicks, I’d love to hear your thoughts.\n\nThanks for putting something refreshing out there.\n\nWarm regards,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Good day Scott,\n\nJust circling back as I didn’t want you to miss out on the chance to explore whiteboard animation for Aon Risk Solutions.\n\nOur videos are designed to help businesses like yours increase engagement, boost clarity, and convert more customers; all with animated storytelling.\n\nIf you'd like, I can create a short demo or script as a no-pressure way to see how this could work for your team.\n\nYou’ll find examples of our work linked in my signature. Let me know if you’d like to see something specific.\n\nBest wishes,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Hello there Scott,\n\nFollowing up once more because I think animation could really help Aon Risk Solutions communicate ideas in a clear and compelling way. Many of our clients have seen great results from adding this creative touch to their messaging.\n\nI’d be happy to sketch out a quick teaser or draft a script that suits your brand and goals.\n\nFeel free to reply if you’d like to see what this might look like. You’ll find links to our past projects in my signature.\n\nCheers,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175190898067.1942.7635280977571367500@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "no reply",
  "initial time": "18:21",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
{
  "business name": "Martin Sloane International",
  "website url": "https://www.martin-sloane.com/",
  "location": "Charlotte, NC 28237",
  "industry": "Strategic Planning Consultants, Social Media Marketing, Human Resources, Recruitment Services, Project Management, Business Process Management, Executive Coaching",
  "first name": "John",
  "middle name": "J.",
  "last name": "Martin",
  "title": "CEO",
  "email": "john@martin-sloane.com",
  "web copy": "Martin Sloane International - Martin Sloane International LLC Home About Us Board of Vision & Strategy CEO Bio Our Vision Our Values Our Culture / Our Brand Our Practices Entrepreneur Sustainability Community Growth Nonprofit Support Faith-Based Development Corp Consulting Other Services MBE Info NAICS Codes Programs We Are One Charlotte Upcoming Training Blogs Contact Us Martin Sloane International LLC The Power of Innovation . \"MSI develops and implements strategic programs that drive long-term community sustainability. Through entrepreneurial training, community-enabling initiatives, and targeted resilience strategies, MSI with partners empower individuals, communities, and organizations with the necessary skills, resources, and opportunities to foster economic growth, social mobility, and self-sufficiency.\" John Martin, CEO What We Do . We are a consulting firm specializing in comprehensive, community-based solutions designed to foster sustainable growth for individuals, families, and neighborhoods. Through our expertise, we help clients develop a mindset and organizational culture centered around, growth, sustainability, collaboration, and long-term prosperity. Our Approach . Using a collaborative process of diverse voices and backgrounds, we empower communities to dream bigger, work together, and create a shared vision for a brighter future one that reflects a growth mindset based on the sound principles and values of an entrepreneurial based economy unlocking the potential for lasting change and boundless opportunity. Our Process . Our process is guided by a dynamic model built on four key components. First, we help stakeholders define a compelling community Vision & Strategy , providing a clear direction for the future. Next, we conduct a Current Environment Assessment , evaluating the community s existing economic and social landscape to identify strengths, challenges, and opportunities for growth. We then explore Opportunities , uncovering innovative pathways and entrepreneurial solutions that foster development. Finally, we develop a Vision Roadmap , a detailed, actionable plan to guide the community toward achieving its goals and creating lasting impact. Contact us. S ee how we can leverage our expertise to help you strategically solve your challenges . Call (704) 686-7900 Contact Us Martin Sloane International LLC. All rights reserved. 525 N Tryon St Charlotte NC 28202 Home About Us Board of Vision & Strategy CEO Bio Our Vision Our Values Our Culture / Our Brand Our Practices Entrepreneur Sustainability Community Growth Nonprofit Support Faith-Based Development Corp Consulting Other Services MBE Info NAICS Codes Programs We Are One Charlotte Upcoming Training Blogs Contact Us UA-204531668-1 management consultant, IT consultant Martin Sloane International - Martin Sloane International LLC Home About Us Board of Vision & Strategy CEO Bio Our Vision Our Values Our Culture / Our Brand Our Practices Entrepreneur Sustainability Community Growth Nonprofit Support Faith-Based Development Corp Consulting Other Services MBE Info NAICS Codes Programs We Are One Charlotte Upcoming Training Blogs Contact Us Martin Sloane International LLC The Power of Innovation . \"MSI develops and implements strategic programs that drive long-term community sustainability. Through entrepreneurial training, community-enabling initiatives, and targeted resilience strategies, MSI with partners empower individuals, communities, and organizations with the necessary skills, resources, and opportunities to foster economic growth, social mobility, and self-sufficiency.\" John Martin, CEO What We Do . We are a consulting firm specializing in comprehensive, community-based solutions designed to foster sustainable growth for individuals, families, and neighborhoods. Through our expertise, we help clients develop a mindset and organizational culture centered around, growth, sustainability, collaboration, and long-term prosperity. Our Approach . Using a collaborative process of diverse voices and backgrounds, we empower communities to dream bigger, work together, and create a shared vision for a brighter future one that reflects a growth mindset based on the sound principles and values of an entrepreneurial based economy unlocking the potential for lasting change and boundless opportunity. Our Process . Our process is guided by a dynamic model built on four key components. First, we help stakeholders define a compelling community Vision & Strategy , providing a clear direction for the future. Next, we conduct a Current Environment Assessment , evaluating the community s existing economic and social landscape to identify strengths, challenges, and opportunities for growth. We then explore Opportunities , uncovering innovative pathways and entrepreneurial solutions that foster development. Finally, we develop a Vision Roadmap , a detailed, actionable plan to guide the community toward achieving its goals and creating lasting impact. Contact us. S ee how we can leverage our expertise to help you strategically solve your challenges . Call (704) 686-7900 Contact Us Martin Sloane International LLC. All rights reserved. 525 N Tryon St Charlotte NC 28202 Home About Us Board of Vision & Strategy CEO Bio Our Vision Our Values Our Culture / Our Brand Our Practices Entrepreneur Sustainability Community Growth Nonprofit Support Faith-Based Development Corp Consulting Other Services MBE Info NAICS Codes Programs We Are One Charlotte Upcoming Training Blogs Contact Us UA-204531668-1 management consultant, IT consultant About Us - Martin Sloane International Home About Us Board of Vision & Strategy CEO Bio Our Vision Our Values Our Culture / Our Brand Our Practices Entrepreneur Sustainability Community Growth Nonprofit Support Faith-Based Development Corp Consulting Other Services MBE Info NAICS Codes Programs We Are One Charlotte Upcoming Training Blogs Contact Us About Us . At our core, we are visionaries, driven by a profound desire to uplift the global economy and ignite a wave of progress. We believe in the transformative power of entrepreneurship to fuel economic growth, and we are proud to play small but focused role in global growth. Our approach is simple yet powerful: to enable entrepreneurship by equipping organizations of all sizes with the tools, insights, and strategies they need to realize their fullest potential thereby driving the grow of small business and entrepreneur marketplace. Excellence is not just our standard; it is our way of life. Our dedicated team of highly skilled professionals works tirelessly to deliver innovative, tailored solutions designed to meet the unique needs of engagement. What sets us apart is not only our relentless pursuit of excellence but also our unwavering commitment to client success. We are more than consultants we are partners in your journey, fully invested in helping you achieve your aspirations and unlock new horizons of possibility. Our executive team stands as a testament to our mission. Composed of seasoned thought leaders and architects of innovation, they have shaped transformative strategies for some of the world's most influential organizations. With a wealth of real-world experience and a passion for visionary thinking, they bring immense value to every challenge, crafting solutions that propel your organization forward. Together, we are driven by the belief that greatness is within reach for every organization. With expertise, passion, and an unwavering commitment to your success, we aim to empower your journey, ensuring that every step is a bold stride toward your ultimate goals. Let us walk with you, turning your vision into reality and helping you shape a future filled with boundless potential. If you have a consulting need, please contact us. Established in 2015. Our executive team averages over 25 years of experience. We specialize in business strategy, organizational improvement, business transformation, and technology enablement. We have helped some of the world s largest organizations improve their operations through faster and better decisioning, more effective and efficient processes by developing integrated innovative technologies that deliver increased revenue, reduced costs, and improved customer satisfaction. Over time, our team members have developed a growing reputation for integrity, trust, commitment, and value . Contact us. S ee how we can leverage our expertise to help you strategically solve your challenges . Call (704) 686-7900 Contact Us Martin Sloane International LLC. All rights reserved. 525 N Tryon St Charlotte NC 28202 Home About Us Board of Vision & Strategy CEO Bio Our Vision Our Values Our Culture / Our Brand Our Practices Entrepreneur Sustainability Community Growth Nonprofit Support Faith-Based Development Corp Consulting Other Services MBE Info NAICS Codes Programs We Are One Charlotte Upcoming Training Blogs Contact Us UA-204531668-1 Board of Vision & Strategy - Martin Sloane International Home About Us Board of Vision & Strategy CEO Bio Our Vision Our Values Our Culture / Our Brand Our Practices Entrepreneur Sustainability Community Growth Nonprofit Support Faith-Based Development Corp Consulting Other Services MBE Info NAICS Codes Programs We Are One Charlotte Upcoming Training Blogs Contact Us Board of Vision & Strategy . Dr. Craig A. Bell, DSL Strategist, Innovator, Technologist, Nonprofit Consultant Dr. Kevin M. Butler, Ph.D. Minister, Coach, Activist, Community & Youth Leader, Change Leader Clark L. George, CPA-Retired Corp Exec, Board Member, Visionary. Exceptional Leadership, International Experience Dr. Tracey L Flemmings, Ph. D Corp Exec, College President, Board Member, Strategist, Logistical and Nonprofit Consultant Who We Are Our Certifications. SAM | U.S. Government Registered CAGE | Department of Defense Registered ( CAGE # 9 3YW6 ) USBC | US Black Chamber - Certified Black-Owned Business NMSDC | Certified MBE Business Our Employment Perspect",
  "use cases": "| Demonstrating how to develop a vision roadmap for entrepreneurs | Explaining the benefits of community-enabling initiatives for nonprofits | Walking through the process of conducting a current environment assessment for business transformation",
  "services": "Entrepreneurial training | Community-enabling initiatives | Targeted resilience strategies | Vision & Strategy development | Current Environment Assessment | Opportunities exploration | Vision Roadmap development | Corp Consulting | Faith-Based Development | Nonprofit Support | IT consulting | Management consulting | Business strategy | Organizational improvement | Business transformation | Technology enablement | Faster and better decisioning | More effective and efficient processes | Innovative technology development | Integrated technology solutions",
  "email 1": "Hi John,\n\nI came across Martin Sloane International recently and wanted to reach out directly.\n\nI'm Trent, and I run Toon Theory; an animation studio based in the UK. We use hand-drawn animations to help businesses get their message across. It's a simple way to cut through noise, especially in B2B, thought leadership, and data-driven education.\n\nFor Martin Sloane International, I think there could be a great opportunity to use visual storytelling to help more people “get it” faster. Our animations are fully done-for-you: script, illustrations, voice, and storyboard; so you can use them for:\n\n• Demonstrating how to develop a vision roadmap for entrepreneurs\n• Explaining the benefits of community-enabling initiatives for nonprofits\n• Walking through the process of conducting a current environment assessment for business transformation\n\nThese videos often help businesses increase engagement by up to 60%, double conversion rates, and boost message retention by up to 80%.\n\nI'd be more than happy to whip up a quick snippet; a short script or sketch; that speaks to what Martin Sloane International does best. No commitments at all, just a chance to show you what's possible.\n\nLet me know if you'd like to take this further. You can check out some of our work through the link in my signature as well.\n\nKeep doing what you do, it's making an impact.\n\nAll the best,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Hello John,\n\nHope this finds you well. I’m following up on my previous email offering a quick, no-commitment demo to show how whiteboard animation might work for Martin Sloane International.\n\nThese animations are a great way to explain services or products in an engaging, easy-to-understand format.\n\nIf you’d like me to put something together, just let me know. You’ll find some past examples linked below too.\n\nWith appreciation,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Good day John,\n\nI hope your week is going well. I am wrapping up some projects and wanted to reach out again before I close things out.\n\nIf you would still like to explore using whiteboard videos to support Martin Sloane International's messaging, I would love to help. Simply reply or take a peek at some of our previous work on our website, which is linked in my signature.\n\nRespectfully,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175190959322.1933.13520020401911239461@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "no reply",
  "initial time": "18:31",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
{
  "business name": "HR Solutions of the Carolinas",
  "website url": "https://hrcarolinas.com/staff",
  "location": "Hill, NC 28227",
  "industry": "Human Resources, Compliance Consulting",
  "first name": "Jennifer",
  "middle name": "",
  "last name": "Lazenby",
  "title": "Owner",
  "email": "jennifer@hrcarolinas.com",
  "web copy": "HR Solutions of the Carolinas - Disc Profile, Consultant Hr | HR Solutions of the Carolinas Home Solutions & Services About Us Staff Staff Jennifer Lazenby - Managing Partner Over 19 years of Human Resources experience supporting retail, manufacturing, information technology, legal services, sales, insurance services, in home healthcare, medical, distribution, and others Masters in Psychology (MSP) Senior Human Resources Professional (SPHR) Society of Human Resources Senior Certified Professional (SHRM-SCP) Human Capital Strategist (HCS) * DiSC Certified Partner Contact Phone: 704-574-6114 Email: jlazenby@hrcarolinas.com Rachel Silver HR Consultant Over 17 years experience providing human resource, finance, and accounting support to small businesses Experience supporting in the industries of logistics, construction, information technology and others BSBA - Marketing Senior Human Resources Professional (SPHR) Contact Phone: 704-574-1088 Email: rsilver@hrcarolinas.com Copyright 2020 HR Solutions of the Carolinas - All Rights Reserved. Powered by GoDaddy Website Builder HR Solutions of the Carolinas - Human Resources Consultant, HR Audit Home Solutions & Services About Us Staff Welcome to HR Solutions of the Carolinas Welcome to HR Solutions of the Carolinas Welcome to HR Solutions of the Carolinas Welcome to HR Solutions of the Carolinas Do you need Human Resource support sometimes , but not full time ? How vulnerable are you to employment claims and legislation violations ? Need to complete your business puzzle with some Human Resources expertise? Subscribe Subscribe to receive email blasts about employment related compliance topics, leadership advice, and general update from the world of human resources Contact Us Need HR Support, Contact us! We will gladly schedule a convenient meeting time to discuss your needs. HR Solutions of the Carolinas Copyright 2020 HR Solutions of the Carolinas - All Rights Reserved. Powered by GoDaddy Website Builder Human Resources - HR Solutions of the Carolinas | HR Solutions of the Carolinas Home Solutions & Services About Us Staff Solutions & Services COMPLIANCE Do you worry that you are not compliant to the multitude of employment legislation? We are the SOLUTION, not only will we evaluate your current HR practices, documents and procedures for compliance to all employment legislation, we will also continually update you on pending legislation that will affect your business. STAFFING & RETENTION Having issues finding good employees? Don't have time for the hiring process? Are your employees under or overpaid? Are you having quality or performance issues from your employees? Do you wonder how best to terminate problem employees? We are the SOLUTION, taking the guess work out of all issues related to hiring, compensating, training, managing, rewarding, and even terminating employees. STRATEGY Do you need to create a reporting structure? Are your processes efficient? Are you planning a major software or procedure change? Are you wondering how to get your business to the next level? We are the SOLUTION to setting up your organization structure, change management programs, employer branding, efficiency focused processes, and procedural improvement planning. DiSC Certified Partner Want to know how to improve communications with and among your staffing? Having trouble finding the right person for a position? We are the SOLUTION, let us show you the different personality types, how they interact, and how this interaction can make or break your business. Copyright 2020 HR Solutions of the Carolinas - All Rights Reserved. Powered by GoDaddy Website Builder About Us | HR Solutions of the Carolinas Home Solutions & Services About Us Staff About Us Mission Our mission is to provide strategic Human Resources solutions that fit the unique needs of our clients by acting as both a business partner and a Human Resources Consultant How We Are Different * Strict focus on your company's bottom line * Scheduled onsite visits that occur at least every other week * We become embedded in your business to ensure the most business focused recommendations * Payment is made for the service you have received * No Contracts, just a service agreement Who We Serve We provide HR Solutions to a variety of industries, no employer is too small or too large to receive our assistance. If you have human resources needs, we can certainly provide the SOLUTION. Copyright 2020 HR Solutions of the Carolinas - All Rights Reserved. Powered by GoDaddy Website Builder",
  "use cases": "Illustrating compliance regulations to ensure employee understanding | Demonstrating effective staffing strategies to boost retention | Walking through customized business strategies to drive growth",
  "services": "COMPLIANCE | STAFFING & RETENTION | STRATEGY | DiSC Certified Partner",
  "email 1": "Hi Jennifer,\n\nI stumbled on HR Solutions of the Carolinas the other day and wanted to get in touch.\n\nI'm Trent, and I run Toon Theory; an animation studio based in the UK. We make whiteboard videos that break down complex ideas with simple, hand-drawn visuals. It’s perfect for B2B, thought leadership, and data-driven education.\n\nI think HR Solutions of the Carolinas could really benefit from using visual storytelling to explain things faster and make them stick. We take care of everything: scripting, illustration, voiceover and storyboarding; so you can use the final video for:\n\n• Demonstrating effective staffing strategies to boost retention\n• Illustrating compliance regulations to ensure employee understanding\n• Walking through customized business strategies to drive growth\n\nClients often tell us these pieces help reduce bloat, increase clarity, and lead to more meaningful conversions.\n\nWould you be open to seeing a quick script or ten-second sketch built with HR Solutions of the Carolinas in mind? No expectations; just interested in showing you what’s possible.\n\nIf it feels like a fit, you can reply any time. There’s also a link in my signature in case you want to browse a few previous projects.\n\nThanks for leading with both heart and strategy.\n\nKind regards,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Hello there Jennifer,\n\nReaching out again in case the idea of using whiteboard animation is still on your radar.\n\nIt’s often a great fit for simplifying dense content, making internal updates more engaging, or curating educational content that feel less overwhelming and more human.\n\nFor HR Solutions of the Carolinas, I’d be glad to sketch a quick visual or draft a short script so you can see what this might look like in practice.\n\nReply when you can, or check out some examples in the signature below.\n\nSincerely,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Howdy Jennifer,\n\nReaching out one last time before I close the loop. If you are still exploring creative ways to showcase what HR Solutions of the Carolinas offers, this could be a great fit.\n\nI would be glad to put together a simple teaser or sketch if you are curious. Reply at your convenience or check out some of our past projects. The link is in my signature.\n\nTake care,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175191035681.1937.13900268715402771181@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "after initial",
  "initial time": "18:44",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
{
  "business name": "Accountant Analytics",
  "website url": "https://accountantanalytics.com/",
  "location": "Austin, TX 78717",
  "industry": "Accounting, Tax Return Preparation, Accountant, Bookkeeping Services, Taxes",
  "first name": "Barton",
  "middle name": "",
  "last name": "Bumpus",
  "title": "Owner",
  "email": "barton.bumpus@accountantanalytics.com",
  "web copy": "Accountant Analytics.com - Accounting Services, Consulting Services Home Tax Preparation Tax Planning QuickBooks SAP BPC Tableau Training Services Privacy Policy Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Let us keep your business in order! Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Let us keep your business in order! About Us Your Taxes, Simplified We re dedicated to our clients. And we've represented them in audits with the IRS, FTB, and EDD. This keeps us current on tax law so we re always ready for the toughest situations. Quickbooks ProAdvisor We help clients looking to implement Quickbooks, convert to Quickbooks, enhance your Quickbooks implementation, create a budget, cash flow forecast and manage a number of planning items and KPIs. Accounting & Bookkeeping We can replace your back office with accounting, payroll, consulting services, bookkeeping and tax preparation support. When it comes to complex issues, rely on us. Your Business is Our Business We have experience in a number of software platforms - from QuickBooks, SAP, Hyperion, Oracle, Anaplan, Informatica - and we are happy to help you learn to orchestrate your results instead of just reacting. My Blog Contact Us We know that the accounting needs for each business or family are unique. Use our form to tell us more about your needs, and concerns, and we will give you a free quote on regular or one-time accounting services. Message us on WhatsApp Accountant Analytics.com 614-832-4700 ; info@accountantanalytics.com ; Hours Monday - Friday: 9am - 5pm Saturday: By appointment Sunday: Closed Subscribe Copyright 2023 Accountant Analytics.com - All Rights Reserved. Powered by GoDaddy This website uses cookies. We do use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept Accountant Analytics.com - Accounting Services, Consulting Services Home Tax Preparation Tax Planning QuickBooks SAP BPC Tableau Training Services Privacy Policy Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Let us keep your business in order! Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Providing Professional Accounting or Bookkeeping Services Let us keep your business in order! About Us Your Taxes, Simplified We re dedicated to our clients. And we've represented them in audits with the IRS, FTB, and EDD. This keeps us current on tax law so we re always ready for the toughest situations. Quickbooks ProAdvisor We help clients looking to implement Quickbooks, convert to Quickbooks, enhance your Quickbooks implementation, create a budget, cash flow forecast and manage a number of planning items and KPIs. Accounting & Bookkeeping We can replace your back office with accounting, payroll, consulting services, bookkeeping and tax preparation support. When it comes to complex issues, rely on us. Your Business is Our Business We have experience in a number of software platforms - from QuickBooks, SAP, Hyperion, Oracle, Anaplan, Informatica - and we are happy to help you learn to orchestrate your results instead of just reacting. My Blog Contact Us We know that the accounting needs for each business or family are unique. Use our form to tell us more about your needs, and concerns, and we will give you a free quote on regular or one-time accounting services. Message us on WhatsApp Accountant Analytics.com 614-832-4700 ; info@accountantanalytics.com ; Hours Monday - Friday: 9am - 5pm Saturday: By appointment Sunday: Closed Subscribe Copyright 2023 Accountant Analytics.com - All Rights Reserved. Powered by GoDaddy This website uses cookies. We do use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept Shop Home Tax Preparation Tax Planning QuickBooks SAP BPC Tableau Training Services Privacy Policy Copyright 2023 Accountant Analytics.com - All Rights Reserved. Powered by GoDaddy This website uses cookies. We do use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept Tax Preparation Home Tax Preparation Tax Planning QuickBooks SAP BPC Tableau Training Services Privacy Policy Tax Preparation Tax Avoidance is Legal. Tax Evasion is not! We can help you keep compliant with State and Federal Income Taxes. We can help you get caught up and stay ahead with Tax Planning. Schedule a Session to Discuss Tax Preparation Copyright 2023 Accountant Analytics.com - All Rights Reserved. Powered by GoDaddy This website uses cookies. We do use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept Tax Planning Home Tax Preparation Tax Planning QuickBooks SAP BPC Tableau Training Services Privacy Policy \"A penny saved is a penny earned.\" Benjamin Franklin Tax Planning We help you with Tax Planning. We analyze your current and prior year taxes and identify strategies that you can implement to save money on taxes. Typical savings for individuals is $3,000-$5,000 annually. Small Businesses typically save between $10 and 30k annually. Let us help you keep more of your money! Schedule a Session More Info Tax Planning Session Tax Planning Session Tax Planning Session We gather some specifics regarding your taxes, your anticipated financials for the year, and identify strategies that save money. Our goal is to identify the key saving strategies and help you put together a plan to implement them. We can even help you implement them or provide quarterly reviews to ensure that you tracking towards your goal! Additional Savings Tax Planning Session Tax Planning Session Customers who sign-up for tax planning will save 25% on tax preparation fees. We want to make sure that we help you see the savings through! FAQs Tax Planning Session FAQs Want to know what the process is like? See our FAQ! FAQs FAQs Frequently Asked Questions What should I expect in a Tax Planning Session? Clients should expect two meetings and some homework during the tax planning phase. The first meeting will be an overview of the process, the outline of the tasks, and an agreement to move forward. This is followed by a working session where we review last year's taxes, current year financial results, current year financial forecasts (or provide some guestimates). Often we can provide a questionnaire that the client can fill out in advance that will make the working session go faster. Then finally, we will prepare and present expected savinigs along with an implementatiion plan for making those savings happen. How much time should I plan on this? That's a good question. However, the real question is how much time is $10,000 or more in saviings worth to you? We typically say that clients should expect between 5 and 10 hours to complete the process as inputs to the preparation of the plan. If we save you $10,000 (often a lot more) and you spent 10 hours working on it - that would be $1,000 an hour! What if there are no significant savings? Every client worries that there will be no savings. It is rare and it does happen. If we can't find any savings, then there is no charge for the review. Its that simple. Are the savings a one-time saving? Sometimes yes, but often they are recurring annually - which means they re-occur every. Clients love finding annual savings - its like giving them a pay raise! Is this confidential? Absolutely. We are fearce about protecting our clients and their condifentiality. We treat you the way we expect to be treated. Our Privacy Policy details our approach, but rest assure, we have the latest encryption products to ensure your identity and data are safe! Copyright 2023 Accountant Analytics.com - All Rights Reserved. Powered by GoDaddy This website uses cookies. We do use cookies to analyze website traffic and optimize your website experience. By accepting our use of cookies, your data will be aggregated with all other user data. Accept QuickBooks Home Tax Preparation Tax Planning QuickBooks SAP BPC Tableau Training Services Privacy Policy Shift Your Focus QuickBooks Our team of professionals can help you implement QuickBooks, clean up, or completely run your bookkeeping. We are fluent in charts of accounts, bookkeeping, reconciling, reporting, and compliance. We help you move to the digital age and transform the finance function to help you get more from your investment. Move to QuickBooks Site Content Bookkeeping Bookkeeping Bookkeeping We can keep your books, prepare financials, book transactions, and assist with many types of office functions so that owners can focus on the business. Planning Bookkeeping Bookkeeping We can help you prepare a budget, forecast, and organize your books to help you track your performance. Clean Up App Integration App Integration Got a books mess? Not sure what income, expense, asset, or liability values are? Give us a call. We can help get your books in alignment and make sure you have the controls you need to make sure you know. App Integration App Integration App Integration See an Application (app) from the QuickBooks app store that you have a question on? We can help.",
  "use cases": "| Walking through the benefits of outsourcing accounting services | Explaining how to set up and use QuickBooks for small businesses | Demonstrating how to create a cash flow forecast using Tableau |",
  "services": "Accounting Services | Consulting Services | Home Tax Preparation | Tax Planning | QuickBooks | SAP BPC | Tableau Training Services | Bookkeeping | Payroll | Tax preparation support | Budgeting | Cash flow forecasting | Accounting | Bookkeeping | App Integration",
  "email 1": "Hi Barton,\n\nI stumbled on Accountant Analytics the other day and wanted to get in touch.\n\nI'm Trent, and I run Toon Theory; an animation studio based in the UK. We use hand-drawn animations to help businesses get their message across. It's a simple way to cut through noise, especially in B2B, thought leadership, and data-driven education.\n\nAccountant Analytics has a strong foundation, and a short animated video could be a powerful way to bring your message to life. We’ll take care of the full creative lift: script, voice, and illustrations, so you can use it for:\n\n• Demonstrating how to create a cash flow forecast using Tableau\n• Walking through the benefits of outsourcing accounting services\n• Explaining how to set up and use QuickBooks for small businesses\n\nThese animations don’t just explain, they convert; Many of our past clients see a big lift in engagement, trust, and sales.\n\nCould I sketch something out for you? A short demo or script idea based on what Accountant Analytics offers. No pitch; just something for you to react to.\n\nI’d be happy to chat if you’re interested. Just reply anytime, and feel free to check out some of our work through the link in my signature.\n\nThanks for putting something refreshing out there.\n\nWarm regards,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Hello there Barton,\n\nJust looping back in case this got lost in your inbox. I mentioned how whiteboard animation could support Accountant Analytics’s messaging ; and I still believe there’s a great fit here.\n\nThese videos are especially helpful when you’re trying to explain something technical, strategic, or new in a way that sticks.\n\nIf it helps, I’d be happy to put together a short script or quick teaser to show what this could look like.\n\nFeel free to reply if you’d like to explore it. You’ll find examples of our work in my signature.\n\nWith appreciation,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Hey Barton,\n\nI wanted to check in one last time to offer support if you’re thinking about how Accountant Analytics could benefit from whiteboard animation.\n\nWe’ve helped many businesses explain their offerings clearly and creatively through short, engaging videos.\n\nIf you’d like, I can draft a quick sample to show how this might work for you.\n\nPlease don’t hesitate to reply. Our past projects are linked below.\n\nBest wishes,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175191127417.1930.8262001355489118473@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "no reply",
  "initial time": "19:00",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
{
  "business name": "John B. Knox, CPA, P.C",
  "website url": "https://johnbknoxcpa.com/",
  "location": "Hls, TX 78746",
  "industry": "Accountant",
  "first name": "John",
  "middle name": "B.",
  "last name": "Knox",
  "title": "President",
  "email": "john@johnbknoxcpa.com",
  "web copy": "John B. Knox, CPA, PC | Your full service accounting firm in Austin, Texas Skip to primary content http://johnbknoxcpa.com/wp-content/uploads/2017/12/JohnKnox_short.mov The offices of John B. Knox, CPA, PC, provide comprehensive accounting services observing the highest ethical and legal standards. 1705 S. Capital of Texas Hwy, Ste 201 Austin, TX 78746 512.236.9098 Waterfall Photo by Thomas Campbell John B. Knox, CPA, PC | Your full service accounting firm in Austin, Texas Skip to primary content http://johnbknoxcpa.com/wp-content/uploads/2017/12/JohnKnox_short.mov The offices of John B. Knox, CPA, PC, provide comprehensive accounting services observing the highest ethical and legal standards. 1705 S. Capital of Texas Hwy, Ste 201 Austin, TX 78746 512.236.9098 Waterfall Photo by Thomas Campbell John B. Knox, CPA, PC | Your full service accounting firm in Austin, Texas Skip to primary content http://johnbknoxcpa.com/wp-content/uploads/2017/12/JohnKnox_short.mov The offices of John B. Knox, CPA, PC, provide comprehensive accounting services observing the highest ethical and legal standards. 1705 S. Capital of Texas Hwy, Ste 201 Austin, TX 78746 512.236.9098 Waterfall Photo by Thomas Campbell About Us | John B. Knox, CPA, PC Skip to primary content John Knox has over 40 years of experience in public accounting, initially working for firms in Houston before establishing his own practice in Corpus Christi in 1984. He specializes in Tax Planning and Preparation, Litigation Support, Business Valuation, Business Advisory Services, Fraud Examination and Forensic Accounting. John earned his Bachelors of Business Administration degree from the University of Texas at Austin. He is a Certified Public Accountant (CPA) and holds the Certified Fraud Examiner (CFE) designation from the Association of Certified Fraud Examiners (ACFE); and the Certified Valuation Analyst (CVA) designation from the National Association of Certified Valuation Analysts (NACVA) and currently serves as the Vice President of the Austin Chapter of the Association of Certified Fraud Examiners. John provides close personal attention to his clients needs. When you call his office, you can speak directly with him, ask questions, and get direct answers. Services | John B. Knox, CPA, PC Skip to primary content John B. Knox, CPA, PC is a full service accounting practice, offering clients support and assistance in all aspects of financial needs. We team with attorneys in civil litigation and family law to compile forensic accounting in the matters of divorce, We conduct evaluations of small and closely held businesses to determine fair market value, We work with businesses to detect fraud and illegal acts, We offer comprehensive tax preparation, We provide bookkeeping services. Our clients come to us primarily through referrals. Forensic Accounting | John B. Knox, CPA, PC Skip to primary content Our service encompasses combining accounting knowledge with investigative skills, using this unique combination in litigation support and investigative accounting settings. Types of services performed: Financial data analysis Compensation claims Business loss claims Fraud analysis and tracing Evidence integrity analysis Compiling information Eliciting other experts assistance Maintaining documentation Tracing illicit funds Locating hidden assets Due diligence reviews Forensic intelligence gathering Testifying as an expert witness Business Valuation | John B. Knox, CPA, PC Skip to primary content includes determining the economic value of small and closely held businesses to determine fair market value for a variety of reasons, including sale value, establishing partner ownership and divorce proceedings. Divorce | John B. Knox, CPA, PC Skip to primary content often entails a precise accounting of assets of both parties. We work closely with attorneys in matters of civil litigation and family law which include Forensic Accounting. Types of services performed: Characterization and tracing of property Calculation of child support Calculation of retirement benefit plans Calculation of Restricted Stock Units Calculation of stock option Income tax effects of settlement agreements Review of financial transactions Fraud Examination | John B. Knox, CPA, PC Skip to primary content We combine accounting knowledge with investigative skills, using this unique combination in litigation support and investigative accounting settings. Engagement Area Examples: Types of services performed: Money laundering Financial data analysis Insurance claims Evidence integrity analysis Employee fraud investigations Computer application design GAAP violations Writing reports GAAS violations Compiling information Telemarketing fraud Testifying as an expert witness Check kiting Eliciting other experts assistance Contract and procurement fraud Maintaining documentation Asset misappropriation Damage assessment Securities fraud Tracing illicit funds Financial statement fraud Locating hidden assets Bankruptcy fraud Due diligence reviews Credit card fraud Forensic intelligence gathering Embezzlement Business valuation Tax Preparation | John B. Knox, CPA, PC Skip to primary content We provide tax preparation for individuals, partnerships, small businesses and trusts. Types of services performed: Individual income tax preparation Partnership tax return preparation S Corporation income tax preparation Corporate income tax preparation Fiduciary income tax preparation Tax projections and consultation General Accounting | John B. Knox, CPA, PC Skip to primary content We can help you with all your accounting needs. Our offices follow Generally Accepted Accounting Principles (GAAP), the common set of accounting principles, standards, and procedures that companies use to compile their financial statements. Bookkeeping | John B. Knox, CPA, PC Skip to primary content We offer full service bookkeeping. Types of services performed: QuickBooks Single Entry Dual Entry Cash Basis Accrual Basis Posting Chart of Accounts Financial Reports Balance Sheets Documentation Reporting Contact Us | John B. Knox, CPA, PC Skip to primary content John B. Knox, CPA 1705 S. Capital of Texas Hwy, Ste 201 Austin, TX 78746 512.236.9098 If you would like more information about how we can help you, please complete the form below and we will get back to you as soon as possible. Tips | John B. Knox, CPA, PC Skip to primary content 7 Most Common Tax Mistakes | John B. Knox, CPA, PC Skip to primary content Don t delay your refund by making these common mistakes on your return. An UNSIGNED return. A wrong social security number . For example, inserting a symbol for a number: 123-4%-6789 A wrong name . For example, Smidth instead of Smith. Entering a wrong filing status. For example, if divorced, do you choose SINGLE or HEAD OF HOUSEHOLD? Making mistakes when claiming credits or deductions . Entering a wrong bank account number. Simple math errors. To ensure you file a correct tax return, contact us and we will help.",
  "use cases": "| Demonstrating how to prepare for a tax audit | Explaining the process of tracing hidden assets | Walking through the steps of calculating child support payments |",
  "services": "Tax Planning and Preparation | Litigation Support | Business Valuation | Business Advisory Services | Fraud Examination | Forensic Accounting | Forensic Accounting | Financial data analysis | Compensation claims | Business loss claims | Fraud analysis and tracing | Evidence integrity analysis | Compiling information | Eliciting other experts assistance | Maintaining documentation | Tracing illicit funds | Locating hidden assets | Due diligence reviews | Forensic intelligence gathering | Testifying as an expert witness | Determining the economic value of small and closely held businesses | Divorce | Characterization and tracing of property | Calculation of child support | Calculation of retirement benefit plans | Calculation of Restricted Stock Units | Calculation of stock option | Income tax effects of settlement agreements | Review of financial transactions | Fraud Examination | Money laundering | Financial data analysis | Insurance claims | Evidence integrity analysis | Employee fraud investigations | Computer application design | GAAP violations | Writing reports | GAAS violations | Compiling information | Telemarketing fraud | Testifying as an expert witness | Check kiting | Eliciting other experts assistance | Contract and procurement fraud | Maintaining documentation | Asset misappropriation | Damage assessment | Securities fraud | Tracing illicit funds | Financial statement fraud | Locating hidden assets | Bankruptcy fraud | Due diligence reviews | Credit card fraud | Forensic intelligence gathering | Embezzlement | Business valuation | Tax Preparation | Individual income tax preparation | Partnership tax return preparation | S Corporation income tax preparation | Corporate income tax preparation | Fiduciary income tax preparation | Tax projections and consultation | General Accounting | Bookkeeping | QuickBooks | Single Entry | Dual Entry | Cash Basis | Accrual Basis | Posting | Chart of Accounts | Financial Reports | Balance Sheets | Documentation | Reporting",
  "email 1": "Hi John,\n\nI stumbled across John B. Knox, CPA, P.C and thought I’d reach out.\n\nI'm Trent, and I run Toon Theory; an animation studio based in the UK. We make whiteboard videos that break down complex ideas with simple, hand-drawn visuals. It’s perfect for B2B, thought leadership, and data-driven education.\n\nI think John B. Knox, CPA, P.C could really benefit from using visual storytelling to explain things faster and make them stick. We take care of everything: scripting, illustration, voiceover and storyboarding; so you can use the final video for:\n\n• Walking through the steps of calculating child support payments\n• Demonstrating how to prepare for a tax audit\n• Explaining the process of tracing hidden assets\n\nWhether it’s more signups, better retention, or faster understanding, these animations know how to hit hard. And they move the needle where it counts.\n\nIf you're curious, I could draft a ten-second teaser or sketch based on what John B. Knox, CPA, P.C offers. Nothing formal. Just something you can react to, no strings or expectations.\n\nLet me know if you'd like to take this further. You can check out some of our work through the link in my signature as well.\n\nThanks for leading with both heart and strategy.\n\nSincerely,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Hey John,\n\nHope this finds you well. I’m following up on my previous email offering a quick, no-commitment demo to show how whiteboard animation might work for John B. Knox, CPA, P.C.\n\nThese animations are a great way to explain services or products in an engaging, easy-to-understand format.\n\nIf you’d like me to put something together, just let me know. You’ll find some past examples linked below too.\n\nCheers,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Howdy John,\n\nCircling back once more before I close the loop.\n\nIf there is anything at John B. Knox, CPA, P.C you have been meaning to simplify, such as those boring quarterly reports your team never reads, then whiteboard animation could help bring that to life.\n\nI would be happy to sketch something if you want to see what that might look like. You can reply anytime or check out some of our previous work on our website, linked in my signature.\n\nAll the best,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175191235127.1938.6963122619179277102@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "no reply",
  "initial time": "19:17",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
{
  "business name": "Lolley & Associates, CPA",
  "website url": "https://www.cpalolley.com/",
  "location": "Austin, TX 78703",
  "industry": "Accountant",
  "first name": "Russell",
  "middle name": "L",
  "last name": "Lolley",
  "title": "Partner",
  "email": "llolley@cpalolley.com",
  "web copy": "Austin, TX Accounting Firm | Home Page | Lolley and Associates Skip to content About Tax Center Resources Contact An Austin, Texas Accounting Firm Serving Businesses and Individuals With Complex Tax Needs. Lolley & Associates experienced CPAs perform tax services, audits, reviews, compilations, and advisory services for businesses and individuals throughout Austin and Central Texas. About Us Close Contact Us Close Newsletter Close Portal Login Austin, TX Accounting Firm | Home Page | Lolley and Associates Skip to content About Tax Center Resources Contact An Austin, Texas Accounting Firm Serving Businesses and Individuals With Complex Tax Needs. Lolley & Associates experienced CPAs perform tax services, audits, reviews, compilations, and advisory services for businesses and individuals throughout Austin and Central Texas. About Us Close Contact Us Close Newsletter Close Portal Login Austin, TX Accounting Firm | Home Page | Lolley and Associates Skip to content About Tax Center Resources Contact An Austin, Texas Accounting Firm Serving Businesses and Individuals With Complex Tax Needs. Lolley & Associates experienced CPAs perform tax services, audits, reviews, compilations, and advisory services for businesses and individuals throughout Austin and Central Texas. About Us Close Contact Us Close Newsletter Close Portal Login Austin, TX Accounting Firm | About Our Firm Page | Lolley and Associates Skip to content About Our Firm Home Lolley & Associates is a firm of certified public accountants and management consultants with an office in Austin, Texas. We are a rapidly growing public accounting firm as a result of continuing client referrals. As a full-service public accounting firm, we offer a wide variety of services. We serve hundreds of clients in the private sector - from the very small to the very large. It is our philosophy to be unique by providing the broad range of service and in-depth industry experience our clients expect; and, at the same time, retain the personal service and responsiveness which has contributed to our growth. We believe in the value of relationships. We view every client relationship like a partnership, and truly believe that our success is a result of your success. We are committed to providing close, personal attention to our clients. We take pride in giving you the assurance that the personal assistance you receive comes from years of advanced training, technical experience and financial acumen. Our continual investment of time and resources in professional continuing education, state-of-the-art computer technology and extensive business relationships is indicative of our commitment to excellence. All of our professional staff receive intensive training in all areas of accounting, auditing, taxation and management. Our Mission Our mission is to help clients maintain financial viability in the present, while taking a proactive approach to achieve future goals. This requires open communication to reach an understanding of our clients' needs through research and sound analysis. Lolley & Associates is dedicated to meeting these goals with high standards of excellence and professionalism. We have been a staple of the area's business community for years, and pride ourselves on the level of esteem we have earned. Our dedication to hard work has earned the respect of the business and financial community in and around the area. We believe this to be a direct derivative of our talent and responsiveness to our client base. Whether you are a current or prospective client, rest assured that individuals and businesses who choose Lolley & Associates receive competent and timely advice. Our Team R. Lance Lolley, CPA Email: llolley@cpalolley.com Education: Bachelor of Business Administration (Accounting), University of North Texas Concentration & Experience Mr. Lolley has over 40 years experience in public accounting and focuses his practice on closely held businesses, consulting and advising business owners on taxation, financial reporting, and estate planning. He also has substantial practice focus in advising not-for-profit organizations. Professional Affiliations Certified Public Accountant; American Institute of Certified Public Accountants, Texas Society of Certified Public Accountants Kristen Haines, CPA Email: khaines@cpalolley.com Education: Bachelor of Business Administration (Accounting), Southern Methodist University Concentration & Experience Kristen was born and raised in Texas and attended Southern Methodist University, earning a Bachelor s degree in Accounting. She moved to Austin in 2006 and now resides just south in Buda, TX. She has worked in public accounting for 19 years with a broad range of industries including manufacturing, retail, oil and gas, public utility, benefit plans and government. She has been part of the Lolley& Associates team since 2009. While not working, she spends most of her time with her husband, Tim, and her two kids, Turner and Keller. She spends a lot of her time shuttling kids to sports practices and games or exercising her energetic dog, Hank (Viszla). When time allows, she enjoys traveling, gardening, reading, and baking. Professional Affiliations Certified Public Accountant; American Institute of Certified Public Accountants, Texas Society of Certified Public Accountants Kim Harvey Email: kharvey@cpalolley.com Education: Bachelor of Business Administration (Accounting), University of Houston Magna Cum Laude with Honors Concentration & Experience Ms. Harvey's primary concentration is in the areas of corporate, partnership and individual taxation, and she has significant experience in trust and estate tax compliance. She has been a part of the Lolley & Associates team since 2001. Kathleen Hausenfluck, CPA Email: khausenfluck@cpalolley.com Education: Bachelor of Business Administration (Finance) and Masters in Professional Accounting, University of Texas at Austin Concentration & Experience Ms. Hausenfluck has over 12 years experience in public accounting with emphasis in tax planning and compliance and business consulting. She has a experience with a broad range of industries including real estate, construction, retail, healthcare, technology, and professional services firms. She joined the Lolley & Associates team in 2015. Professional Affiliations Certified Public Accountant; American Institute of Certified Public Accountants; Texas Society of Certified Public Accountants Nolan Neises, CPA Email: nneises@cpalolley.com Phone: 512-472-0123 ext. 5 Education: Bachelor of Administration (Accounting), Wichita State University Nolan received his CPA license in 2020 and has over ten years experience in public accounting. During his career, he has helped clients in a variety of industries, ranging from: real estate, legal and professional, financial services, technology services, healthcare, and retail. He specializes in partnership, small business, and individual tax issues. He has helped clients navigate through a myriad of complex tax issues such as: buying or selling a business, like-kind exchanges, and staying in compliance with partnership tax laws for income, expense and deduction allocations. When he is away from the office, he enjoys playing tennis, watching standup comedy, and playing the guitar. Maria Virani Email: mvirani@cpalolley.com Phone: 512-472-0123 ext 6 Education: Masters degree in Finance Ms. Virani joined our firm in November 2020 as an auditor. She began her accounting career in 2010 after graduating with a Master's degree in finance. She specializes in auditing, reviews and compilation of financial statements. Ann Ferrara Email: ataylor@cpalolley.com Phone: 810-869-1138 Education: BBA Ann is one of our administrative assistants. She holds a BBA and has 23 year's experience in office administration. Ann has worked in various areas of industry including advertising and education before finding her home at L&A. Jose Valls Email: jvalls@cpalolley.com Phone: 512-472-0123 ext 8 Education: BBA in Public Accounting - University of Puerto Rico Jose has five years of public accounting experience and has serviced clients in diverse industries with an emphasis on bookkeeping, payroll and tax preparation. Patti Lolley Email: plolley@cpalolley.com Phone: 512-472-0123 ext 2 Patti was born and raised in Texas and calls Buda her home. Prior to L&A, she worked as a Vice President of Administration and Accounting for 18 years in the Oil & Gas Industry. She has been part of the Lolley & Associates team since 2009 as our Office Manager. While not working, she spends most of her time with her husband, Lane, her four children and her three grandchildren. She enjoys having family dinners, gardening, and walking with her two Boxer dogs, Tucker and Darby. Lolley and Associates 2206 Lake Austin Blvd Austin, TX 78703 Phone: (512) 472-0123 Fax: (512) 472-0127 In This Section: Contact Us Close Contact Us Close Newsletter Close Portal Login Austin, TX Accounting Firm | Services Page | Lolley and Associates Skip to content Services Home Lolley and Associates provides a wide range of services to individuals and businesses in a variety of industries. At Lolley and Associates, we strive to meet each client's specific needs in planning for the future and achieving their goals in an ever-changing financial and regulatory environment. Our professional services include: Tax Preparation Services Assurance and Advisory Services Tax Preparation Services At Lolley and Associates, we guide our clients through a full range of tax planning and preparation decisions with strategies that minimize your tax liabilities, maximize your cash flow and keep you on track to your financial goals. Our expertise, experience, analysis and thorough research allow us to optimize financial opportunities to be found in existing as well as recently altered tax laws. We are knowledgeable and up to date on the tax laws and can make sense of your receipts, bills and notices. Assurance Services Lolley",
  "use cases": "Walking through the tax preparation process step-by-step | Explaining the benefits of tax planning for small businesses | Demonstrating how assurance services can reduce financial risk",
  "services": "Tax services | Audits | Reviews | Compilations | Advisory services | Tax planning | Tax preparation | Assurance services",
  "email 1": "Hey Russell,\n\nI came across Lolley & Associates, CPA recently and thought I’d drop you a quick note.\n\nI'm Trent. I run Toon Theory, a whiteboard animation studio in the UK. We make simple, animated explainer videos that help people understand dense ideas. They're great for B2B services, thought leadership, and data-driven education.\n\nFor Lolley & Associates, CPA, I think there could be a great opportunity to use visual storytelling to help more people “get it” faster. Our animations are fully done-for-you: script, illustrations, voice, and storyboard; so you can use them for:\n\n• Walking through the tax preparation process step-by-step\n• Explaining the benefits of tax planning for small businesses\n• Demonstrating how assurance services can reduce financial risk\n\nThese animations don’t just explain, they convert; Many of our past clients see a big lift in engagement, trust, and sales.\n\nIf you're open to a quick preview, I could whip up a ten-second mock or short script tailored to something core at Lolley & Associates, CPA; No pressure, no cost, purely exploratory.\n\nAlways open to a quick chat if this feels worth exploring. In the meantime, you can view a few past projects via the link in my signature.\n\nKeep doing what you do, it's making an impact.\n\nRespectfully,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Hello Russell,\n\nJust circling back as I didn’t want you to miss out on the chance to explore whiteboard animation for Lolley & Associates, CPA.\n\nOur videos are designed to help businesses like yours increase engagement, boost clarity, and convert more customers; all with animated storytelling.\n\nIf you'd like, I can create a short demo or script as a no-pressure way to see how this could work for your team.\n\nYou’ll find examples of our work linked in my signature. Let me know if you’d like to see something specific.\n\nKind regards,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Greetings Russell,\n\nA quick follow-up before I close out my list. If now is not the right time, no worries at all.\n\nBut if you are a little curious about how whiteboard animation might help Lolley & Associates, CPA, I am still open to sharing a quick demo. No pressure. You can reply anytime or skim through some of our previous projects to see what we have done for other businesses. The link is in my signature.\n\nTake care,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175191268167.1960.10398957435903108366@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "no reply",
  "initial time": "19:23",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
{
  "business name": "Financial Foothold",
  "website url": "https://financialfoothold.com/",
  "location": "Austin, TX 78734",
  "industry": "Accounting",
  "first name": "Julianne",
  "middle name": "",
  "last name": "Autry",
  "title": "",
  "email": "julianne@financialfoothold.com",
  "web copy": "Financial Foothold | Austin, Texas Skip to content Meet with Us Instagram Facebook-square Linkedin Twitter Scale With Confidence. From bookkeeping to CFO-level financial management, Financial Foothold stays on top of your finances so you can focus on what matters most - growing your business. SCHEDULE A CALL Learn HOW WE HELP Gain Back-Office Support Understand Your Finances Grow Your Business Our Service Methodology Financial Foothold is a partner you can trust to manage your finances so you can focus on scaling your business with confidence. Our proven service methodology will provide you peace of mind that your business is in good hands. SCHEDULE A CALL Initial Meeting Our first step is to discuss your business objectives, current financial statements, concerns and what you desire from a bookkeeping company Diagnostic Review After the initial assessment, we will review your business and discuss areas of focus, suggested improvements and develop a plan to create an advisory and bookkeeping experience to meet your business needs. Implementation Over the next several months we will set up your finance and accounting system, establish streamlined business processes and introduce you to the team of skilled resources that work with your business. Monthly Cadence We will close your books, prepare your financial statements, analyze your business trends for potential issues, consult with you and any questions you may have and facilitate a monthly business review Quarterly Business Review Quarterly we will work with you to understand your financial results, develop forward looking forecasts and assist you in creating financial roadmaps to meet your annual objectives, adjusting scope of services as needed. Year-End Planning Review annual results and work with you to prepare a budget for the next year. We can also build a strategic plan for several years out modeling different scenarios. When you partner with Financial Foothold, you re Taking the stress out of managing your finances on your own Setting your business up to succeed in the long run Eliminating the risk of error that comes with doing finances yourself Gaining a true partner operating as an extension of your team, accessible anytime the stress out of managing your finances on your own Going beyond maintaining today s bottom line to invest in and plan for future growth Benefitting from the expertise of a team of advisors who are accountants and entrepreneurs who understand the unique challenges you face as a business owner Clients With Monthly Plans 0 + Client Tax Reports Filed On-Time 0 % working hours saved for every client annually 0 When you partner with Financial Foothold, you re Taking the stress out of managing your finances on your own Setting your business up to succeed in the long run Eliminating the risk of error that comes with doing finances yourself Gaining a true partner operating as an extension of your team, accessible anytime the stress out of managing your finances on your own Going beyond maintaining today s bottom line to invest in and plan for future growth Benefitting from the expertise of a team of advisors who are accountants and entrepreneurs who understand the unique challenges you face as a business owner Clients With Monthly Plans 0 + Client Tax Reports Filed On-Time 0 % working hours saved for every client annually 0 What Our Clients Say Julianne was so kind to work with! I was lost with accounting specific to my work industry. I randomly found her contact info and read where some of her clients she worked for were mortgage brokers like myself. I emailed Julianne and asked her for some advice on content. She was generous and quick with her response I would recommend her any day! Quintin Pierce It is a real pleasure working with Financial Foothold, starting from the Founder Julianne, and onboarding specialist Dennice. It has really helped our business during the start-up phase and we look forward to working with them as we grow. Mark Raizen My tax and bookkeeping providers retired and I found myself without professional accountants going into tax season. I met Julianne Autry many years ago and contacted her for a referral. Lucky for me, Financial Foothold was able to take on my small business, tidying up my Quickbooks online and helped me close out my business for 22! A CPA referral has worked seamlessly and my S corporation return is now in process.My company is tiny but I was treated kindly, professionally and quickly! I recommend highly. Leif Anders We have been with Financial Foothold and Julianne for many years now and she has always gone above and beyond to help us with our business. Julianne treats her clients like friends so every interaction with Financial Foothold is enjoyable. She is so responsive with whatever you need. Small businesses have unique needs at times, and JA is always there to help us through it. The professionals that work for her and Financial Foothold are the exact same. We have had the pleasure of working with Shelby since she has taken over our account and daily needs. Shelby is outstanding. She responds to every need lightening fast with an awesome attitude and energy. I cannot possibly give any individual or firm that provides services for small businesses a better recommendation. We feel very fortunate to work with the great people of Financial Foothold. Special thanks to JA and Shelby! RD Straface Such a pleasure working with Julianne and Dennice. I've been doing the bookkeeping for our firm for 20 years and I really wish I would have switched sooner. They make things so easy and work so quickly. So lucky to have found them. Simon Squad We'd love your Feedback! Share it with us and get featured! Your feedback is essential, and it will help Financial Foothold to excel and improve more! Give us a Review now! Let's grow together Lorem ipsum dolor sit amet, consectetur adipiscing elit. Ut elit tellus, luctus nec ullamcorper mattis, pulvinar dapibus leo. Apply now Check our vacancies Instagram Facebook-square Linkedin Twitter +1 512 551 0328 office/fax hello@financialfoothold.com 2121 Lohman s Crossing Ste 504, #674 Austin, TX 78734 Useful Links Sitemap Subscribe to our Newsletter News & Announcements From bookkeeping to CFO-level financial Management +1 512 551 0328 office/fax hello@financialfoothold.com 2121 Lohman s Crossing Ste 504, #674 Austin, TX 78734 Subscribe to our Newsletter News & Announcements From bookkeeping to CFO-level financial Management Financial Foothold | Austin, Texas Skip to content Meet with Us Instagram Facebook-square Linkedin Twitter Scale With Confidence. From bookkeeping to CFO-level financial management, Financial Foothold stays on top of your finances so you can focus on what matters most - growing your business. SCHEDULE A CALL Learn HOW WE HELP Gain Back-Office Support Understand Your Finances Grow Your Business Our Service Methodology Financial Foothold is a partner you can trust to manage your finances so you can focus on scaling your business with confidence. Our proven service methodology will provide you peace of mind that your business is in good hands. SCHEDULE A CALL Initial Meeting Our first step is to discuss your business objectives, current financial statements, concerns and what you desire from a bookkeeping company Diagnostic Review After the initial assessment, we will review your business and discuss areas of focus, suggested improvements and develop a plan to create an advisory and bookkeeping experience to meet your business needs. Implementation Over the next several months we will set up your finance and accounting system, establish streamlined business processes and introduce you to the team of skilled resources that work with your business. Monthly Cadence We will close your books, prepare your financial statements, analyze your business trends for potential issues, consult with you and any questions you may have and facilitate a monthly business review Quarterly Business Review Quarterly we will work with you to understand your financial results, develop forward looking forecasts and assist you in creating financial roadmaps to meet your annual objectives, adjusting scope of services as needed. Year-End Planning Review annual results and work with you to prepare a budget for the next year. We can also build a strategic plan for several years out modeling different scenarios. When you partner with Financial Foothold, you re Taking the stress out of managing your finances on your own Setting your business up to succeed in the long run Eliminating the risk of error that comes with doing finances yourself Gaining a true partner operating as an extension of your team, accessible anytime the stress out of managing your finances on your own Going beyond maintaining today s bottom line to invest in and plan for future growth Benefitting from the expertise of a team of advisors who are accountants and entrepreneurs who understand the unique challenges you face as a business owner Clients With Monthly Plans 0 + Client Tax Reports Filed On-Time 0 % working hours saved for every client annually 0 When you partner with Financial Foothold, you re Taking the stress out of managing your finances on your own Setting your business up to succeed in the long run Eliminating the risk of error that comes with doing finances yourself Gaining a true partner operating as an extension of your team, accessible anytime the stress out of managing your finances on your own Going beyond maintaining today s bottom line to invest in and plan for future growth Benefitting from the expertise of a team of advisors who are accountants and entrepreneurs who understand the unique challenges you face as a business owner Clients With Monthly Plans 0 + Client Tax Reports Filed On-Time 0 % working hours saved for every client annually 0 What Our Clients Say Julianne was so kind to work with! I was lost with accounting specific to my work industry. I randomly found her contact info and r",
  "use cases": "| Walking through the benefits of outsourcing CFO-level financial management | Explaining how to set up finance and accounting systems efficiently | Demonstrating how to streamline business processes for increased productivity",
  "services": "Bookkeeping | CFO-level financial management | Financial statement preparation | Financial analysis | Business consulting | Financial forecasting | Financial roadmap creation | Budget preparation | Strategic planning | Tax preparation | QuickBooks Online support | S corporation tax return preparation | Setting up finance and accounting systems | Streamlining business processes | Monthly business reviews | Quarterly business reviews | Year-end planning | Advisory services",
  "email 1": "Hello Julianne,\n\nI just saw Financial Foothold and thought you might be the right person to speak with.\n\nI'm Trent, and I run Toon Theory; an animation studio based in the UK. We make whiteboard videos that break down complex ideas with simple, hand-drawn visuals. It’s perfect for B2B, thought leadership, and data-driven education.\n\nI think Financial Foothold could really benefit from using visual storytelling to explain things faster and make them stick. We take care of everything: scripting, illustration, voiceover and storyboarding; so you can use the final video for:\n\n• Demonstrating how to streamline business processes for increased productivity\n• Explaining how to set up finance and accounting systems efficiently\n• Walking through the benefits of outsourcing CFO-level financial management\n\nWhether it’s more signups, better retention, or faster understanding, these animations know how to hit hard. And they move the needle where it counts.\n\nI'd be happy to draft a ten-second demo around something core to your brand. Totally low-lift, just keen to explore what this could look like with Financial Foothold's voice behind it.\n\nReply anytime if you'd like to talk more about this. There’s also a link below with some samples of what we’ve done before.\n\nThanks for leading with both heart and strategy.\n\nRespectfully,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Hello Julianne,\n\nReaching out again about the opportunity for Financial Foothold to stand out using whiteboard animation.\n\nWhether it’s for pitching, explaining products, or internal training, these videos really hit the nail on the head.\n\nIf you’re open to it, I can prepare a quick sketch or script sample tailored to your brand; no pressure at all.\n\nYou’ll find examples of our previous work linked below. Let me know if you’d like to explore the fit.\n\nBest wishes,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Howdy Julianne,\n\nIf you are still considering creative ways to showcase Financial Foothold's value offerings, animated storytelling could be the missing piece of the puzzle to accelerate those conversions.\n\nI would be happy to send over a short visual teaser to get the ideas flowing.\n\nNo pressure, just a creative option to keep in mind. Reply anytime or take a peek at some of our previous work. The link is in my signature.\n\nWith appreciation,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175191303677.1936.364743341672917361@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "no reply",
  "initial time": "19:29",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
{
  "business name": "JWC Employee Retention Tax Credit Advisory CPA",
  "website url": "https://www.ertcadvisors.com/",
  "location": "Austin, TX 78757",
  "industry": "Accounting",
  "first name": "Jace",
  "middle name": "W.",
  "last name": "Campbell",
  "title": "Managing Member",
  "email": "jace@ertcadvisors.com",
  "web copy": "JWC ERTC Advisory CPA Trusted Tax Professional Specializing in ERC (512) 790-7880 Home About Us Integrity Initiative Services Done For You ERC Claims Independent ERC Eligibility Review FAQs Blog Watch Latest Webinar The Nation's Only Registered CPA Firm Specializing in ERC Done-for-You ERTC Claims 2nd Opinion Eligibility Review IRS ERTC Audit Defense Expert Witness Services The CPA Firm That Other CPA's Call for ERC . . . What We Believe We believe taxpayers deserve to explore Employee Retention Tax Credits without the high-pressure gimmicks of ERC promoters - cold calling, spamming your inbox and blowing up your SMS with click-bait guarantees leading you to legal peril. Reputable tax professionals don't operate in that manner. We answer to a State Accounting Board - to a Code of Ethics that requires transparency and client accountability. When you engage us, you will be educated about how you are (or are not) eligible for ERC. You are never required to sign a Power of Attorney . You provide no confidential payroll records before your eligibility is determined. And most importantly, YOU REMAIN IN CONTROL . You are never forced to file your amended tax return if you do not feel comfortable- even after we've completed all the work. If you are not comfortable, then we have not done our job. Services from an ERTC CPA Done-for-you erc claims Our Done-for-You ERC service leaves the complexity to our CPA's, but you remain firmly in control of your tax returns. We do not ask you to sign a Power of Attorney. The IRS expects you to understand what this is and why you qualify - and we make sure that happens. Read about our Ironclad Integrity Initiative and how you can protect yourself from unscrupulous ERC promoters. \"Sleep Well\" erc eligibility review You are a bit skeptical of how exactly you qualified for ERC - and for good reason. The IRS has recently warned of ERC Promoters pushing false eligibility narratives. So much so that they've opened a new program for taxpayers to voluntary repay their ERC refunds to avoid penalties. Let our CPA's review your eligibility. Our flat-fee engagement puts an independent, second set of eyes on your file so you can sleep well during these next 3 years of ERC audits. Or get out ahead of the audits - pay back your credits, avoid penalties and interest, and recoup the outrageous fees you paid to the ERC \"experts\". See how our Customized ERTC Eligibility Review brings a whole new dimension to \"the softest pillow is a clear conscience\" and you're going to sleep well after this. irs ertc audit defense ERTC Audits are taking on a life of their own as the IRS has gone to war with ERC Promoters. Our secret-shopping of these other firms has revealed that 'audit defense' for them means defending the calculations . . . not defending your eligibility. If you receive an IDR (Information Data Request) related to ERTC and the firm that prepared your claims has not taken the lead - talk to us immediately. Your very first interaction with the IRS agent sets the tone and you want an IRS Controversy Expert involved from Day 0 to ensure your response is viewed in the most favorable light. Call us immediately at (512) 790-7880. Ask to speak with Jace directly and let the front desk know this is for an IRS Audit. erc expert witness services Fellow CPA's & Tax Controversy Attorneys: Sometimes you just need the perspective of another tax professional who has personally signed over 9,000 amended payroll tax returns. We've played this by the book since the first day and we are confident in the consistent application of ERC rules as intended by Congress. When you need an expert witness in your IRS audit protest, look no further than the CPA for ERTC. Call us immediately at (512) 790-7880. Ask to speak with Jace directly and let the front desk know this is Expert Witness Services. Services From An ERTC CPA Done-for-you erc claims Our Done-for-You ERC service leaves the complexity to our CPA's, but you remain firmly in control of your tax returns. We do not ask you to sign a Power of Attorney. The IRS expects you to understand what this is and why you qualify - and we make sure that happens. Read about our Ironclad Integrity Initiative and how you can protect yourself from unscrupulous ERC promoters. \"Sleep Well\" erc eligibility review You are a bit skeptical of how exactly you qualified for ERC - and for good reason. The IRS has recently warned of ERC Promoters pushing false eligibility narratives. So much so that they've opened a new program for taxpayers to voluntary repay their ERC refunds to avoid penalties. Let our CPA's review your eligibility. Our flat-fee engagement puts an independent, second set of eyes on your file so you can sleep well during these next 3 years of ERC audits. Or get out ahead of the audits - pay back your credits, avoid penalties and interest, and recoup the outrageous fees you paid to the ERC \"experts\". See how our Customized ERTC Eligibility Review brings a whole new dimension to \"the softest pillow is a clear conscience\" and you're going to sleep well after this. irs ertc audit defense ERTC Audits are taking on a life of their own as the IRS has gone to war with ERC Promoters. Our secret-shopping of these other firms has revealed that 'audit defense' for them means defending the calculations . . . not defending your eligibility. If you receive an IDR (Information Data Request) related to ERTC and the firm that prepared your claims has not taken the lead - talk to us immediately. Your very first interaction with the IRS agent sets the tone and you want an IRS Controversy Expert involved from Day 0 to ensure your response is viewed in the most favorable light. Call us immediately at (512) 790-7880. Ask to speak with Jace directly and let the front desk know this is for an IRS Audit. erc expert witness services Fellow CPA's & Tax Controversy Attorneys: Sometimes you just need the perspective of another tax professional who has personally signed over 9,000 amended payroll tax returns. We've played this by the book since the first day and we are confident in the consistent application of ERC rules as intended by Congress. When you need an expert witness in your IRS audit protest, look no further than the CPA for ERTC. Call us immediately at (512) 790-7880. Ask to speak with Jace directly and let the front desk know this is Expert Witness Services. Pre-Qualify Today Without a Phone Call Highest Rated ERTC CPA Firm with the Better Business Bureau Why Choose JWC ERTC Advisory CPA? because not every erc firm is created equally . . . Fighting Fraud from Step Zero Read how our Ironclad Integrity Initiative protects you in ways you never imagined. It is easy for anyone to say \"Trust us, we are a CPA firm\", but let us explain how our actions speak louder than words. Become an Educated Taxpayer Our founder thrives on educating taxpayers about ERC - whether you are our client or not. Videos, Webinars, Articles, eBooks, FAQ's and The Best Comprehensive ERTC Guide for CPA's . Anonymous ERC PreQualification Tool This is not another lead generation gimmick: No name. No email. No phone number. Simply enter your quarterly revenue figures and instantly learn for which quarters you automatically qualify. Begin Here Complimentary Discovery Call Sometimes you just need to talk this thing out. Schedule a call with Don to get your questions about ERC answered, pre-qualify your business and see why our clients rave about our client service. DIRECT PDF DOWNLOAD (No Opt-In Required) Easy to Start. Even Easier to Finish. The tax code is complicated enough for CPA's - no need to complicate this process for you as well. Simply register here and we'll shoot you an email on how you can move forward at your own pace. If you choose to move forward, every new engagement begins with a call with our Onboarding Team. We'll answer your questions, send you an engagement letter, and lay out each step in the process . . . clarity = confidence. Register Now Latest ERC News for You ERTC Advisory Can You Claim Employee Retention Credit in 2023? ERTC Advisory Can You Claim the Employee Retention Credit in 2022? ERTC Advisory Employee Retention Credit Scams: What You Need to Know ERTC Advisory Can You Claim Employee Retention Credit in 2024? See All Ultimate Guide to Employee Retention Tax Credits: Eligibility, Claims Process & Deadlines The Employee Retention Tax Credit (ERTC), in a nutshell, is a refundable tax credit specifically designed for businesses who retain their employees during times of financial strife. Read More Copyright 2025 | JWC Employee Retention Tax Credit Advisory CPA, LLC | Austin, TX | (512) 790-7880 | Privacy Policy Skip to content JWC ERTC Advisory CPA Trusted Tax Professional Specializing in ERC (512) 790-7880 Home About Us Integrity Initiative Services Done For You ERC Claims Independent ERC Eligibility Review FAQs Blog Watch Latest Webinar The Nation's Only Registered CPA Firm Specializing in ERC Done-for-You ERTC Claims 2nd Opinion Eligibility Review IRS ERTC Audit Defense Expert Witness Services The CPA Firm That Other CPA's Call for ERC . . . What We Believe We believe taxpayers deserve to explore Employee Retention Tax Credits without the high-pressure gimmicks of ERC promoters - cold calling, spamming your inbox and blowing up your SMS with click-bait guarantees leading you to legal peril. Reputable tax professionals don't operate in that manner. We answer to a State Accounting Board - to a Code of Ethics that requires transparency and client accountability. When you engage us, you will be educated about how you are (or are not) eligible for ERC. You are never required to sign a Power of Attorney . You provide no confidential payroll records before your eligibility is determined. And most importantly, YOU REMAIN IN CONTROL . You are never forced to file your amended tax return if you do not feel comfortable- even after we've completed all the work. If you are not comfortable, then we have not d",
  "use cases": "Walking through the ERC claims process step-by-step | Explaining ERC eligibility criteria to business owners | Demonstrating how to prepare for an IRS ERTC audit",
  "services": "Done-for-you ERC claims | ERC eligibility review | IRS ERTC audit defense | ERC expert witness services",
  "email 1": "Hi Jace,\n\nI came across JWC Employee Retention Tax Credit Advisory CPA recently and wanted to reach out directly.\n\nI'm Trent. I run Toon Theory, a whiteboard animation studio in the UK. We make simple, animated explainer videos that help people understand dense ideas. They're great for B2B services, thought leadership, and data-driven education.\n\nFor JWC Employee Retention Tax Credit Advisory CPA, I think there could be a great opportunity to use visual storytelling to help more people “get it” faster. Our animations are fully done-for-you: script, illustrations, voice, and storyboard; so you can use them for:\n\n• Explaining ERC eligibility criteria to business owners\n• Walking through the ERC claims process step-by-step\n• Demonstrating how to prepare for an IRS ERTC audit\n\nClients often tell us these pieces help reduce bloat, increase clarity, and lead to more meaningful conversions.\n\nI’d be glad to pull together a short demo; maybe a script or quick sketch; based on what JWC Employee Retention Tax Credit Advisory CPA does best. No pressure, just a chance to preview what it might look and sound like.\n\nJust reach out if you’d like to continue the conversation. You’ll find a few previous projects linked in the signature below.\n\nKeep doing what you do, it's making an impact.\n\nCheers,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 2": "Good day Jace,\n\nI wanted to circle back following my last email about using whiteboard animation at JWC Employee Retention Tax Credit Advisory CPA. These videos can really simplify complex ideas and help you connect with your audience in a memorable way.\n\nIf you’re open to it, I’d love to put together that quick sketch or script I mentioned earlier; something tailored specifically to one of your key offerings or a new product launch, perhaps.\n\nFeel free to reply anytime. And just in case you missed it, some of our past projects are linked in my signature.\n\nWarm regards,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "email 3": "Hello Jace,\n\nI just wanted to check in again and see if the idea of using whiteboard animation for JWC Employee Retention Tax Credit Advisory CPA has sparked any interest. Animation can be a great way to highlight key messages and bring stories to life in a memorable way.\n\nIf you'd like, I can put together a simple draft or a short sample video to show how this could work for you.\n\nYou can also find examples of our previous work linked in my signature. Please don’t hesitate to reply if you want to explore this.\n\nSincerely,\nTrent — Founder, Toon Theory\nwww.toontheory.com",
  "message id": "175191352681.1933.12676165554790429366@toontheory.com",
  "message id 2": "",
  "message id 3": "",
  "initial date": "2025-07-07",
  "follow-up 1 date": "",
  "follow-up 2 date": "",
  "reply": "no reply",
  "initial time": "19:37",
  "follow-up 1 time": "",
  "follow-up 2 time": ""
}
